const year4DataRaw = [
  {
    "ID": 1452,
    "NAME": "فرح احمد عبد الفتاح احمد عرفة",
    "Old_Total": 1768.5,
    "4th year": 1242.6875,
    "Cumulative": 3011.1875,
    "Percent": 97.76582792207792,
    "Rank": 1
  },
  {
    "ID": 1425,
    "NAME": "فادي محمد الدسوقي كمال الصايغ",
    "Old_Total": 1763,
    "4th year": 1229.1041666667,
    "Cumulative": 2992.1041666667,
    "Percent": 97.14623917749024,
    "Rank": 2
  },
  {
    "ID": 2307,
    "NAME": "يسر محمد محمد عبد العزيز رزق الشربينى",
    "Old_Total": 1756.75,
    "4th year": 1232.7083333333,
    "Cumulative": 2989.4583333333,
    "Percent": 97.06033549783443,
    "Rank": 3
  },
  {
    "ID": 1374,
    "NAME": "عمر محمد احمد المسلماني",
    "Old_Total": 1757.7,
    "4th year": 1230.0416666667,
    "Cumulative": 2987.7416666667,
    "Percent": 97.00459956710064,
    "Rank": 4
  },
  {
    "ID": 2331,
    "NAME": "يوسف امين عبد الرازق يوسف",
    "Old_Total": 1769.1,
    "4th year": 1217.8583333333,
    "Cumulative": 2986.9583333333,
    "Percent": 96.97916666666558,
    "Rank": 5
  },
  {
    "ID": 2319,
    "NAME": "يوستينا وائل اسحق سليمان",
    "Old_Total": 1767,
    "4th year": 1214.025,
    "Cumulative": 2981.025,
    "Percent": 96.78652597402598,
    "Rank": 6
  },
  {
    "ID": 606,
    "NAME": "حنان عصام محمد كامل دغيم",
    "Old_Total": 1756.95,
    "4th year": 1221.4375,
    "Cumulative": 2978.3875,
    "Percent": 96.70089285714285,
    "Rank": 7
  },
  {
    "ID": 1784,
    "NAME": "محمد مصطفى حسن عبد القوي العلقامي",
    "Old_Total": 1752,
    "4th year": 1224.7375,
    "Cumulative": 2976.7375,
    "Percent": 96.64732142857143,
    "Rank": 8
  },
  {
    "ID": 931,
    "NAME": "سماء طارق محمد ربيع محمد",
    "Old_Total": 1743.9,
    "4th year": 1231.7,
    "Cumulative": 2975.6,
    "Percent": 96.61038961038962,
    "Rank": 9
  },
  {
    "ID": 1703,
    "NAME": "محمد طارق محمد حمدى الطايفى",
    "Old_Total": 1745.85,
    "4th year": 1229.4125,
    "Cumulative": 2975.2625,
    "Percent": 96.59943181818181,
    "Rank": 10
  },
  {
    "ID": 1206,
    "NAME": "عبد الله عادل عبدالشفيع نعيم النقرود",
    "Old_Total": 1753.85,
    "4th year": 1220.6125,
    "Cumulative": 2974.4625,
    "Percent": 96.57345779220779,
    "Rank": 11
  },
  {
    "ID": 2084,
    "NAME": "مينا مجدى رمزى مسعود شنوده",
    "Old_Total": 1741.75,
    "4th year": 1231.3791666667,
    "Cumulative": 2973.1291666667,
    "Percent": 96.53016774891884,
    "Rank": 12
  },
  {
    "ID": 786,
    "NAME": "ريناد خالد سعيد عبد الرحمن",
    "Old_Total": 1751.7,
    "4th year": 1220.1291666667,
    "Cumulative": 2971.8291666667,
    "Percent": 96.48795995671105,
    "Rank": 13
  },
  {
    "ID": 1514,
    "NAME": "لارا وائل ابراهيم قبارى عبد الخالق",
    "Old_Total": 1765.05,
    "4th year": 1206.2416666667,
    "Cumulative": 2971.2916666667,
    "Percent": 96.47050865800973,
    "Rank": 14
  },
  {
    "ID": 2082,
    "NAME": "مينا عماد هلال عياد بخيت",
    "Old_Total": 1740.5,
    "4th year": 1230.4458333333,
    "Cumulative": 2970.9458333333,
    "Percent": 96.45928030302923,
    "Rank": 15
  },
  {
    "ID": 522,
    "NAME": "جورج اسامه عيسى خله موسى",
    "Old_Total": 1746.6,
    "4th year": 1224.0625,
    "Cumulative": 2970.6625,
    "Percent": 96.45008116883118,
    "Rank": 16
  },
  {
    "ID": 1616,
    "NAME": "محمد احمد محمد محمود فرغلي",
    "Old_Total": 1741.6,
    "4th year": 1227.3125,
    "Cumulative": 2968.9125,
    "Percent": 96.39326298701299,
    "Rank": 17
  },
  {
    "ID": 1923,
    "NAME": "مريم ياسر عطيه عربي محمد",
    "Old_Total": 1747.1,
    "4th year": 1221.5458333333,
    "Cumulative": 2968.6458333333,
    "Percent": 96.38460497835389,
    "Rank": 18
  },
  {
    "ID": 1805,
    "NAME": "محمد نبيل محمد عبد الوهاب حجاج",
    "Old_Total": 1740.8,
    "4th year": 1226.1041666667,
    "Cumulative": 2966.9041666667,
    "Percent": 96.32805735930845,
    "Rank": 19
  },
  {
    "ID": 946,
    "NAME": "سندس احمد محمد سيداحمد رضوان",
    "Old_Total": 1750.8,
    "4th year": 1215.4958333333,
    "Cumulative": 2966.2958333333,
    "Percent": 96.3083062770552,
    "Rank": 20
  },
  {
    "ID": 9,
    "NAME": "ابراهيم حسنى محمد على حسونه",
    "Old_Total": 1741.5,
    "4th year": 1223.3333333333,
    "Cumulative": 2964.8333333333,
    "Percent": 96.26082251082144,
    "Rank": 21
  },
  {
    "ID": 1424,
    "NAME": "فادي مجدي داود سعد",
    "Old_Total": 1732.85,
    "4th year": 1231.5875,
    "Cumulative": 2964.4375,
    "Percent": 96.24797077922078,
    "Rank": 22
  },
  {
    "ID": 615,
    "NAME": "حنين محمد حليم السيد",
    "Old_Total": 1740.3,
    "4th year": 1222.1083333333,
    "Cumulative": 2962.4083333333,
    "Percent": 96.18208874458767,
    "Rank": 23
  },
  {
    "ID": 754,
    "NAME": "روان محسن انور محمد احمد السيد",
    "Old_Total": 1731.65,
    "4th year": 1228.7333333333,
    "Cumulative": 2960.3833333333,
    "Percent": 96.11634199134092,
    "Rank": 24
  },
  {
    "ID": 2083,
    "NAME": "مينا فيكتور اندراوس اسكاروس",
    "Old_Total": 1747.5,
    "4th year": 1206.175,
    "Cumulative": 2953.675,
    "Percent": 95.89853896103897,
    "Rank": 25
  },
  {
    "ID": 2073,
    "NAME": "ميرنا حسام الدين يونس محمد يونس",
    "Old_Total": 1742,
    "4th year": 1209.15,
    "Cumulative": 2951.15,
    "Percent": 95.81655844155844,
    "Rank": 26
  },
  {
    "ID": 122,
    "NAME": "احمد محمد احمد عبد الهادى اسماعيل",
    "Old_Total": 1742.1,
    "4th year": 1208.0833333333,
    "Cumulative": 2950.1833333333,
    "Percent": 95.78517316017206,
    "Rank": 27
  },
  {
    "ID": 849,
    "NAME": "ساره رزق محمد القاضى",
    "Old_Total": 1739.1,
    "4th year": 1210.8416666667,
    "Cumulative": 2949.9416666667,
    "Percent": 95.77732683982791,
    "Rank": 28
  },
  {
    "ID": 1980,
    "NAME": "ملك محمود شهير ربيع",
    "Old_Total": 1750.6,
    "4th year": 1198.9916666667,
    "Cumulative": 2949.5916666667,
    "Percent": 95.76596320346428,
    "Rank": 29
  },
  {
    "ID": 745,
    "NAME": "رواء رفيق مبروك اسماعيل عوض",
    "Old_Total": 1745.6,
    "4th year": 1202.5541666667,
    "Cumulative": 2948.1541666667,
    "Percent": 95.7192911255422,
    "Rank": 30
  },
  {
    "ID": 376,
    "NAME": "ايمان عماد محمد عبد الرسول عيد",
    "Old_Total": 1732.55,
    "4th year": 1215.4166666667,
    "Cumulative": 2947.9666666667,
    "Percent": 95.71320346320455,
    "Rank": 31
  },
  {
    "ID": 527,
    "NAME": "جومانا يوسف متى يوسف باسيلى",
    "Old_Total": 1748.1,
    "4th year": 1198.6541666667,
    "Cumulative": 2946.7541666667,
    "Percent": 95.67383658008765,
    "Rank": 32
  },
  {
    "ID": 716,
    "NAME": "رفيف أحمد أبو العزم رمضان",
    "Old_Total": 1724.9,
    "4th year": 1221.7541666667,
    "Cumulative": 2946.6541666667,
    "Percent": 95.6705898268409,
    "Rank": 33
  },
  {
    "ID": 1271,
    "NAME": "علا ياسر ابراهيم ابوزيد ابراهيم",
    "Old_Total": 1749.1,
    "4th year": 1197.4,
    "Cumulative": 2946.5,
    "Percent": 95.66558441558442,
    "Rank": 34
  },
  {
    "ID": 1578,
    "NAME": "ماهر محمد عبد القادر ابو عقاده",
    "Old_Total": 1753.35,
    "4th year": 1192.3666666667,
    "Cumulative": 2945.7166666667,
    "Percent": 95.6401515151526,
    "Rank": 35
  },
  {
    "ID": 2281,
    "NAME": "ياسمين محمود حسين محمد الجوهرى",
    "Old_Total": 1747.1,
    "4th year": 1197.9125,
    "Cumulative": 2945.0125,
    "Percent": 95.61728896103897,
    "Rank": 36
  },
  {
    "ID": 812,
    "NAME": "زياد محمد ماهر عتمان",
    "Old_Total": 1729.85,
    "4th year": 1214.9583333333,
    "Cumulative": 2944.8083333333,
    "Percent": 95.61066017315908,
    "Rank": 37
  },
  {
    "ID": 141,
    "NAME": "احمد محمد فريد عبدالرحمن عبد الرحمن ابو هيكل",
    "Old_Total": 1725.25,
    "4th year": 1217.7541666667,
    "Cumulative": 2943.0041666667,
    "Percent": 95.55208333333442,
    "Rank": 38
  },
  {
    "ID": 774,
    "NAME": "ريتاج محمد احمد مغربى",
    "Old_Total": 1722.65,
    "4th year": 1216.9,
    "Cumulative": 2939.55,
    "Percent": 95.43993506493507,
    "Rank": 39
  },
  {
    "ID": 984,
    "NAME": "شمس فايد على محمد سليمان",
    "Old_Total": 1738.45,
    "4th year": 1201.0375,
    "Cumulative": 2939.4875,
    "Percent": 95.43790584415585,
    "Rank": 40
  },
  {
    "ID": 91,
    "NAME": "احمد عصام محمد الشيخ",
    "Old_Total": 1722.6,
    "4th year": 1214.8791666667,
    "Cumulative": 2937.4791666667,
    "Percent": 95.37270021645129,
    "Rank": 41
  },
  {
    "ID": 319,
    "NAME": "اميره خالد فرج عوض محمد ابو الحسين",
    "Old_Total": 1732.75,
    "4th year": 1204.0833333333,
    "Cumulative": 2936.8333333333,
    "Percent": 95.35173160173052,
    "Rank": 42
  },
  {
    "ID": 2004,
    "NAME": "منة الله شريف احمد محمدداود",
    "Old_Total": 1730.2,
    "4th year": 1206.3,
    "Cumulative": 2936.5,
    "Percent": 95.3409090909091,
    "Rank": 43
  },
  {
    "ID": 1751,
    "NAME": "محمد فخري فتحي الحوشي",
    "Old_Total": 1725.1,
    "4th year": 1209.8,
    "Cumulative": 2934.9,
    "Percent": 95.28896103896103,
    "Rank": 44
  },
  {
    "ID": 185,
    "NAME": "ادهم محمد على مرشدى على عبد الله",
    "Old_Total": 1720.3,
    "4th year": 1214.5875,
    "Cumulative": 2934.8875,
    "Percent": 95.28855519480518,
    "Rank": 45
  },
  {
    "ID": 2120,
    "NAME": "نرمين خالد بلال محمد زيدان",
    "Old_Total": 1751.35,
    "4th year": 1181.9416666667,
    "Cumulative": 2933.2916666667,
    "Percent": 95.23674242424349,
    "Rank": 46
  },
  {
    "ID": 721,
    "NAME": "رنا كامل حصافى حجر",
    "Old_Total": 1719.35,
    "4th year": 1211.5458333333,
    "Cumulative": 2930.8958333333,
    "Percent": 95.15895562770454,
    "Rank": 47
  },
  {
    "ID": 2345,
    "NAME": "يوسف عبداللاه محمد السيد زنباع",
    "Old_Total": 1747.5,
    "4th year": 1181.4291666667,
    "Cumulative": 2928.9291666667,
    "Percent": 95.0951028138539,
    "Rank": 48
  },
  {
    "ID": 2358,
    "NAME": "يوسف محمد وليد احمد",
    "Old_Total": 1727.5,
    "4th year": 1199.9208333333,
    "Cumulative": 2927.4208333333,
    "Percent": 95.04613095237987,
    "Rank": 49
  },
  {
    "ID": 747,
    "NAME": "روان احمد فضل محمود دياب",
    "Old_Total": 1712.1,
    "4th year": 1214.9875,
    "Cumulative": 2927.0875,
    "Percent": 95.03530844155843,
    "Rank": 50
  },
  {
    "ID": 132,
    "NAME": "احمد محمد صلاح الدين عبدالسلام السيد",
    "Old_Total": 1724.5,
    "4th year": 1202.5625,
    "Cumulative": 2927.0625,
    "Percent": 95.03449675324676,
    "Rank": 51
  },
  {
    "ID": 2457,
    "NAME": "هشام السيد فتحي مرسي حسين",
    "Old_Total": 1724.5,
    "4th year": 1202.4541666667,
    "Cumulative": 2926.9541666667,
    "Percent": 95.03097943723053,
    "Rank": 52
  },
  {
    "ID": 1607,
    "NAME": "محمد احمد عادل مجاهد",
    "Old_Total": 1747.6,
    "4th year": 1177.0791666667,
    "Cumulative": 2924.6791666667,
    "Percent": 94.95711580086689,
    "Rank": 53
  },
  {
    "ID": 37,
    "NAME": "احمد اشرف عبد الزين عباس",
    "Old_Total": 1741.7,
    "4th year": 1182.2583333333,
    "Cumulative": 2923.9583333333,
    "Percent": 94.93371212121104,
    "Rank": 54
  },
  {
    "ID": 140,
    "NAME": "احمد محمد فتحي النزهي",
    "Old_Total": 1720.75,
    "4th year": 1201.7333333333,
    "Cumulative": 2922.4833333333,
    "Percent": 94.88582251082143,
    "Rank": 55
  },
  {
    "ID": 1687,
    "NAME": "محمد سعيد عبد الحميد دخان",
    "Old_Total": 1718.95,
    "4th year": 1203.1166666667,
    "Cumulative": 2922.0666666667,
    "Percent": 94.87229437229546,
    "Rank": 56
  },
  {
    "ID": 603,
    "NAME": "حمزه مصطفى احمد محمد عبدالرازق",
    "Old_Total": 1743,
    "4th year": 1178.9416666667,
    "Cumulative": 2921.9416666667,
    "Percent": 94.86823593073701,
    "Rank": 57
  },
  {
    "ID": 1375,
    "NAME": "عمر محمد اشرف علي عبدالحميد بلبع",
    "Old_Total": 1725.25,
    "4th year": 1195.9875,
    "Cumulative": 2921.2375,
    "Percent": 94.84537337662339,
    "Rank": 58
  },
  {
    "ID": 1117,
    "NAME": "عبد الرحمن عادل السيد حسين",
    "Old_Total": 1735.35,
    "4th year": 1185.5666666667,
    "Cumulative": 2920.9166666667,
    "Percent": 94.83495670995778,
    "Rank": 59
  },
  {
    "ID": 1842,
    "NAME": "محمود عصام محمود رمضان الغرباوى",
    "Old_Total": 1722.85,
    "4th year": 1196.6416666667,
    "Cumulative": 2919.4916666667,
    "Percent": 94.78869047619156,
    "Rank": 60
  },
  {
    "ID": 475,
    "NAME": "تسنيم محمد ابو زيد نوح",
    "Old_Total": 1738.8,
    "4th year": 1180.1708333333,
    "Cumulative": 2918.9708333333,
    "Percent": 94.77178030302923,
    "Rank": 61
  },
  {
    "ID": 2259,
    "NAME": "وفاء مجدي مرسي خطاب",
    "Old_Total": 1718.5,
    "4th year": 1198.3541666667,
    "Cumulative": 2916.8541666667,
    "Percent": 94.70305735930843,
    "Rank": 62
  },
  {
    "ID": 1369,
    "NAME": "عمر عوض الله طه ابراهيم",
    "Old_Total": 1723.5,
    "4th year": 1192.9875,
    "Cumulative": 2916.4875,
    "Percent": 94.6911525974026,
    "Rank": 63
  },
  {
    "ID": 723,
    "NAME": "رنا محمد خميس مطر",
    "Old_Total": 1728.15,
    "4th year": 1187.625,
    "Cumulative": 2915.775,
    "Percent": 94.66801948051949,
    "Rank": 64
  },
  {
    "ID": 816,
    "NAME": "زياد هشام عطية عبد المنجي دعية",
    "Old_Total": 1711.25,
    "4th year": 1200.2166666667,
    "Cumulative": 2911.4666666667,
    "Percent": 94.5281385281396,
    "Rank": 65
  },
  {
    "ID": 953,
    "NAME": "سهيلة مصطفى صبحى توفيق شحاته",
    "Old_Total": 1704.8,
    "4th year": 1206.4625,
    "Cumulative": 2911.2625,
    "Percent": 94.52150974025973,
    "Rank": 66
  },
  {
    "ID": 1389,
    "NAME": "عمر ناجي حلمي الوكيل",
    "Old_Total": 1686.05,
    "4th year": 1223.9833333333,
    "Cumulative": 2910.0333333333,
    "Percent": 94.48160173160065,
    "Rank": 67
  },
  {
    "ID": 171,
    "NAME": "احمد هشام رشاد عاشور",
    "Old_Total": 1700.25,
    "4th year": 1206.4791666667,
    "Cumulative": 2906.7291666667,
    "Percent": 94.37432359307466,
    "Rank": 68
  },
  {
    "ID": 546,
    "NAME": "حبيبه السيد مشحوت مبروك حسين",
    "Old_Total": 1704.2,
    "4th year": 1202.375,
    "Cumulative": 2906.575,
    "Percent": 94.36931818181817,
    "Rank": 69
  },
  {
    "ID": 361,
    "NAME": "اية سلامة حسين عبدالمقصود الجابري",
    "Old_Total": 1735.5,
    "4th year": 1170.6541666667,
    "Cumulative": 2906.1541666667,
    "Percent": 94.35565476190584,
    "Rank": 70
  },
  {
    "ID": 1967,
    "NAME": "ملك ابراهيم السيد احمد الجارية",
    "Old_Total": 1717.2,
    "4th year": 1188.0166666667,
    "Cumulative": 2905.2166666667,
    "Percent": 94.32521645021752,
    "Rank": 71
  },
  {
    "ID": 2194,
    "NAME": "هاجر مجدي عبد الحميد محمد السيد جادو",
    "Old_Total": 1704.6,
    "4th year": 1198.7416666667,
    "Cumulative": 2903.3416666667,
    "Percent": 94.26433982684091,
    "Rank": 72
  },
  {
    "ID": 1912,
    "NAME": "مريم فهمى سعد فهمى سعد",
    "Old_Total": 1730.1,
    "4th year": 1173.1791666667,
    "Cumulative": 2903.2791666667,
    "Percent": 94.26231060606169,
    "Rank": 73
  },
  {
    "ID": 2174,
    "NAME": "نوران محمد الصافى محمد الصافى",
    "Old_Total": 1694.45,
    "4th year": 1208.7291666667,
    "Cumulative": 2903.1791666667,
    "Percent": 94.25906385281493,
    "Rank": 74
  },
  {
    "ID": 156,
    "NAME": "احمد معتز عبد المالك عبد الرحمن",
    "Old_Total": 1734.4,
    "4th year": 1168.4166666667,
    "Cumulative": 2902.8166666667,
    "Percent": 94.24729437229547,
    "Rank": 75
  },
  {
    "ID": 2355,
    "NAME": "يوسف محمد عبدالعزيز محمد",
    "Old_Total": 1686,
    "4th year": 1215.4166666667,
    "Cumulative": 2901.4166666667,
    "Percent": 94.20183982684091,
    "Rank": 76
  },
  {
    "ID": 118,
    "NAME": "احمد محمد ابراهيم شومان",
    "Old_Total": 1713.6,
    "4th year": 1185.45,
    "Cumulative": 2899.05,
    "Percent": 94.125,
    "Rank": 77
  },
  {
    "ID": 572,
    "NAME": "حسن محمد حسن محمد حسن البخشوان",
    "Old_Total": 1716.25,
    "4th year": 1182.7916666667,
    "Cumulative": 2899.0416666667,
    "Percent": 94.12472943723051,
    "Rank": 78
  },
  {
    "ID": 813,
    "NAME": "زياد محمود سيف النصر محمود",
    "Old_Total": 1703.3,
    "4th year": 1194.7708333333,
    "Cumulative": 2898.0708333333,
    "Percent": 94.09320887445779,
    "Rank": 79
  },
  {
    "ID": 1093,
    "NAME": "عبد الرحمن احمد عبده عوض الله بشير",
    "Old_Total": 1702.8,
    "4th year": 1194.1458333333,
    "Cumulative": 2896.9458333333,
    "Percent": 94.05668290043182,
    "Rank": 80
  },
  {
    "ID": 2272,
    "NAME": "يارا عاطف محمد عبد الوهاب دياب",
    "Old_Total": 1729.4,
    "4th year": 1166.7666666667,
    "Cumulative": 2896.1666666667,
    "Percent": 94.03138528138638,
    "Rank": 81
  },
  {
    "ID": 1601,
    "NAME": "محمد احمد توفيق محمد الجندي",
    "Old_Total": 1704.35,
    "4th year": 1189.6708333333,
    "Cumulative": 2894.0208333333,
    "Percent": 93.96171536796429,
    "Rank": 82
  },
  {
    "ID": 340,
    "NAME": "انس محمد عبد الفتاح محمد",
    "Old_Total": 1725.55,
    "4th year": 1168.3625,
    "Cumulative": 2893.9125,
    "Percent": 93.95819805194805,
    "Rank": 83
  },
  {
    "ID": 1677,
    "NAME": "محمد رفعت على لبيب عبد الرحمن",
    "Old_Total": 1709.8,
    "4th year": 1183.7083333333,
    "Cumulative": 2893.5083333333,
    "Percent": 93.94507575757468,
    "Rank": 84
  },
  {
    "ID": 1381,
    "NAME": "عمر محمد عبد الله السيد محمد",
    "Old_Total": 1689.7,
    "4th year": 1201.5875,
    "Cumulative": 2891.2875,
    "Percent": 93.8729707792208,
    "Rank": 85
  },
  {
    "ID": 860,
    "NAME": "ساره مصطفى امين عبد الرحيم",
    "Old_Total": 1688.9,
    "4th year": 1201.475,
    "Cumulative": 2890.375,
    "Percent": 93.84334415584415,
    "Rank": 86
  },
  {
    "ID": 1610,
    "NAME": "محمد احمد عطيتو حسن غزالى",
    "Old_Total": 1720.35,
    "4th year": 1169.0041666667,
    "Cumulative": 2889.3541666667,
    "Percent": 93.81020021645129,
    "Rank": 87
  },
  {
    "ID": 2069,
    "NAME": "ميار محمد عبد الرءوف على حنفي",
    "Old_Total": 1693.5,
    "4th year": 1195.5291666667,
    "Cumulative": 2889.0291666667,
    "Percent": 93.79964826839935,
    "Rank": 88
  },
  {
    "ID": 392,
    "NAME": "ايه احمد وهبه احمد المناوى",
    "Old_Total": 1707.8,
    "4th year": 1181.0125,
    "Cumulative": 2888.8125,
    "Percent": 93.79261363636363,
    "Rank": 89
  },
  {
    "ID": 1729,
    "NAME": "محمد عبد الواحد محمد عبدالواحد ابو حطب",
    "Old_Total": 1699.2,
    "4th year": 1188.9166666667,
    "Cumulative": 2888.1166666667,
    "Percent": 93.77002164502272,
    "Rank": 90
  },
  {
    "ID": 920,
    "NAME": "سلمى محمد شوقى احمد",
    "Old_Total": 1717.55,
    "4th year": 1169.3333333333,
    "Cumulative": 2886.8833333333,
    "Percent": 93.72997835497728,
    "Rank": 91
  },
  {
    "ID": 1363,
    "NAME": "عمر عبد العزيز فوزى منصور عكاشه",
    "Old_Total": 1711.9,
    "4th year": 1174.9208333333,
    "Cumulative": 2886.8208333333,
    "Percent": 93.72794913419806,
    "Rank": 92
  },
  {
    "ID": 2215,
    "NAME": "هبه مقبول صقر صالح عبدالله",
    "Old_Total": 1707.75,
    "4th year": 1178.6833333333,
    "Cumulative": 2886.4333333333,
    "Percent": 93.71536796536688,
    "Rank": 93
  },
  {
    "ID": 1355,
    "NAME": "عمر سامح شتا زيتون",
    "Old_Total": 1687.55,
    "4th year": 1198.3791666667,
    "Cumulative": 2885.9291666667,
    "Percent": 93.69899891775,
    "Rank": 94
  },
  {
    "ID": 2110,
    "NAME": "ندى عصام محمود ابراهيم محمد ابراهيم",
    "Old_Total": 1726,
    "4th year": 1159.4916666667,
    "Cumulative": 2885.4916666667,
    "Percent": 93.68479437229546,
    "Rank": 95
  },
  {
    "ID": 1401,
    "NAME": "عمرو مجدي حسن عبد العال",
    "Old_Total": 1681.9,
    "4th year": 1200.7958333333,
    "Cumulative": 2882.6958333333,
    "Percent": 93.59402056276949,
    "Rank": 96
  },
  {
    "ID": 2058,
    "NAME": "مى محمد حسن الطحان",
    "Old_Total": 1686.1,
    "4th year": 1196.1,
    "Cumulative": 2882.2,
    "Percent": 93.57792207792207,
    "Rank": 97
  },
  {
    "ID": 947,
    "NAME": "سندس محمد ابراهيم بركات الذهبى",
    "Old_Total": 1681.8,
    "4th year": 1199.4333333333,
    "Cumulative": 2881.2333333333,
    "Percent": 93.5465367965357,
    "Rank": 98
  },
  {
    "ID": 1332,
    "NAME": "عمر احمد فتحي سليمان",
    "Old_Total": 1701.9,
    "4th year": 1178.1416666667,
    "Cumulative": 2880.0416666667,
    "Percent": 93.50784632034741,
    "Rank": 99
  },
  {
    "ID": 997,
    "NAME": "شهد شريف عبده حسام الدين",
    "Old_Total": 1680.15,
    "4th year": 1199.3625,
    "Cumulative": 2879.5125,
    "Percent": 93.49066558441558,
    "Rank": 100
  },
  {
    "ID": 310,
    "NAME": "امورينا ميلاد حليم زكي",
    "Old_Total": 1668.9,
    "4th year": 1210.5875,
    "Cumulative": 2879.4875,
    "Percent": 93.48985389610391,
    "Rank": 101
  },
  {
    "ID": 719,
    "NAME": "رنا احمد محمد أمين غازي",
    "Old_Total": 1730.5,
    "4th year": 1148.9041666667,
    "Cumulative": 2879.4041666667,
    "Percent": 93.48714826839935,
    "Rank": 102
  },
  {
    "ID": 841,
    "NAME": "زينة هيثم أحمد حسين فهيم",
    "Old_Total": 1736.6,
    "4th year": 1141.0416666667,
    "Cumulative": 2877.6416666667,
    "Percent": 93.42992424242532,
    "Rank": 103
  },
  {
    "ID": 1555,
    "NAME": "لينه محمد حسن شحاته حسنين",
    "Old_Total": 1684.75,
    "4th year": 1191.0291666667,
    "Cumulative": 2875.7791666667,
    "Percent": 93.36945346320455,
    "Rank": 104
  },
  {
    "ID": 124,
    "NAME": "احمد محمد احمد مبروك زعيتر",
    "Old_Total": 1681.55,
    "4th year": 1193.8541666667,
    "Cumulative": 2875.4041666667,
    "Percent": 93.35727813852922,
    "Rank": 105
  },
  {
    "ID": 196,
    "NAME": "اسامه امام حسن امام عماره",
    "Old_Total": 1720,
    "4th year": 1154.6583333333,
    "Cumulative": 2874.6583333333,
    "Percent": 93.3330627705617,
    "Rank": 106
  },
  {
    "ID": 2173,
    "NAME": "نوران محمد احمد عبده زايد",
    "Old_Total": 1678.2,
    "4th year": 1196.1708333333,
    "Cumulative": 2874.3708333333,
    "Percent": 93.32372835497726,
    "Rank": 107
  },
  {
    "ID": 1913,
    "NAME": "مريم كامل عبد العزيز أحمد بدوى",
    "Old_Total": 1703.05,
    "4th year": 1171.0625,
    "Cumulative": 2874.1125,
    "Percent": 93.31534090909092,
    "Rank": 108
  },
  {
    "ID": 2346,
    "NAME": "يوسف علاء محمد فوزي الشرقاوي",
    "Old_Total": 1720,
    "4th year": 1150.7333333333,
    "Cumulative": 2870.7333333333,
    "Percent": 93.20562770562663,
    "Rank": 109
  },
  {
    "ID": 1339,
    "NAME": "عمر ايهاب احمد الفحام",
    "Old_Total": 1705.45,
    "4th year": 1165.0333333333,
    "Cumulative": 2870.4833333333,
    "Percent": 93.19751082250973,
    "Rank": 110
  },
  {
    "ID": 1465,
    "NAME": "فيروز عماد فتحى مراد",
    "Old_Total": 1671.65,
    "4th year": 1197.9458333333,
    "Cumulative": 2869.5958333333,
    "Percent": 93.16869588744481,
    "Rank": 111
  },
  {
    "ID": 1512,
    "NAME": "كيرلس جورج الفونس جورجى",
    "Old_Total": 1707.3,
    "4th year": 1160.55,
    "Cumulative": 2867.85,
    "Percent": 93.11201298701299,
    "Rank": 112
  },
  {
    "ID": 192,
    "NAME": "اروى محمود ابراهيم مرعي",
    "Old_Total": 1737.6,
    "4th year": 1130.2166666667,
    "Cumulative": 2867.8166666667,
    "Percent": 93.1109307359318,
    "Rank": 113
  },
  {
    "ID": 228,
    "NAME": "اسلام عبد السلام زكى عبد العاطى",
    "Old_Total": 1704,
    "4th year": 1163.5583333333,
    "Cumulative": 2867.5583333333,
    "Percent": 93.10254329004219,
    "Rank": 114
  },
  {
    "ID": 120,
    "NAME": "احمد محمد احمد الشيخ محمد سعد",
    "Old_Total": 1674.3,
    "4th year": 1191.5416666667,
    "Cumulative": 2865.8416666667,
    "Percent": 93.04680735930843,
    "Rank": 115
  },
  {
    "ID": 2217,
    "NAME": "هدير مصطفي صابر امين",
    "Old_Total": 1688,
    "4th year": 1177.7166666667,
    "Cumulative": 2865.7166666667,
    "Percent": 93.04274891774999,
    "Rank": 116
  },
  {
    "ID": 2159,
    "NAME": "نور محمود عبد الحليم مبروك",
    "Old_Total": 1691.5,
    "4th year": 1174.1958333333,
    "Cumulative": 2865.6958333333,
    "Percent": 93.04207251082143,
    "Rank": 117
  },
  {
    "ID": 761,
    "NAME": "روضه عيسى احمد موسى الفقى",
    "Old_Total": 1697.05,
    "4th year": 1168.3208333333,
    "Cumulative": 2865.3708333333,
    "Percent": 93.03152056276947,
    "Rank": 118
  },
  {
    "ID": 2018,
    "NAME": "منة عزت محمد ابراهيم عرقوب",
    "Old_Total": 1715.9,
    "4th year": 1149.1708333333,
    "Cumulative": 2865.0708333333,
    "Percent": 93.02178030302922,
    "Rank": 119
  },
  {
    "ID": 2351,
    "NAME": "يوسف محمد السيد محمد السيد",
    "Old_Total": 1701.5,
    "4th year": 1163.0875,
    "Cumulative": 2864.5875,
    "Percent": 93.00608766233766,
    "Rank": 120
  },
  {
    "ID": 80,
    "NAME": "احمد طارق السيد عثمان",
    "Old_Total": 1696.2,
    "4th year": 1168.1708333333,
    "Cumulative": 2864.3708333333,
    "Percent": 92.99905303030194,
    "Rank": 121
  },
  {
    "ID": 840,
    "NAME": "زينة هشام محمود ابراهيم محمود",
    "Old_Total": 1718.35,
    "4th year": 1143.4541666667,
    "Cumulative": 2861.8041666667,
    "Percent": 92.91571969697078,
    "Rank": 122
  },
  {
    "ID": 1034,
    "NAME": "صفا السيد ابراهيم خميس",
    "Old_Total": 1712.95,
    "4th year": 1148.525,
    "Cumulative": 2861.475,
    "Percent": 92.90503246753248,
    "Rank": 123
  },
  {
    "ID": 1946,
    "NAME": "معاذ مصطفي محمود علي",
    "Old_Total": 1703.4,
    "4th year": 1154.8541666667,
    "Cumulative": 2858.2541666667,
    "Percent": 92.80045995671105,
    "Rank": 124
  },
  {
    "ID": 1097,
    "NAME": "عبد الرحمن احمد محمود احمد الزكى",
    "Old_Total": 1708.1,
    "4th year": 1149.5666666667,
    "Cumulative": 2857.6666666667,
    "Percent": 92.78138528138635,
    "Rank": 125
  },
  {
    "ID": 2458,
    "NAME": "بسنت عبد المنعم سلام الصافي",
    "Old_Total": 1691.3,
    "4th year": 1165.025,
    "Cumulative": 2856.325,
    "Percent": 92.73782467532466,
    "Rank": 126
  },
  {
    "ID": 1613,
    "NAME": "محمد احمد محمد السعيد خليل عقدة",
    "Old_Total": 1665.05,
    "4th year": 1189.5916666667,
    "Cumulative": 2854.6416666667,
    "Percent": 92.68317099567209,
    "Rank": 127
  },
  {
    "ID": 1431,
    "NAME": "فاروق شريف فاروق الزواوي",
    "Old_Total": 1690.68,
    "4th year": 1163.8833333333,
    "Cumulative": 2854.5633333333,
    "Percent": 92.68062770562662,
    "Rank": 128
  },
  {
    "ID": 933,
    "NAME": "سماح احمد عبدالسلام احمد الشرمة",
    "Old_Total": 1660.6,
    "4th year": 1193.5875,
    "Cumulative": 2854.1875,
    "Percent": 92.66842532467533,
    "Rank": 129
  },
  {
    "ID": 1415,
    "NAME": "غادة عبد المجيد احمد عبد المجيد ابو حى",
    "Old_Total": 1675.35,
    "4th year": 1178.5,
    "Cumulative": 2853.85,
    "Percent": 92.65746753246754,
    "Rank": 130
  },
  {
    "ID": 2085,
    "NAME": "مينا ناصف حنا سيف حنا",
    "Old_Total": 1671.4,
    "4th year": 1182.4083333333,
    "Cumulative": 2853.8083333333,
    "Percent": 92.65611471861365,
    "Rank": 131
  },
  {
    "ID": 2050,
    "NAME": "مؤمن محمد عبد القادر عبد الغني",
    "Old_Total": 1695.25,
    "4th year": 1157.7583333333,
    "Cumulative": 2853.0083333333,
    "Percent": 92.6301406926396,
    "Rank": 132
  },
  {
    "ID": 2090,
    "NAME": "ناديه سعد عبدالفتاح محمد العجمى",
    "Old_Total": 1687.95,
    "4th year": 1164.3833333333,
    "Cumulative": 2852.3333333333,
    "Percent": 92.60822510822405,
    "Rank": 133
  },
  {
    "ID": 925,
    "NAME": "سلوان محمود احمد امام",
    "Old_Total": 1694.7,
    "4th year": 1157.2,
    "Cumulative": 2851.9,
    "Percent": 92.59415584415585,
    "Rank": 134
  },
  {
    "ID": 983,
    "NAME": "شمس سليمان غازى ابراهيم الجنيبهى",
    "Old_Total": 1676.6,
    "4th year": 1175.1708333333,
    "Cumulative": 2851.7708333333,
    "Percent": 92.58996212121103,
    "Rank": 135
  },
  {
    "ID": 1634,
    "NAME": "محمد السيد محمد السيد عبدالحميد",
    "Old_Total": 1692.25,
    "4th year": 1158.3416666667,
    "Cumulative": 2850.5916666667,
    "Percent": 92.55167748917856,
    "Rank": 136
  },
  {
    "ID": 1230,
    "NAME": "عبد الله محمود عبدالحليم محمد تهامي",
    "Old_Total": 1703.85,
    "4th year": 1146.45,
    "Cumulative": 2850.3,
    "Percent": 92.5422077922078,
    "Rank": 137
  },
  {
    "ID": 317,
    "NAME": "اميره بهاء إبراهيم محمد شعت",
    "Old_Total": 1704.2,
    "4th year": 1145.6125,
    "Cumulative": 2849.8125,
    "Percent": 92.52637987012987,
    "Rank": 138
  },
  {
    "ID": 1885,
    "NAME": "مريم طارق محمد الدمرداش محمد عبد السلام",
    "Old_Total": 1671.95,
    "4th year": 1177.75,
    "Cumulative": 2849.7,
    "Percent": 92.52272727272727,
    "Rank": 139
  },
  {
    "ID": 1119,
    "NAME": "عبد الرحمن عاطف عثمان العريف",
    "Old_Total": 1678.7,
    "4th year": 1170.5208333333,
    "Cumulative": 2849.2208333333,
    "Percent": 92.50716991341883,
    "Rank": 140
  },
  {
    "ID": 2002,
    "NAME": "منة الله زايد رياض سليمان حسين",
    "Old_Total": 1695.5,
    "4th year": 1153.6291666667,
    "Cumulative": 2849.1291666667,
    "Percent": 92.50419372294482,
    "Rank": 141
  },
  {
    "ID": 1092,
    "NAME": "عبد الرحمن احمد عبده عبده",
    "Old_Total": 1701.3,
    "4th year": 1146.525,
    "Cumulative": 2847.825,
    "Percent": 92.46185064935064,
    "Rank": 142
  },
  {
    "ID": 1282,
    "NAME": "على انور كامل أحمد حسانين",
    "Old_Total": 1711.8,
    "4th year": 1135.5708333333,
    "Cumulative": 2847.3708333333,
    "Percent": 92.44710497835389,
    "Rank": 143
  },
  {
    "ID": 1069,
    "NAME": "عاليا محمد احمد محمد حسن",
    "Old_Total": 1701.1,
    "4th year": 1145.8208333333,
    "Cumulative": 2846.9208333333,
    "Percent": 92.43249458874351,
    "Rank": 144
  },
  {
    "ID": 2270,
    "NAME": "يارا احمد السيد احمد خليل العشرى",
    "Old_Total": 1694.1,
    "4th year": 1152.6083333333,
    "Cumulative": 2846.7083333333,
    "Percent": 92.42559523809415,
    "Rank": 145
  },
  {
    "ID": 1102,
    "NAME": "عبد الرحمن السيد حامد رضوان",
    "Old_Total": 1673.25,
    "4th year": 1172.9458333333,
    "Cumulative": 2846.1958333333,
    "Percent": 92.40895562770454,
    "Rank": 146
  },
  {
    "ID": 1854,
    "NAME": "محمود محمد هارون صابر معيوف",
    "Old_Total": 1697.9,
    "4th year": 1147.1916666667,
    "Cumulative": 2845.0916666667,
    "Percent": 92.37310606060714,
    "Rank": 147
  },
  {
    "ID": 1977,
    "NAME": "ملك محمد عبد المنعم محمد إبراهيم",
    "Old_Total": 1676.95,
    "4th year": 1167.4166666667,
    "Cumulative": 2844.3666666667,
    "Percent": 92.34956709956819,
    "Rank": 148
  },
  {
    "ID": 545,
    "NAME": "حبيبه احمد فتحي عبدالباقي القريعي",
    "Old_Total": 1699.55,
    "4th year": 1144.425,
    "Cumulative": 2843.975,
    "Percent": 92.33685064935064,
    "Rank": 149
  },
  {
    "ID": 610,
    "NAME": "حنين باسم عبدالفتاح الامشيطى",
    "Old_Total": 1684.5,
    "4th year": 1159.4,
    "Cumulative": 2843.9,
    "Percent": 92.33441558441558,
    "Rank": 150
  },
  {
    "ID": 2288,
    "NAME": "يحيي احمد محمد مصطفي جمعة",
    "Old_Total": 1678.25,
    "4th year": 1164.675,
    "Cumulative": 2842.925,
    "Percent": 92.30275974025975,
    "Rank": 151
  },
  {
    "ID": 1588,
    "NAME": "مجد هيثم محمد الأمير",
    "Old_Total": 1683.3,
    "4th year": 1159.35,
    "Cumulative": 2842.65,
    "Percent": 92.29383116883115,
    "Rank": 152
  },
  {
    "ID": 2308,
    "NAME": "يسر ياسر جمعه امين جمعه سالم",
    "Old_Total": 1686,
    "4th year": 1156.4916666667,
    "Cumulative": 2842.4916666667,
    "Percent": 92.28869047619156,
    "Rank": 153
  },
  {
    "ID": 74,
    "NAME": "احمد شحاتة عبدالعزيز عبدالقادر",
    "Old_Total": 1672.5,
    "4th year": 1168.7958333333,
    "Cumulative": 2841.2958333333,
    "Percent": 92.24986471861364,
    "Rank": 154
  },
  {
    "ID": 2228,
    "NAME": "هنا محمد محمد لولح",
    "Old_Total": 1681,
    "4th year": 1160.05,
    "Cumulative": 2841.05,
    "Percent": 92.24188311688313,
    "Rank": 155
  },
  {
    "ID": 502,
    "NAME": "جنا عبد اللطيف محمود عبد اللطيف أحمد",
    "Old_Total": 1686.85,
    "4th year": 1154.1541666667,
    "Cumulative": 2841.0041666667,
    "Percent": 92.2403950216461,
    "Rank": 156
  },
  {
    "ID": 733,
    "NAME": "رندا اشرف سيد احمد عبد المقصود الجزار",
    "Old_Total": 1646.2,
    "4th year": 1194.375,
    "Cumulative": 2840.575,
    "Percent": 92.22646103896103,
    "Rank": 157
  },
  {
    "ID": 1074,
    "NAME": "عائشة متولي صلاح متولي",
    "Old_Total": 1686.4,
    "4th year": 1153.7458333333,
    "Cumulative": 2840.1458333333,
    "Percent": 92.21252705627599,
    "Rank": 158
  },
  {
    "ID": 248,
    "NAME": "اسماعيل سعيد فتح الله صالح زهران",
    "Old_Total": 1654.9,
    "4th year": 1183.0791666667,
    "Cumulative": 2837.9791666667,
    "Percent": 92.14218073593182,
    "Rank": 159
  },
  {
    "ID": 1384,
    "NAME": "عمر مصطفى احمد علام",
    "Old_Total": 1663.05,
    "4th year": 1173.8666666667,
    "Cumulative": 2836.9166666667,
    "Percent": 92.10768398268505,
    "Rank": 160
  },
  {
    "ID": 856,
    "NAME": "ساره على ابراهيم حجر",
    "Old_Total": 1710.6,
    "4th year": 1124.7083333333,
    "Cumulative": 2835.3083333333,
    "Percent": 92.05546536796427,
    "Rank": 161
  },
  {
    "ID": 749,
    "NAME": "روان ايمن ايوب ابراهيم بخيت",
    "Old_Total": 1689.5,
    "4th year": 1145.4416666667,
    "Cumulative": 2834.9416666667,
    "Percent": 92.04356060606169,
    "Rank": 162
  },
  {
    "ID": 691,
    "NAME": "رحمه محمد سعيد درويش البواب",
    "Old_Total": 1666.85,
    "4th year": 1167.5625,
    "Cumulative": 2834.4125,
    "Percent": 92.02637987012987,
    "Rank": 163
  },
  {
    "ID": 107,
    "NAME": "احمد فرج الله خضر احمد عبد العال",
    "Old_Total": 1678,
    "4th year": 1156.3458333333,
    "Cumulative": 2834.3458333333,
    "Percent": 92.02421536796429,
    "Rank": 164
  },
  {
    "ID": 1492,
    "NAME": "كريم احمد محمد عبده عبدالعال",
    "Old_Total": 1642.95,
    "4th year": 1189.8791666667,
    "Cumulative": 2832.8291666667,
    "Percent": 91.97497294372403,
    "Rank": 165
  },
  {
    "ID": 1473,
    "NAME": "فيلوباتير عادل صبحى عطا الله عطا",
    "Old_Total": 1678.65,
    "4th year": 1152.5166666667,
    "Cumulative": 2831.1666666667,
    "Percent": 91.92099567099676,
    "Rank": 166
  },
  {
    "ID": 1568,
    "NAME": "مارينا ابو الغيط عجيب يس",
    "Old_Total": 1665.35,
    "4th year": 1165.575,
    "Cumulative": 2830.925,
    "Percent": 91.91314935064936,
    "Rank": 167
  },
  {
    "ID": 31,
    "NAME": "احلام محمد خميس على عبدالكريم",
    "Old_Total": 1679.1,
    "4th year": 1150.6708333333,
    "Cumulative": 2829.7708333333,
    "Percent": 91.87567640692532,
    "Rank": 168
  },
  {
    "ID": 1939,
    "NAME": "مصطفى هشام محمد على منيسى",
    "Old_Total": 1700.3,
    "4th year": 1129.0875,
    "Cumulative": 2829.3875,
    "Percent": 91.86323051948051,
    "Rank": 169
  },
  {
    "ID": 163,
    "NAME": "احمد نبيل محمود عطاالله",
    "Old_Total": 1695.55,
    "4th year": 1133.3791666667,
    "Cumulative": 2828.9291666667,
    "Percent": 91.84834956710066,
    "Rank": 170
  },
  {
    "ID": 243,
    "NAME": "اسماء ماهر ابراهيم عبدالله نانه",
    "Old_Total": 1673.5,
    "4th year": 1154.8625,
    "Cumulative": 2828.3625,
    "Percent": 91.8299512987013,
    "Rank": 171
  },
  {
    "ID": 1695,
    "NAME": "محمد صبرى عبدالمقصود ابراهيم حمودة",
    "Old_Total": 1648.95,
    "4th year": 1179.2541666667,
    "Cumulative": 2828.2041666667,
    "Percent": 91.82481060606169,
    "Rank": 172
  },
  {
    "ID": 357,
    "NAME": "اية اسلام محمود حنفي",
    "Old_Total": 1695.25,
    "4th year": 1132.8833333333,
    "Cumulative": 2828.1333333333,
    "Percent": 91.82251082250974,
    "Rank": 173
  },
  {
    "ID": 1782,
    "NAME": "محمد مسعد شعيب محمد شعيب",
    "Old_Total": 1663.8,
    "4th year": 1164.225,
    "Cumulative": 2828.025,
    "Percent": 91.8189935064935,
    "Rank": 174
  },
  {
    "ID": 553,
    "NAME": "حبيبه وائل محمد احمد حامد",
    "Old_Total": 1683.2,
    "4th year": 1144.6583333333,
    "Cumulative": 2827.8583333333,
    "Percent": 91.81358225108117,
    "Rank": 175
  },
  {
    "ID": 2260,
    "NAME": "وفاء نادر عبده محمد متولى",
    "Old_Total": 1688.1,
    "4th year": 1139.7541666667,
    "Cumulative": 2827.8541666667,
    "Percent": 91.81344696969805,
    "Rank": 176
  },
  {
    "ID": 939,
    "NAME": "سمر محمد يسري محمد يوسف",
    "Old_Total": 1709.8,
    "4th year": 1117.975,
    "Cumulative": 2827.775,
    "Percent": 91.81087662337661,
    "Rank": 177
  },
  {
    "ID": 999,
    "NAME": "شهد صلاح احمد محمد سلام",
    "Old_Total": 1639.4,
    "4th year": 1188.1541666667,
    "Cumulative": 2827.5541666667,
    "Percent": 91.8037067099578,
    "Rank": 178
  },
  {
    "ID": 1459,
    "NAME": "فريدة علاء كامل محمد عيد",
    "Old_Total": 1672.6,
    "4th year": 1152.6208333333,
    "Cumulative": 2825.2208333333,
    "Percent": 91.72794913419806,
    "Rank": 179
  },
  {
    "ID": 2135,
    "NAME": "نوال شحاتة ابراهيم عبد الله بغدادى",
    "Old_Total": 1683.45,
    "4th year": 1141.4541666667,
    "Cumulative": 2824.9041666667,
    "Percent": 91.71766774891883,
    "Rank": 180
  },
  {
    "ID": 1099,
    "NAME": "عبد الرحمن اسلام عبدالنبى حسنين عبدالله",
    "Old_Total": 1680.45,
    "4th year": 1144.2625,
    "Cumulative": 2824.7125,
    "Percent": 91.7114448051948,
    "Rank": 181
  },
  {
    "ID": 1429,
    "NAME": "فارس محمد عماد الدين عبدالعزيز ساروخ",
    "Old_Total": 1685.8,
    "4th year": 1138.7958333333,
    "Cumulative": 2824.5958333333,
    "Percent": 91.70765692640585,
    "Rank": 182
  },
  {
    "ID": 208,
    "NAME": "اسامه محمد محمد غزى",
    "Old_Total": 1717.85,
    "4th year": 1105.2833333333,
    "Cumulative": 2823.1333333333,
    "Percent": 91.66017316017208,
    "Rank": 183
  },
  {
    "ID": 244,
    "NAME": "اسماء محمد عبدالعزيز ابراهيم محمد",
    "Old_Total": 1638.75,
    "4th year": 1183.4708333333,
    "Cumulative": 2822.2208333333,
    "Percent": 91.63054653679545,
    "Rank": 184
  },
  {
    "ID": 2230,
    "NAME": "هناء عبدالحليم ابراهيم احمد العشرى",
    "Old_Total": 1671.3,
    "4th year": 1149.4958333333,
    "Cumulative": 2820.7958333333,
    "Percent": 91.58428030302922,
    "Rank": 185
  },
  {
    "ID": 2112,
    "NAME": "ندى ماهر نجيب على راضى",
    "Old_Total": 1638.8,
    "4th year": 1181.5291666667,
    "Cumulative": 2820.3291666667,
    "Percent": 91.56912878787988,
    "Rank": 186
  },
  {
    "ID": 55,
    "NAME": "احمد حسين محمد محمد البصال",
    "Old_Total": 1702.7,
    "4th year": 1117.375,
    "Cumulative": 2820.075,
    "Percent": 91.56087662337661,
    "Rank": 187
  },
  {
    "ID": 787,
    "NAME": "ريناد محمد اسماعيل على موسى",
    "Old_Total": 1647.8,
    "4th year": 1171.9,
    "Cumulative": 2819.7,
    "Percent": 91.5487012987013,
    "Rank": 188
  },
  {
    "ID": 902,
    "NAME": "سعيد محمد سعيد عبدالجواد فرج",
    "Old_Total": 1658.2,
    "4th year": 1160.8958333333,
    "Cumulative": 2819.0958333333,
    "Percent": 91.52908549783442,
    "Rank": 189
  },
  {
    "ID": 485,
    "NAME": "تقى محمد اسماعيل على العبد",
    "Old_Total": 1646.5,
    "4th year": 1172.4708333333,
    "Cumulative": 2818.9708333333,
    "Percent": 91.52502705627597,
    "Rank": 190
  },
  {
    "ID": 1196,
    "NAME": "عبد الله حسام محمود مراد محمود",
    "Old_Total": 1620.7,
    "4th year": 1198.1291666667,
    "Cumulative": 2818.8291666667,
    "Percent": 91.52042748917857,
    "Rank": 191
  },
  {
    "ID": 403,
    "NAME": "ايهاب نبيل على عبده خميس",
    "Old_Total": 1643.45,
    "4th year": 1175.3541666667,
    "Cumulative": 2818.8041666667,
    "Percent": 91.51961580086689,
    "Rank": 192
  },
  {
    "ID": 432,
    "NAME": "بسمله فوزى ابراهيم ابو الحسن",
    "Old_Total": 1669.3,
    "4th year": 1149.1208333333,
    "Cumulative": 2818.4208333333,
    "Percent": 91.50716991341883,
    "Rank": 193
  },
  {
    "ID": 434,
    "NAME": "بسمله مصطفى عبد العاطى طلب مصطفى",
    "Old_Total": 1724.45,
    "4th year": 1093.1833333333,
    "Cumulative": 2817.6333333333,
    "Percent": 91.48160173160065,
    "Rank": 194
  },
  {
    "ID": 2350,
    "NAME": "يوسف محمد احمد محمد",
    "Old_Total": 1670.25,
    "4th year": 1147.2208333333,
    "Cumulative": 2817.4708333333,
    "Percent": 91.47632575757468,
    "Rank": 195
  },
  {
    "ID": 2029,
    "NAME": "منى عطيه على محمد ابو غيط",
    "Old_Total": 1672.35,
    "4th year": 1145.0041666667,
    "Cumulative": 2817.3541666667,
    "Percent": 91.47253787878896,
    "Rank": 196
  },
  {
    "ID": 1554,
    "NAME": "لينه ضياء ابو الحجاج محمد مصطفى",
    "Old_Total": 1673.6,
    "4th year": 1143.3583333333,
    "Cumulative": 2816.9583333333,
    "Percent": 91.45968614718505,
    "Rank": 197
  },
  {
    "ID": 1269,
    "NAME": "علا كمال جلال الغنام",
    "Old_Total": 1661.6,
    "4th year": 1155.0458333333,
    "Cumulative": 2816.6458333333,
    "Percent": 91.44954004328896,
    "Rank": 198
  },
  {
    "ID": 839,
    "NAME": "زينة شريف عبدالله محمود اسماعيل",
    "Old_Total": 1678.2,
    "4th year": 1137.8708333333,
    "Cumulative": 2816.0708333333,
    "Percent": 91.43087121212014,
    "Rank": 199
  },
  {
    "ID": 379,
    "NAME": "ايمان محمد عثمان محمد حسن",
    "Old_Total": 1694.4,
    "4th year": 1121.625,
    "Cumulative": 2816.025,
    "Percent": 91.42938311688312,
    "Rank": 200
  },
  {
    "ID": 288,
    "NAME": "السيد محمد جلال محمد البيلى",
    "Old_Total": 1661.6,
    "4th year": 1154.2958333333,
    "Cumulative": 2815.8958333333,
    "Percent": 91.42518939393831,
    "Rank": 201
  },
  {
    "ID": 234,
    "NAME": "اسماء ايمن محمد العريان",
    "Old_Total": 1650.9,
    "4th year": 1164.25,
    "Cumulative": 2815.15,
    "Percent": 91.40097402597402,
    "Rank": 202
  },
  {
    "ID": 1500,
    "NAME": "كريم محمد صبرى محمد احمد",
    "Old_Total": 1629.95,
    "4th year": 1184.8125,
    "Cumulative": 2814.7625,
    "Percent": 91.38839285714285,
    "Rank": 203
  },
  {
    "ID": 227,
    "NAME": "اسلام عاطف عبدالرازق عبدالرؤف",
    "Old_Total": 1696,
    "4th year": 1117.4541666667,
    "Cumulative": 2813.4541666667,
    "Percent": 91.34591450216558,
    "Rank": 204
  },
  {
    "ID": 637,
    "NAME": "خديجة احمد فوزى احمد",
    "Old_Total": 1647.75,
    "4th year": 1165.1333333333,
    "Cumulative": 2812.8833333333,
    "Percent": 91.32738095237987,
    "Rank": 205
  },
  {
    "ID": 1739,
    "NAME": "محمد علام عبد الستار عبد المنعم الصاوى",
    "Old_Total": 1687.8,
    "4th year": 1124.6,
    "Cumulative": 2812.4,
    "Percent": 91.3116883116883,
    "Rank": 206
  },
  {
    "ID": 1451,
    "NAME": "فرح صلاح عبدالنظير علي حسين",
    "Old_Total": 1686.75,
    "4th year": 1124.2625,
    "Cumulative": 2811.0125,
    "Percent": 91.2666396103896,
    "Rank": 207
  },
  {
    "ID": 530,
    "NAME": "جويرية احمد ابو الفتوح سلامه",
    "Old_Total": 1668.85,
    "4th year": 1141.7625,
    "Cumulative": 2810.6125,
    "Percent": 91.2536525974026,
    "Rank": 208
  },
  {
    "ID": 184,
    "NAME": "ادهم طارق هاشم الفولي",
    "Old_Total": 1642.05,
    "4th year": 1168.3833333333,
    "Cumulative": 2810.4333333333,
    "Percent": 91.2478354978344,
    "Rank": 209
  },
  {
    "ID": 1975,
    "NAME": "ملك فتحي محمد احمد موسي",
    "Old_Total": 1617.4,
    "4th year": 1192.7916666667,
    "Cumulative": 2810.1916666667,
    "Percent": 91.23998917749027,
    "Rank": 210
  },
  {
    "ID": 75,
    "NAME": "احمد شريف فتحي عبدالفتاح",
    "Old_Total": 1644.7,
    "4th year": 1164.9666666667,
    "Cumulative": 2809.6666666667,
    "Percent": 91.22294372294479,
    "Rank": 211
  },
  {
    "ID": 1128,
    "NAME": "عبد الرحمن على حمدى على أباظة",
    "Old_Total": 1650.55,
    "4th year": 1158.8333333333,
    "Cumulative": 2809.3833333333,
    "Percent": 91.21374458874351,
    "Rank": 212
  },
  {
    "ID": 2183,
    "NAME": "نورين عماد السيد يس",
    "Old_Total": 1657.3,
    "4th year": 1151.0083333333,
    "Cumulative": 2808.3083333333,
    "Percent": 91.1788419913409,
    "Rank": 213
  },
  {
    "ID": 1330,
    "NAME": "عمر احمد رأفت مشالى",
    "Old_Total": 1692.3,
    "4th year": 1115.6875,
    "Cumulative": 2807.9875,
    "Percent": 91.16842532467533,
    "Rank": 214
  },
  {
    "ID": 365,
    "NAME": "ايرينى حشمت بطرس برنابه",
    "Old_Total": 1632.85,
    "4th year": 1174.4333333333,
    "Cumulative": 2807.2833333333,
    "Percent": 91.1455627705617,
    "Rank": 215
  },
  {
    "ID": 919,
    "NAME": "سلمى محمد أحمد السيد منصور",
    "Old_Total": 1674.15,
    "4th year": 1132.9958333333,
    "Cumulative": 2807.1458333333,
    "Percent": 91.14109848484742,
    "Rank": 216
  },
  {
    "ID": 332,
    "NAME": "انجى مهدي سعد علي الكمنجي",
    "Old_Total": 1650.6,
    "4th year": 1156.0958333333,
    "Cumulative": 2806.6958333333,
    "Percent": 91.12648809523701,
    "Rank": 217
  },
  {
    "ID": 1633,
    "NAME": "محمد السيد عبدالصمد ابراهيم",
    "Old_Total": 1672.65,
    "4th year": 1133.8875,
    "Cumulative": 2806.5375,
    "Percent": 91.12134740259742,
    "Rank": 218
  },
  {
    "ID": 89,
    "NAME": "احمد عبد الناصر عبد السيد شاهين",
    "Old_Total": 1619.65,
    "4th year": 1184.5791666667,
    "Cumulative": 2804.2291666667,
    "Percent": 91.0464015151526,
    "Rank": 219
  },
  {
    "ID": 112,
    "NAME": "احمد ماهر ابراهيم الدسوقى محمد الشحات",
    "Old_Total": 1653.45,
    "4th year": 1150.7,
    "Cumulative": 2804.15,
    "Percent": 91.04383116883116,
    "Rank": 220
  },
  {
    "ID": 1737,
    "NAME": "محمد عفيفي عبدا لمقصود محمد العجمى",
    "Old_Total": 1671.05,
    "4th year": 1132.5291666667,
    "Cumulative": 2803.5791666667,
    "Percent": 91.0252976190487,
    "Rank": 221
  },
  {
    "ID": 859,
    "NAME": "ساره محمد عبدالعزيز السيسى",
    "Old_Total": 1679.6,
    "4th year": 1123.0791666667,
    "Cumulative": 2802.6791666667,
    "Percent": 90.99607683982792,
    "Rank": 222
  },
  {
    "ID": 1331,
    "NAME": "عمر احمد سامي احمد",
    "Old_Total": 1679.8,
    "4th year": 1122.5458333333,
    "Cumulative": 2802.3458333333,
    "Percent": 90.98525432900325,
    "Rank": 223
  },
  {
    "ID": 2088,
    "NAME": "نادين سامح حامد محمد",
    "Old_Total": 1653.7,
    "4th year": 1146.2625,
    "Cumulative": 2799.9625,
    "Percent": 90.90787337662339,
    "Rank": 224
  },
  {
    "ID": 1257,
    "NAME": "عز الدين علاء عطيه زايد",
    "Old_Total": 1640.55,
    "4th year": 1157.9166666667,
    "Cumulative": 2798.4666666667,
    "Percent": 90.85930735930845,
    "Rank": 225
  },
  {
    "ID": 430,
    "NAME": "بسمله سامي ابراهيم حسين",
    "Old_Total": 1665.05,
    "4th year": 1133.225,
    "Cumulative": 2798.275,
    "Percent": 90.8530844155844,
    "Rank": 226
  },
  {
    "ID": 1301,
    "NAME": "على ماهر عطية مرسى السيد",
    "Old_Total": 1658.7,
    "4th year": 1139.5458333333,
    "Cumulative": 2798.2458333333,
    "Percent": 90.85213744588636,
    "Rank": 227
  },
  {
    "ID": 54,
    "NAME": "احمد حسن أحمد محمد على",
    "Old_Total": 1641.15,
    "4th year": 1156.9291666667,
    "Cumulative": 2798.0791666667,
    "Percent": 90.84672619047728,
    "Rank": 228
  },
  {
    "ID": 1371,
    "NAME": "عمر فتحي عبد الحليم بطاح",
    "Old_Total": 1596.35,
    "4th year": 1201.6708333333,
    "Cumulative": 2798.0208333333,
    "Percent": 90.84483225108116,
    "Rank": 229
  },
  {
    "ID": 923,
    "NAME": "سلمى هانى صلاح الدين هانى",
    "Old_Total": 1701,
    "4th year": 1096.3291666667,
    "Cumulative": 2797.3291666667,
    "Percent": 90.82237554112662,
    "Rank": 230
  },
  {
    "ID": 930,
    "NAME": "سما مسعد حسنى ذكى يونس",
    "Old_Total": 1634.1,
    "4th year": 1163.1708333333,
    "Cumulative": 2797.2708333333,
    "Percent": 90.82048160173052,
    "Rank": 231
  },
  {
    "ID": 1012,
    "NAME": "شهد محمد مخلوف احمد",
    "Old_Total": 1648.1,
    "4th year": 1149.0291666667,
    "Cumulative": 2797.1291666667,
    "Percent": 90.8158820346331,
    "Rank": 232
  },
  {
    "ID": 1609,
    "NAME": "محمد احمد عبدالونيس محمد ابوسعديه",
    "Old_Total": 1621.95,
    "4th year": 1174.9541666667,
    "Cumulative": 2796.9041666667,
    "Percent": 90.80857683982792,
    "Rank": 233
  },
  {
    "ID": 791,
    "NAME": "ريهام جمعه مسعود محمد حماد",
    "Old_Total": 1674.35,
    "4th year": 1121.9541666667,
    "Cumulative": 2796.3041666667,
    "Percent": 90.78909632034741,
    "Rank": 234
  },
  {
    "ID": 701,
    "NAME": "رضوان احمد ابراهيم محمد ابو دلال",
    "Old_Total": 1669.45,
    "4th year": 1126.15,
    "Cumulative": 2795.6,
    "Percent": 90.76623376623377,
    "Rank": 235
  },
  {
    "ID": 59,
    "NAME": "احمد خالد محمد مبروك صقر",
    "Old_Total": 1678.7,
    "4th year": 1116.6041666667,
    "Cumulative": 2795.3041666667,
    "Percent": 90.75662878787986,
    "Rank": 236
  },
  {
    "ID": 2274,
    "NAME": "يارا محمد بدوي شرقاوي بدوي",
    "Old_Total": 1644.4,
    "4th year": 1150.8958333333,
    "Cumulative": 2795.2958333333,
    "Percent": 90.75635822510714,
    "Rank": 237
  },
  {
    "ID": 328,
    "NAME": "انجى ابراهيم محمد البنا",
    "Old_Total": 1653.8,
    "4th year": 1139.1333333333,
    "Cumulative": 2792.9333333333,
    "Percent": 90.67965367965259,
    "Rank": 238
  },
  {
    "ID": 1436,
    "NAME": "فاطمه طارق على عبد السلام اسماعيل",
    "Old_Total": 1628.53,
    "4th year": 1163.1208333333,
    "Cumulative": 2791.6508333333,
    "Percent": 90.63801406926298,
    "Rank": 239
  },
  {
    "ID": 1898,
    "NAME": "مريم سراج محمد محمد سراج",
    "Old_Total": 1671.35,
    "4th year": 1119.7833333333,
    "Cumulative": 2791.1333333333,
    "Percent": 90.62121212121103,
    "Rank": 240
  },
  {
    "ID": 2189,
    "NAME": "هاجر السيد عبدالفتاح محمد",
    "Old_Total": 1678.6,
    "4th year": 1112.0083333333,
    "Cumulative": 2790.6083333333,
    "Percent": 90.60416666666559,
    "Rank": 241
  },
  {
    "ID": 67,
    "NAME": "احمد سامح عبد الرحمن حبيب",
    "Old_Total": 1652.9,
    "4th year": 1137.1833333333,
    "Cumulative": 2790.0833333333,
    "Percent": 90.58712121212014,
    "Rank": 242
  },
  {
    "ID": 1855,
    "NAME": "محمود هانى عبد المطلب عبد الله",
    "Old_Total": 1638.2,
    "4th year": 1150.7541666667,
    "Cumulative": 2788.9541666667,
    "Percent": 90.55045995671104,
    "Rank": 243
  },
  {
    "ID": 2012,
    "NAME": "منة الله محمد سالم سالم",
    "Old_Total": 1635.95,
    "4th year": 1152.7625,
    "Cumulative": 2788.7125,
    "Percent": 90.54261363636364,
    "Rank": 244
  },
  {
    "ID": 844,
    "NAME": "ساره احمد مجدى زهران",
    "Old_Total": 1655.35,
    "4th year": 1132.6041666667,
    "Cumulative": 2787.9541666667,
    "Percent": 90.51799242424352,
    "Rank": 245
  },
  {
    "ID": 1817,
    "NAME": "محمد هشام محمد رشدى نافع",
    "Old_Total": 1658.9,
    "4th year": 1128.4958333333,
    "Cumulative": 2787.3958333333,
    "Percent": 90.49986471861364,
    "Rank": 246
  },
  {
    "ID": 39,
    "NAME": "احمد اشرف عطية محمود القزاز",
    "Old_Total": 1702.7,
    "4th year": 1083.5708333333,
    "Cumulative": 2786.2708333333,
    "Percent": 90.46333874458767,
    "Rank": 247
  },
  {
    "ID": 1487,
    "NAME": "كارين حسام ناصف وسيلي",
    "Old_Total": 1653.3,
    "4th year": 1132.9041666667,
    "Cumulative": 2786.2041666667,
    "Percent": 90.46117424242533,
    "Rank": 248
  },
  {
    "ID": 1996,
    "NAME": "منة الله احمد السيد الرومى",
    "Old_Total": 1677.1,
    "4th year": 1109.0333333333,
    "Cumulative": 2786.1333333333,
    "Percent": 90.45887445887337,
    "Rank": 249
  },
  {
    "ID": 608,
    "NAME": "حنين احمد ابراهيم احمد يونس",
    "Old_Total": 1657.65,
    "4th year": 1126.2208333333,
    "Cumulative": 2783.8708333333,
    "Percent": 90.38541666666559,
    "Rank": 250
  },
  {
    "ID": 1052,
    "NAME": "صوفيا امير محمد رزق",
    "Old_Total": 1595.9,
    "4th year": 1187.9125,
    "Cumulative": 2783.8125,
    "Percent": 90.38352272727272,
    "Rank": 251
  },
  {
    "ID": 130,
    "NAME": "احمد محمد زين عبد الحميد قطب",
    "Old_Total": 1672.75,
    "4th year": 1110.1208333333,
    "Cumulative": 2782.8708333333,
    "Percent": 90.35294913419804,
    "Rank": 252
  },
  {
    "ID": 817,
    "NAME": "زياد وليد نبيل السيد علي",
    "Old_Total": 1654.95,
    "4th year": 1126.1625,
    "Cumulative": 2781.1125,
    "Percent": 90.2958603896104,
    "Rank": 253
  },
  {
    "ID": 210,
    "NAME": "اسامه محمد مصطفى محمد",
    "Old_Total": 1632.1,
    "4th year": 1148.225,
    "Cumulative": 2780.325,
    "Percent": 90.2702922077922,
    "Rank": 254
  },
  {
    "ID": 1446,
    "NAME": "فبرونيا رومانى حنا عرابى سليمان",
    "Old_Total": 1651.8,
    "4th year": 1127.9,
    "Cumulative": 2779.7,
    "Percent": 90.25,
    "Rank": 255
  },
  {
    "ID": 573,
    "NAME": "حسن محمود عوض عبدالعزيز يونس",
    "Old_Total": 1622.05,
    "4th year": 1157.4958333333,
    "Cumulative": 2779.5458333333,
    "Percent": 90.2449945887435,
    "Rank": 256
  },
  {
    "ID": 200,
    "NAME": "اسامه عبد الناصر جابر محمد البسيونى",
    "Old_Total": 1654.8,
    "4th year": 1124.6583333333,
    "Cumulative": 2779.4583333333,
    "Percent": 90.2421536796526,
    "Rank": 257
  },
  {
    "ID": 2136,
    "NAME": "نور احمد عبد الرحمن ابراهيم",
    "Old_Total": 1591.8,
    "4th year": 1187.6166666667,
    "Cumulative": 2779.4166666667,
    "Percent": 90.24080086580194,
    "Rank": 258
  },
  {
    "ID": 100,
    "NAME": "احمد عمرو عبد العظيم حبيب",
    "Old_Total": 1594.2,
    "4th year": 1185.05,
    "Cumulative": 2779.25,
    "Percent": 90.23538961038962,
    "Rank": 259
  },
  {
    "ID": 2113,
    "NAME": "ندى محمد صبري محمود عمر",
    "Old_Total": 1685,
    "4th year": 1093.8833333333,
    "Cumulative": 2778.8833333333,
    "Percent": 90.22348484848376,
    "Rank": 260
  },
  {
    "ID": 2191,
    "NAME": "هاجر حازم محمد امين",
    "Old_Total": 1646.85,
    "4th year": 1131.9583333333,
    "Cumulative": 2778.8083333333,
    "Percent": 90.2210497835487,
    "Rank": 261
  },
  {
    "ID": 429,
    "NAME": "بسمله خميس ابراهيم حماد",
    "Old_Total": 1650.2,
    "4th year": 1127.9458333333,
    "Cumulative": 2778.1458333333,
    "Percent": 90.19954004328898,
    "Rank": 262
  },
  {
    "ID": 2326,
    "NAME": "يوسف احمد طاهر عبد الكريم",
    "Old_Total": 1651.4,
    "4th year": 1126.725,
    "Cumulative": 2778.125,
    "Percent": 90.19886363636364,
    "Rank": 263
  },
  {
    "ID": 201,
    "NAME": "اسامه عبدالسلام رمضان إسماعيل سلامه",
    "Old_Total": 1625.2,
    "4th year": 1152.9083333333,
    "Cumulative": 2778.1083333333,
    "Percent": 90.19832251082143,
    "Rank": 264
  },
  {
    "ID": 998,
    "NAME": "شهد صبحي ابراهيم الشونى",
    "Old_Total": 1592.3,
    "4th year": 1185.2,
    "Cumulative": 2777.5,
    "Percent": 90.17857142857143,
    "Rank": 265
  },
  {
    "ID": 2229,
    "NAME": "هناء رضا محمود عبد المقصود السنهورى",
    "Old_Total": 1654.8,
    "4th year": 1122.4583333333,
    "Cumulative": 2777.2583333333,
    "Percent": 90.17072510822402,
    "Rank": 266
  },
  {
    "ID": 425,
    "NAME": "بسمله اسامة سعد على ابو بكر",
    "Old_Total": 1661.55,
    "4th year": 1115.0916666667,
    "Cumulative": 2776.6416666667,
    "Percent": 90.15070346320455,
    "Rank": 267
  },
  {
    "ID": 1367,
    "NAME": "عمر علي عمر سليمان",
    "Old_Total": 1685.2,
    "4th year": 1091.125,
    "Cumulative": 2776.325,
    "Percent": 90.14042207792207,
    "Rank": 268
  },
  {
    "ID": 544,
    "NAME": "حبيبه ابراهيم زكي ابراهيم",
    "Old_Total": 1618.65,
    "4th year": 1157.4,
    "Cumulative": 2776.05,
    "Percent": 90.13149350649351,
    "Rank": 269
  },
  {
    "ID": 2287,
    "NAME": "ياسين عبد الناصر عوض محمد مطاوع",
    "Old_Total": 1614.65,
    "4th year": 1161.1875,
    "Cumulative": 2775.8375,
    "Percent": 90.12459415584416,
    "Rank": 270
  },
  {
    "ID": 2046,
    "NAME": "مؤتمن محمد الشحات حسن",
    "Old_Total": 1646.75,
    "4th year": 1128.9208333333,
    "Cumulative": 2775.6708333333,
    "Percent": 90.11918290043181,
    "Rank": 271
  },
  {
    "ID": 1708,
    "NAME": "محمد عاطف مليجي عبد الله مليجي الكرماني",
    "Old_Total": 1653.2,
    "4th year": 1122.375,
    "Cumulative": 2775.575,
    "Percent": 90.11607142857142,
    "Rank": 272
  },
  {
    "ID": 351,
    "NAME": "اياد احمد ابراهيم النحراوى",
    "Old_Total": 1610.55,
    "4th year": 1164.575,
    "Cumulative": 2775.125,
    "Percent": 90.10146103896103,
    "Rank": 273
  },
  {
    "ID": 1743,
    "NAME": "محمد عماد حامد محمد الرجال",
    "Old_Total": 1641.3,
    "4th year": 1132.0333333333,
    "Cumulative": 2773.3333333333,
    "Percent": 90.04329004328898,
    "Rank": 274
  },
  {
    "ID": 2294,
    "NAME": "يحيي محمد نصر احمد السيد عامر",
    "Old_Total": 1731.6,
    "4th year": 1040.7208333333,
    "Cumulative": 2772.3208333333,
    "Percent": 90.01041666666558,
    "Rank": 275
  },
  {
    "ID": 1605,
    "NAME": "محمد احمد سليم الخواجه",
    "Old_Total": 1639.6,
    "4th year": 1128.0541666667,
    "Cumulative": 2767.6541666667,
    "Percent": 89.8589015151526,
    "Rank": 276
  },
  {
    "ID": 1979,
    "NAME": "ملك محمد محمد عبد النبي",
    "Old_Total": 1616.95,
    "4th year": 1148.7625,
    "Cumulative": 2765.7125,
    "Percent": 89.7958603896104,
    "Rank": 277
  },
  {
    "ID": 1358,
    "NAME": "عمر طارق على صبحى طمان",
    "Old_Total": 1632.55,
    "4th year": 1132.9416666667,
    "Cumulative": 2765.4916666667,
    "Percent": 89.78869047619156,
    "Rank": 278
  },
  {
    "ID": 692,
    "NAME": "رحمه محمد علي توحيد على",
    "Old_Total": 1648.65,
    "4th year": 1116.0416666667,
    "Cumulative": 2764.6916666667,
    "Percent": 89.76271645021754,
    "Rank": 279
  },
  {
    "ID": 1565,
    "NAME": "مارفن ممدوح صبحى عياد رومان",
    "Old_Total": 1652.7,
    "4th year": 1110.9291666667,
    "Cumulative": 2763.6291666667,
    "Percent": 89.7282196969708,
    "Rank": 280
  },
  {
    "ID": 1567,
    "NAME": "مارك هانى راضى عزيز خله",
    "Old_Total": 1617.5,
    "4th year": 1145.325,
    "Cumulative": 2762.825,
    "Percent": 89.70211038961038,
    "Rank": 281
  },
  {
    "ID": 76,
    "NAME": "احمد صابر السيد السعيد إبراهيم",
    "Old_Total": 1640.1,
    "4th year": 1122.3833333333,
    "Cumulative": 2762.4833333333,
    "Percent": 89.69101731601623,
    "Rank": 282
  },
  {
    "ID": 117,
    "NAME": "احمد محمد محمد سعد",
    "Old_Total": 1651.8,
    "4th year": 1110.4125,
    "Cumulative": 2762.2125,
    "Percent": 89.68222402597401,
    "Rank": 283
  },
  {
    "ID": 1715,
    "NAME": "محمد عبد الصمد احمد محمود الشافعي",
    "Old_Total": 1650.7,
    "4th year": 1111.375,
    "Cumulative": 2762.075,
    "Percent": 89.67775974025973,
    "Rank": 284
  },
  {
    "ID": 1643,
    "NAME": "محمد ايمن عبد الجيد الصاوى الجمل",
    "Old_Total": 1652.58,
    "4th year": 1108.6041666667,
    "Cumulative": 2761.1841666667,
    "Percent": 89.64883658008766,
    "Rank": 285
  },
  {
    "ID": 2317,
    "NAME": "يمنى محمد محمد غطاس",
    "Old_Total": 1619.5,
    "4th year": 1141.2541666667,
    "Cumulative": 2760.7541666667,
    "Percent": 89.63487554112663,
    "Rank": 286
  },
  {
    "ID": 538,
    "NAME": "حازم خميس عبدالجواد سيد عطوان",
    "Old_Total": 1654.9,
    "4th year": 1105.1833333333,
    "Cumulative": 2760.0833333333,
    "Percent": 89.61309523809416,
    "Rank": 287
  },
  {
    "ID": 109,
    "NAME": "احمد كارم محمود السيد الجميعى",
    "Old_Total": 1617.4,
    "4th year": 1142.5166666667,
    "Cumulative": 2759.9166666667,
    "Percent": 89.60768398268507,
    "Rank": 288
  },
  {
    "ID": 1186,
    "NAME": "عبد الله اشرف سلامه محمد سلامه",
    "Old_Total": 1609.6,
    "4th year": 1148.45,
    "Cumulative": 2758.05,
    "Percent": 89.54707792207793,
    "Rank": 289
  },
  {
    "ID": 2276,
    "NAME": "ياسمين حامد عبد اللطيف",
    "Old_Total": 1626.7,
    "4th year": 1130.35,
    "Cumulative": 2757.05,
    "Percent": 89.5146103896104,
    "Rank": 290
  },
  {
    "ID": 1118,
    "NAME": "عبد الرحمن عادل محمد عطيان",
    "Old_Total": 1665.05,
    "4th year": 1091.7333333333,
    "Cumulative": 2756.7833333333,
    "Percent": 89.5059523809513,
    "Rank": 291
  },
  {
    "ID": 2165,
    "NAME": "نورا حسن على سعد خرابه",
    "Old_Total": 1620.2,
    "4th year": 1136.4875,
    "Cumulative": 2756.6875,
    "Percent": 89.5028409090909,
    "Rank": 292
  },
  {
    "ID": 2059,
    "NAME": "مى محمد صابر محمد حسن مرزوق",
    "Old_Total": 1658.9,
    "4th year": 1095.5791666667,
    "Cumulative": 2754.4791666667,
    "Percent": 89.43114177489286,
    "Rank": 293
  },
  {
    "ID": 2178,
    "NAME": "نورهان صبري السيد محمد درويش",
    "Old_Total": 1581.8,
    "4th year": 1171.825,
    "Cumulative": 2753.625,
    "Percent": 89.4034090909091,
    "Rank": 294
  },
  {
    "ID": 2206,
    "NAME": "هايدى ايهاب مسعود فخر الدين",
    "Old_Total": 1644.25,
    "4th year": 1109.1291666667,
    "Cumulative": 2753.3791666667,
    "Percent": 89.39542748917859,
    "Rank": 295
  },
  {
    "ID": 2104,
    "NAME": "ندى احمد عبد الصادق ابو طالب",
    "Old_Total": 1625.8,
    "4th year": 1125.0208333333,
    "Cumulative": 2750.8208333333,
    "Percent": 89.31236471861364,
    "Rank": 296
  },
  {
    "ID": 1073,
    "NAME": "عائشة على حامد السيد عطية",
    "Old_Total": 1638.1,
    "4th year": 1110.5166666667,
    "Cumulative": 2748.6166666667,
    "Percent": 89.24080086580194,
    "Rank": 297
  },
  {
    "ID": 1147,
    "NAME": "عبد الرحمن محمد فاروق محمد على",
    "Old_Total": 1666.15,
    "4th year": 1082.3833333333,
    "Cumulative": 2748.5333333333,
    "Percent": 89.23809523809416,
    "Rank": 298
  },
  {
    "ID": 979,
    "NAME": "شريف عادل حلمى عزيز حنا",
    "Old_Total": 1632.2,
    "4th year": 1115.55,
    "Cumulative": 2747.75,
    "Percent": 89.21266233766234,
    "Rank": 299
  },
  {
    "ID": 506,
    "NAME": "جنى احمد سيد هانئ قبطان",
    "Old_Total": 1646.2,
    "4th year": 1101.4958333333,
    "Cumulative": 2747.6958333333,
    "Percent": 89.2109036796526,
    "Rank": 300
  },
  {
    "ID": 1203,
    "NAME": "عبد الله شهاب محمد اسماعيل",
    "Old_Total": 1629.5,
    "4th year": 1117.625,
    "Cumulative": 2747.125,
    "Percent": 89.19237012987013,
    "Rank": 301
  },
  {
    "ID": 667,
    "NAME": "دينا مجدى ابراهيم حسن ابراهيم",
    "Old_Total": 1629.7,
    "4th year": 1117.2416666667,
    "Cumulative": 2746.9416666667,
    "Percent": 89.18641774891884,
    "Rank": 302
  },
  {
    "ID": 1231,
    "NAME": "عبد الله محمود عطيه السعيد",
    "Old_Total": 1600.85,
    "4th year": 1145.0958333333,
    "Cumulative": 2745.9458333333,
    "Percent": 89.15408549783442,
    "Rank": 303
  },
  {
    "ID": 1035,
    "NAME": "صفا حسام عبدالنبي غزي",
    "Old_Total": 1627.3,
    "4th year": 1118.4166666667,
    "Cumulative": 2745.7166666667,
    "Percent": 89.1466450216461,
    "Rank": 304
  },
  {
    "ID": 400,
    "NAME": "ايه محمد عوض محمود شتيه",
    "Old_Total": 1624.5,
    "4th year": 1121.1833333333,
    "Cumulative": 2745.6833333333,
    "Percent": 89.14556277056168,
    "Rank": 305
  },
  {
    "ID": 1394,
    "NAME": "عمرو خالد محمد فريد نعمه الله",
    "Old_Total": 1614.05,
    "4th year": 1131.4208333333,
    "Cumulative": 2745.4708333333,
    "Percent": 89.13866341991235,
    "Rank": 306
  },
  {
    "ID": 897,
    "NAME": "سعاد السيد سليمان يوسف",
    "Old_Total": 1630.3,
    "4th year": 1114.725,
    "Cumulative": 2745.025,
    "Percent": 89.1241883116883,
    "Rank": 307
  },
  {
    "ID": 616,
    "NAME": "حنين هانى محمد زغلول حسن",
    "Old_Total": 1644.85,
    "4th year": 1099.4666666667,
    "Cumulative": 2744.3166666667,
    "Percent": 89.10119047619155,
    "Rank": 308
  },
  {
    "ID": 174,
    "NAME": "احمد وليد ثروت هاشم الاتربى",
    "Old_Total": 1626.8,
    "4th year": 1117.1916666667,
    "Cumulative": 2743.9916666667,
    "Percent": 89.0906385281396,
    "Rank": 309
  },
  {
    "ID": 1733,
    "NAME": "محمد عرفان عبد الجواد محمد احمد",
    "Old_Total": 1617.5,
    "4th year": 1126.2875,
    "Cumulative": 2743.7875,
    "Percent": 89.08400974025975,
    "Rank": 310
  },
  {
    "ID": 759,
    "NAME": "روان ممدوح احمد احمد",
    "Old_Total": 1654.55,
    "4th year": 1088.8291666667,
    "Cumulative": 2743.3791666667,
    "Percent": 89.07075216450325,
    "Rank": 311
  },
  {
    "ID": 1064,
    "NAME": "طه عبد الغنى طه عبدالغني ابو دنيا",
    "Old_Total": 1618.4,
    "4th year": 1124.7041666667,
    "Cumulative": 2743.1041666667,
    "Percent": 89.06182359307468,
    "Rank": 312
  },
  {
    "ID": 1286,
    "NAME": "على حموده محمد السعيد حموده",
    "Old_Total": 1650.85,
    "4th year": 1091.6541666667,
    "Cumulative": 2742.5041666667,
    "Percent": 89.04234307359415,
    "Rank": 313
  },
  {
    "ID": 189,
    "NAME": "اروى ضياء الدين علي الرحماني",
    "Old_Total": 1651.9,
    "4th year": 1090.175,
    "Cumulative": 2742.075,
    "Percent": 89.0284090909091,
    "Rank": 314
  },
  {
    "ID": 1380,
    "NAME": "عمر محمد صفوت وهبان",
    "Old_Total": 1575.6,
    "4th year": 1166.4208333333,
    "Cumulative": 2742.0208333333,
    "Percent": 89.02665043289934,
    "Rank": 315
  },
  {
    "ID": 913,
    "NAME": "سلمى شحات فاروق عبد الرحمن محمد",
    "Old_Total": 1681.35,
    "4th year": 1060.0041666667,
    "Cumulative": 2741.3541666667,
    "Percent": 89.00500541125649,
    "Rank": 316
  },
  {
    "ID": 378,
    "NAME": "ايمان محمد عبد المنعم عبد المجيد خطاب",
    "Old_Total": 1625.95,
    "4th year": 1112.9291666667,
    "Cumulative": 2738.8791666667,
    "Percent": 88.92464826839937,
    "Rank": 317
  },
  {
    "ID": 2017,
    "NAME": "منة الله ياسر العقيلى عبد الحافظ",
    "Old_Total": 1625.45,
    "4th year": 1113.3041666667,
    "Cumulative": 2738.7541666667,
    "Percent": 88.92058982684091,
    "Rank": 318
  },
  {
    "ID": 2099,
    "NAME": "نانسي محيي محمد العشري",
    "Old_Total": 1622.9,
    "4th year": 1115.5458333333,
    "Cumulative": 2738.4458333333,
    "Percent": 88.91057900432793,
    "Rank": 319
  },
  {
    "ID": 1310,
    "NAME": "على محمود محمد احمد الهندى",
    "Old_Total": 1636.1,
    "4th year": 1101.4375,
    "Cumulative": 2737.5375,
    "Percent": 88.88108766233765,
    "Rank": 320
  },
  {
    "ID": 941,
    "NAME": "سميه احمد عبد الكريم عبد الحميد مصطفى",
    "Old_Total": 1617.2,
    "4th year": 1119.6166666667,
    "Cumulative": 2736.8166666667,
    "Percent": 88.85768398268507,
    "Rank": 321
  },
  {
    "ID": 2181,
    "NAME": "نورين ايمن احمد سليمان",
    "Old_Total": 1646.6,
    "4th year": 1088.525,
    "Cumulative": 2735.125,
    "Percent": 88.80275974025975,
    "Rank": 322
  },
  {
    "ID": 994,
    "NAME": "شهد خالد السيد مصطفي الغتمي",
    "Old_Total": 1620.95,
    "4th year": 1114.0541666667,
    "Cumulative": 2735.0041666667,
    "Percent": 88.79883658008767,
    "Rank": 323
  },
  {
    "ID": 851,
    "NAME": "ساره سعيد صبري حافظ هويدي",
    "Old_Total": 1613,
    "4th year": 1121.7416666667,
    "Cumulative": 2734.7416666667,
    "Percent": 88.79031385281493,
    "Rank": 324
  },
  {
    "ID": 1978,
    "NAME": "ملك محمد عبدالفتاح عبدالباري عمر",
    "Old_Total": 1643.45,
    "4th year": 1091.2333333333,
    "Cumulative": 2734.6833333333,
    "Percent": 88.78841991341882,
    "Rank": 325
  },
  {
    "ID": 2160,
    "NAME": "نور نادر حسن محمد حسني",
    "Old_Total": 1602.1,
    "4th year": 1132.2041666667,
    "Cumulative": 2734.3041666667,
    "Percent": 88.77610930736039,
    "Rank": 326
  },
  {
    "ID": 2280,
    "NAME": "ياسمين محمد عبدالقادر محمد سالم",
    "Old_Total": 1604.8,
    "4th year": 1128.8791666667,
    "Cumulative": 2733.6791666667,
    "Percent": 88.75581709956818,
    "Rank": 327
  },
  {
    "ID": 1622,
    "NAME": "محمد اسامه على حسنين على",
    "Old_Total": 1603.85,
    "4th year": 1129.775,
    "Cumulative": 2733.625,
    "Percent": 88.75405844155844,
    "Rank": 328
  },
  {
    "ID": 394,
    "NAME": "ايه اشرف محمد عبدالحميد شرف الدين",
    "Old_Total": 1593.45,
    "4th year": 1139.3333333333,
    "Cumulative": 2732.7833333333,
    "Percent": 88.72673160173052,
    "Rank": 329
  },
  {
    "ID": 1508,
    "NAME": "كنزي عبد العزيز محمد النقيدي",
    "Old_Total": 1614.85,
    "4th year": 1117.6,
    "Cumulative": 2732.45,
    "Percent": 88.71590909090908,
    "Rank": 330
  },
  {
    "ID": 1455,
    "NAME": "فرح شحاته محمد عبد الحافظ ابراهيم",
    "Old_Total": 1618,
    "4th year": 1113.7291666667,
    "Cumulative": 2731.7291666667,
    "Percent": 88.69250541125649,
    "Rank": 331
  },
  {
    "ID": 1987,
    "NAME": "منار شحاتة خميس عبد المعطى سعد",
    "Old_Total": 1585.2,
    "4th year": 1145.6916666667,
    "Cumulative": 2730.8916666667,
    "Percent": 88.66531385281495,
    "Rank": 332
  },
  {
    "ID": 41,
    "NAME": "احمد اشرف محمود محمد",
    "Old_Total": 1601.8,
    "4th year": 1127.7958333333,
    "Cumulative": 2729.5958333333,
    "Percent": 88.62324134199027,
    "Rank": 333
  },
  {
    "ID": 2258,
    "NAME": "وفاء علاء محمد عبد العزيزالبتلتنى",
    "Old_Total": 1618.3,
    "4th year": 1110.4333333333,
    "Cumulative": 2728.7333333333,
    "Percent": 88.59523809523701,
    "Rank": 334
  },
  {
    "ID": 264,
    "NAME": "الاء اشرف عبدالله عبد العاطي سليم",
    "Old_Total": 1571.9,
    "4th year": 1156.775,
    "Cumulative": 2728.675,
    "Percent": 88.59334415584416,
    "Rank": 335
  },
  {
    "ID": 2365,
    "NAME": "يوسف هشام محمد على الملاح",
    "Old_Total": 1634.25,
    "4th year": 1094.3458333333,
    "Cumulative": 2728.5958333333,
    "Percent": 88.59077380952273,
    "Rank": 336
  },
  {
    "ID": 1974,
    "NAME": "ملك عمرو مصطفى الجندى",
    "Old_Total": 1620.4,
    "4th year": 1107.8708333333,
    "Cumulative": 2728.2708333333,
    "Percent": 88.58022186147079,
    "Rank": 337
  },
  {
    "ID": 2114,
    "NAME": "ندى محمد فاروق أمين",
    "Old_Total": 1613.55,
    "4th year": 1113.9958333333,
    "Cumulative": 2727.5458333333,
    "Percent": 88.55668290043181,
    "Rank": 338
  },
  {
    "ID": 1943,
    "NAME": "معاذ احمد سليم يوسف كوزو",
    "Old_Total": 1628.85,
    "4th year": 1097.875,
    "Cumulative": 2726.725,
    "Percent": 88.53003246753246,
    "Rank": 339
  },
  {
    "ID": 2283,
    "NAME": "ياسمينا احمد مجدي الجلاد",
    "Old_Total": 1657.85,
    "4th year": 1068.6875,
    "Cumulative": 2726.5375,
    "Percent": 88.5239448051948,
    "Rank": 340
  },
  {
    "ID": 2349,
    "NAME": "يوسف محمد أحمد غراب",
    "Old_Total": 1617.5,
    "4th year": 1108.2208333333,
    "Cumulative": 2725.7208333333,
    "Percent": 88.49742965367857,
    "Rank": 341
  },
  {
    "ID": 305,
    "NAME": "امنيه اشرف محمد عوض",
    "Old_Total": 1643.5,
    "4th year": 1079.9083333333,
    "Cumulative": 2723.4083333333,
    "Percent": 88.4223484848474,
    "Rank": 342
  },
  {
    "ID": 1279,
    "NAME": "على الدين هشام محمد تمام",
    "Old_Total": 1638.95,
    "4th year": 1083.5541666667,
    "Cumulative": 2722.5041666667,
    "Percent": 88.39299242424352,
    "Rank": 343
  },
  {
    "ID": 751,
    "NAME": "روان رمضان درويش عبدالله رزق",
    "Old_Total": 1597.8,
    "4th year": 1124.3666666667,
    "Cumulative": 2722.1666666667,
    "Percent": 88.3820346320357,
    "Rank": 344
  },
  {
    "ID": 1543,
    "NAME": "ليلى أبوبكر عطيه حتيته",
    "Old_Total": 1632.55,
    "4th year": 1087.3083333333,
    "Cumulative": 2719.8583333333,
    "Percent": 88.30708874458766,
    "Rank": 345
  },
  {
    "ID": 2057,
    "NAME": "مى عماد فتحى راضى",
    "Old_Total": 1583.5,
    "4th year": 1136.3375,
    "Cumulative": 2719.8375,
    "Percent": 88.30641233766234,
    "Rank": 346
  },
  {
    "ID": 2013,
    "NAME": "منة الله محمد على عسل",
    "Old_Total": 1624.6,
    "4th year": 1093.8125,
    "Cumulative": 2718.4125,
    "Percent": 88.26014610389609,
    "Rank": 347
  },
  {
    "ID": 509,
    "NAME": "جنى سمير السيد موسى",
    "Old_Total": 1616,
    "4th year": 1102.175,
    "Cumulative": 2718.175,
    "Percent": 88.25243506493507,
    "Rank": 348
  },
  {
    "ID": 2010,
    "NAME": "منة الله محمد السيد محمد السيد عطيه",
    "Old_Total": 1588.7,
    "4th year": 1129.3625,
    "Cumulative": 2718.0625,
    "Percent": 88.24878246753246,
    "Rank": 349
  },
  {
    "ID": 241,
    "NAME": "اسماء شريف احمد شريف محمد",
    "Old_Total": 1604,
    "4th year": 1113.2666666667,
    "Cumulative": 2717.2666666667,
    "Percent": 88.2229437229448,
    "Rank": 350
  },
  {
    "ID": 483,
    "NAME": "تقى طارق محمد جاب الله",
    "Old_Total": 1622.9,
    "4th year": 1093.6708333333,
    "Cumulative": 2716.5708333333,
    "Percent": 88.20035173160065,
    "Rank": 351
  },
  {
    "ID": 2344,
    "NAME": "يوسف عبد الله محمد سعيد",
    "Old_Total": 1598.7,
    "4th year": 1115.5958333333,
    "Cumulative": 2714.2958333333,
    "Percent": 88.12648809523701,
    "Rank": 352
  },
  {
    "ID": 973,
    "NAME": "شاهيناز منصور بشر منصور",
    "Old_Total": 1605.1,
    "4th year": 1107.7666666667,
    "Cumulative": 2712.8666666667,
    "Percent": 88.08008658008765,
    "Rank": 353
  },
  {
    "ID": 2032,
    "NAME": "مها سليمان احمد حلمى",
    "Old_Total": 1627.7,
    "4th year": 1084.3291666667,
    "Cumulative": 2712.0291666667,
    "Percent": 88.05289502164611,
    "Rank": 354
  },
  {
    "ID": 536,
    "NAME": "حازم احمد محمد الصادق جمعه",
    "Old_Total": 1647.3,
    "4th year": 1064.6125,
    "Cumulative": 2711.9125,
    "Percent": 88.04910714285714,
    "Rank": 355
  },
  {
    "ID": 1652,
    "NAME": "محمد بسيونى سعيد ابراهيم البواب",
    "Old_Total": 1608.9,
    "4th year": 1102.3958333333,
    "Cumulative": 2711.2958333333,
    "Percent": 88.02908549783442,
    "Rank": 356
  },
  {
    "ID": 1933,
    "NAME": "مصطفى محمد عبدالحكيم محمد",
    "Old_Total": 1571.6,
    "4th year": 1139.5958333333,
    "Cumulative": 2711.1958333333,
    "Percent": 88.02583874458766,
    "Rank": 357
  },
  {
    "ID": 2225,
    "NAME": "همسه محمد محمد عاطف قنبر",
    "Old_Total": 1586.1,
    "4th year": 1125.0958333333,
    "Cumulative": 2711.1958333333,
    "Percent": 88.02583874458766,
    "Rank": 357
  },
  {
    "ID": 1493,
    "NAME": "كريم احمد يوسف محمد",
    "Old_Total": 1622.45,
    "4th year": 1088.625,
    "Cumulative": 2711.075,
    "Percent": 88.02191558441558,
    "Rank": 359
  },
  {
    "ID": 861,
    "NAME": "ساره معروف عبدالحليم معروف الراجحى",
    "Old_Total": 1625.1,
    "4th year": 1085.5708333333,
    "Cumulative": 2710.6708333333,
    "Percent": 88.0087932900422,
    "Rank": 360
  },
  {
    "ID": 609,
    "NAME": "حنين اشرف محمد عبد الفتاح",
    "Old_Total": 1603.9,
    "4th year": 1106.2791666667,
    "Cumulative": 2710.1791666667,
    "Percent": 87.99283008658117,
    "Rank": 361
  },
  {
    "ID": 2019,
    "NAME": "منة محمد توفيق البشلاوى",
    "Old_Total": 1640.45,
    "4th year": 1068.8833333333,
    "Cumulative": 2709.3333333333,
    "Percent": 87.9653679653669,
    "Rank": 362
  },
  {
    "ID": 416,
    "NAME": "براء احمد محمد عبد الحميد",
    "Old_Total": 1603,
    "4th year": 1105.0583333333,
    "Cumulative": 2708.0583333333,
    "Percent": 87.92397186147078,
    "Rank": 363
  },
  {
    "ID": 924,
    "NAME": "سلمى وليد محمد محمد احمد عابد",
    "Old_Total": 1604.1,
    "4th year": 1103.8125,
    "Cumulative": 2707.9125,
    "Percent": 87.91923701298701,
    "Rank": 364
  },
  {
    "ID": 1529,
    "NAME": "لورينا بيرو سؤال يوسف خليل",
    "Old_Total": 1576.25,
    "4th year": 1128.2625,
    "Cumulative": 2704.5125,
    "Percent": 87.8088474025974,
    "Rank": 365
  },
  {
    "ID": 1986,
    "NAME": "منار خميس فرج عبدالحليم",
    "Old_Total": 1549.4,
    "4th year": 1152.8458333333,
    "Cumulative": 2702.2458333333,
    "Percent": 87.73525432900325,
    "Rank": 366
  },
  {
    "ID": 776,
    "NAME": "ريم حسام محمد عبدالعزيز عبد المجيد",
    "Old_Total": 1610.3,
    "4th year": 1091.1916666667,
    "Cumulative": 2701.4916666667,
    "Percent": 87.71076839826948,
    "Rank": 367
  },
  {
    "ID": 567,
    "NAME": "حسن صلاح سعد عبده ابو طور",
    "Old_Total": 1541.45,
    "4th year": 1158.1291666667,
    "Cumulative": 2699.5791666667,
    "Percent": 87.64867424242533,
    "Rank": 368
  },
  {
    "ID": 101,
    "NAME": "احمد عيد عبدالمقصود محمد جادالله",
    "Old_Total": 1568.6,
    "4th year": 1130.25,
    "Cumulative": 2698.85,
    "Percent": 87.625,
    "Rank": 369
  },
  {
    "ID": 1859,
    "NAME": "مختار علي مختار عبد العزيز ابو صفيه",
    "Old_Total": 1611.55,
    "4th year": 1086.2583333333,
    "Cumulative": 2697.8083333333,
    "Percent": 87.59117965367857,
    "Rank": 370
  },
  {
    "ID": 1353,
    "NAME": "عمر رضا حسن محمد حسن شرابيه",
    "Old_Total": 1621.45,
    "4th year": 1075.75,
    "Cumulative": 2697.2,
    "Percent": 87.57142857142857,
    "Rank": 371
  },
  {
    "ID": 532,
    "NAME": "جيهان عيد احمد عبد الرازق احمد",
    "Old_Total": 1639.4,
    "4th year": 1057.1125,
    "Cumulative": 2696.5125,
    "Percent": 87.54910714285714,
    "Rank": 372
  },
  {
    "ID": 837,
    "NAME": "زينة تامر ابراهيم القطان",
    "Old_Total": 1591.55,
    "4th year": 1103.975,
    "Cumulative": 2695.525,
    "Percent": 87.51704545454544,
    "Rank": 373
  },
  {
    "ID": 996,
    "NAME": "شهد رضوان احمد كنعان",
    "Old_Total": 1514.6,
    "4th year": 1180.7083333333,
    "Cumulative": 2695.3083333333,
    "Percent": 87.51001082250973,
    "Rank": 374
  },
  {
    "ID": 2049,
    "NAME": "مؤمن محمد رضا ابراهيم",
    "Old_Total": 1608.95,
    "4th year": 1086.2666666667,
    "Cumulative": 2695.2166666667,
    "Percent": 87.50703463203571,
    "Rank": 375
  },
  {
    "ID": 1989,
    "NAME": "منار عبده السيد عبده أبو عوف",
    "Old_Total": 1652.2,
    "4th year": 1042.6916666667,
    "Cumulative": 2694.8916666667,
    "Percent": 87.49648268398377,
    "Rank": 376
  },
  {
    "ID": 595,
    "NAME": "احمد وائل أحمد الدخس (تعديل ترتيب)",
    "Old_Total": 1620.25,
    "4th year": 1073.3583333333,
    "Cumulative": 2693.6083333333,
    "Percent": 87.45481601731493,
    "Rank": 377
  },
  {
    "ID": 2001,
    "NAME": "منة الله رجب شكرى على النشار",
    "Old_Total": 1651.1,
    "4th year": 1042.3041666667,
    "Cumulative": 2693.4041666667,
    "Percent": 87.44818722943832,
    "Rank": 378
  },
  {
    "ID": 1453,
    "NAME": "فرح خالد حسن الدرديري",
    "Old_Total": 1571.2,
    "4th year": 1122.1916666667,
    "Cumulative": 2693.3916666667,
    "Percent": 87.44778138528247,
    "Rank": 379
  },
  {
    "ID": 1574,
    "NAME": "مازن محمد عبد المحسن الحمامى",
    "Old_Total": 1635.15,
    "4th year": 1056.5708333333,
    "Cumulative": 2691.7208333333,
    "Percent": 87.39353354978248,
    "Rank": 380
  },
  {
    "ID": 2000,
    "NAME": "منة الله رافت محمد خليل سالم",
    "Old_Total": 1574.45,
    "4th year": 1117.1875,
    "Cumulative": 2691.6375,
    "Percent": 87.39082792207792,
    "Rank": 381
  },
  {
    "ID": 1892,
    "NAME": "مريم السيد رمضان فرج محمد",
    "Old_Total": 1555.25,
    "4th year": 1135.5708333333,
    "Cumulative": 2690.8208333333,
    "Percent": 87.3643127705617,
    "Rank": 382
  },
  {
    "ID": 1349,
    "NAME": "عمر خالد ابراهيم عوض",
    "Old_Total": 1556.4,
    "4th year": 1134.2375,
    "Cumulative": 2690.6375,
    "Percent": 87.35836038961038,
    "Rank": 383
  },
  {
    "ID": 152,
    "NAME": "احمد محمود عبد الوكيل سالم",
    "Old_Total": 1586.1,
    "4th year": 1104.3458333333,
    "Cumulative": 2690.4458333333,
    "Percent": 87.35213744588637,
    "Rank": 384
  },
  {
    "ID": 1917,
    "NAME": "مريم محمد يوسف عبد الفتاح يوسف",
    "Old_Total": 1622.35,
    "4th year": 1067.8958333333,
    "Cumulative": 2690.2458333333,
    "Percent": 87.34564393939284,
    "Rank": 385
  },
  {
    "ID": 32,
    "NAME": "احمد ابراهيم ابراهيم سيد احمد عيسى",
    "Old_Total": 1626.6,
    "4th year": 1063.3833333333,
    "Cumulative": 2689.9833333333,
    "Percent": 87.33712121212012,
    "Rank": 386
  },
  {
    "ID": 968,
    "NAME": "سيف مصطفى عرفه خاطر",
    "Old_Total": 1630.3,
    "4th year": 1058.575,
    "Cumulative": 2688.875,
    "Percent": 87.30113636363637,
    "Rank": 387
  },
  {
    "ID": 270,
    "NAME": "الاء عاطف عطية عيسى",
    "Old_Total": 1578.2,
    "4th year": 1110.6375,
    "Cumulative": 2688.8375,
    "Percent": 87.29991883116884,
    "Rank": 388
  },
  {
    "ID": 81,
    "NAME": "احمد طارق امين يونس عبيد",
    "Old_Total": 1602.1,
    "4th year": 1085.7,
    "Cumulative": 2687.8,
    "Percent": 87.26623376623377,
    "Rank": 389
  },
  {
    "ID": 1897,
    "NAME": "مريم جورج فؤاد نبيل جورج",
    "Old_Total": 1598.45,
    "4th year": 1088.2708333333,
    "Cumulative": 2686.7208333333,
    "Percent": 87.23119588744481,
    "Rank": 390
  },
  {
    "ID": 1714,
    "NAME": "محمد عبد السلام محمد شعبان بيومى",
    "Old_Total": 1613.95,
    "4th year": 1072.7083333333,
    "Cumulative": 2686.6583333333,
    "Percent": 87.22916666666559,
    "Rank": 391
  },
  {
    "ID": 424,
    "NAME": "بسمله احمد يحى مصطفى محمود",
    "Old_Total": 1618.5,
    "4th year": 1066.875,
    "Cumulative": 2685.375,
    "Percent": 87.1875,
    "Rank": 392
  },
  {
    "ID": 2071,
    "NAME": "ميرال معتز أحمد عبد العزيز زويل",
    "Old_Total": 1554.1,
    "4th year": 1130.6666666667,
    "Cumulative": 2684.7666666667,
    "Percent": 87.16774891775,
    "Rank": 393
  },
  {
    "ID": 1127,
    "NAME": "عبد الرحمن على جمال بدران",
    "Old_Total": 1525.25,
    "4th year": 1159.3166666667,
    "Cumulative": 2684.5666666667,
    "Percent": 87.1612554112565,
    "Rank": 394
  },
  {
    "ID": 2063,
    "NAME": "ميادة رضا احمد عبد الله النجار",
    "Old_Total": 1628.7,
    "4th year": 1054.1958333333,
    "Cumulative": 2682.8958333333,
    "Percent": 87.1070075757565,
    "Rank": 395
  },
  {
    "ID": 1503,
    "NAME": "كريمة شهاب محمد اسماعيل",
    "Old_Total": 1624.6,
    "4th year": 1057.55,
    "Cumulative": 2682.15,
    "Percent": 87.0827922077922,
    "Rank": 396
  },
  {
    "ID": 275,
    "NAME": "الاء فوزى عبد المطلب دياب",
    "Old_Total": 1598.2,
    "4th year": 1083.2708333333,
    "Cumulative": 2681.4708333333,
    "Percent": 87.06074134199027,
    "Rank": 397
  },
  {
    "ID": 550,
    "NAME": "حبيبه خالد محمد عبد الغنى ناجى",
    "Old_Total": 1603.15,
    "4th year": 1077.6041666667,
    "Cumulative": 2680.7541666667,
    "Percent": 87.03747294372404,
    "Rank": 398
  },
  {
    "ID": 2170,
    "NAME": "نوران انور صالح احمد على",
    "Old_Total": 1595.6,
    "4th year": 1084.85,
    "Cumulative": 2680.45,
    "Percent": 87.0275974025974,
    "Rank": 399
  },
  {
    "ID": 2067,
    "NAME": "ميار احمد محمد الشرقاوي",
    "Old_Total": 1597.5,
    "4th year": 1081.4458333333,
    "Cumulative": 2678.9458333333,
    "Percent": 86.97876082250974,
    "Rank": 400
  },
  {
    "ID": 915,
    "NAME": "سلمى عباده على على القاضى",
    "Old_Total": 1565.9,
    "4th year": 1112.2875,
    "Cumulative": 2678.1875,
    "Percent": 86.95413961038962,
    "Rank": 401
  },
  {
    "ID": 233,
    "NAME": "اسماء الشحات حسن على حسن",
    "Old_Total": 1573.75,
    "4th year": 1104.0916666667,
    "Cumulative": 2677.8416666667,
    "Percent": 86.94291125541234,
    "Rank": 402
  },
  {
    "ID": 2156,
    "NAME": "نور محمد احمد جابر الاسكندراني",
    "Old_Total": 1575.9,
    "4th year": 1101.8875,
    "Cumulative": 2677.7875,
    "Percent": 86.9411525974026,
    "Rank": 403
  },
  {
    "ID": 910,
    "NAME": "سلمى احمد محمد السيد",
    "Old_Total": 1590.4,
    "4th year": 1086.9833333333,
    "Cumulative": 2677.3833333333,
    "Percent": 86.92803030302923,
    "Rank": 404
  },
  {
    "ID": 2171,
    "NAME": "نوران ايهاب عبدالمطلب اللقانى",
    "Old_Total": 1606,
    "4th year": 1071.2291666667,
    "Cumulative": 2677.2291666667,
    "Percent": 86.92302489177597,
    "Rank": 405
  },
  {
    "ID": 722,
    "NAME": "رنا محمد خميس خضر",
    "Old_Total": 1601.7,
    "4th year": 1075.1875,
    "Cumulative": 2676.8875,
    "Percent": 86.91193181818181,
    "Rank": 406
  },
  {
    "ID": 435,
    "NAME": "بسمله يسرى السيد ابراهيم يوسف",
    "Old_Total": 1606.8,
    "4th year": 1069.5416666667,
    "Cumulative": 2676.3416666667,
    "Percent": 86.89420995671104,
    "Rank": 407
  },
  {
    "ID": 72,
    "NAME": "احمد سمير السيد علي العيسوي",
    "Old_Total": 1650.5,
    "4th year": 1023.1791666667,
    "Cumulative": 2673.6791666667,
    "Percent": 86.80776515151624,
    "Rank": 408
  },
  {
    "ID": 916,
    "NAME": "سلمى علاء الدين محمد محمد هاشم",
    "Old_Total": 1635.2,
    "4th year": 1037.5958333333,
    "Cumulative": 2672.7958333333,
    "Percent": 86.77908549783442,
    "Rank": 409
  },
  {
    "ID": 1781,
    "NAME": "محمد مرسي ابراهيم نور الدين",
    "Old_Total": 1590.05,
    "4th year": 1082.0083333333,
    "Cumulative": 2672.0583333333,
    "Percent": 86.7551406926396,
    "Rank": 410
  },
  {
    "ID": 1766,
    "NAME": "محمد محمود احمد سيد محى الدين",
    "Old_Total": 1575.2,
    "4th year": 1096.7416666667,
    "Cumulative": 2671.9416666667,
    "Percent": 86.7513528138539,
    "Rank": 411
  },
  {
    "ID": 1011,
    "NAME": "شهد محمد محمد مرشدى خلف",
    "Old_Total": 1531.75,
    "4th year": 1138.525,
    "Cumulative": 2670.275,
    "Percent": 86.69724025974025,
    "Rank": 412
  },
  {
    "ID": 1893,
    "NAME": "مريم ايهاب عبد الرحمن رضا عبد الفتاح",
    "Old_Total": 1566.6,
    "4th year": 1103.3625,
    "Cumulative": 2669.9625,
    "Percent": 86.68709415584415,
    "Rank": 413
  },
  {
    "ID": 513,
    "NAME": "جنى محمد احمد مصطفى يونس",
    "Old_Total": 1564.7,
    "4th year": 1103.9458333333,
    "Cumulative": 2668.6458333333,
    "Percent": 86.64434523809416,
    "Rank": 414
  },
  {
    "ID": 1768,
    "NAME": "محمد محمود امام محمد البابلى",
    "Old_Total": 1632.5,
    "4th year": 1035.575,
    "Cumulative": 2668.075,
    "Percent": 86.62581168831169,
    "Rank": 415
  },
  {
    "ID": 1773,
    "NAME": "محمد محمود محفوظ شلبي",
    "Old_Total": 1553.25,
    "4th year": 1113.15,
    "Cumulative": 2666.4,
    "Percent": 86.57142857142858,
    "Rank": 416
  },
  {
    "ID": 1152,
    "NAME": "عبد الرحمن ولاء بهاء الدين مصطفى خليل",
    "Old_Total": 1535.85,
    "4th year": 1130.2583333333,
    "Cumulative": 2666.1083333333,
    "Percent": 86.56195887445779,
    "Rank": 417
  },
  {
    "ID": 1606,
    "NAME": "محمد احمد سمير مقلد",
    "Old_Total": 1544.1,
    "4th year": 1121.4833333333,
    "Cumulative": 2665.5833333333,
    "Percent": 86.54491341991233,
    "Rank": 418
  },
  {
    "ID": 308,
    "NAME": "امنيه ناصر السعيد عبد الغنى المنسي",
    "Old_Total": 1533.6,
    "4th year": 1131.425,
    "Cumulative": 2665.025,
    "Percent": 86.52678571428571,
    "Rank": 419
  },
  {
    "ID": 1850,
    "NAME": "محمود محمد محمود سالم المالكي",
    "Old_Total": 1618.8,
    "4th year": 1045.7166666667,
    "Cumulative": 2664.5166666667,
    "Percent": 86.51028138528247,
    "Rank": 420
  },
  {
    "ID": 246,
    "NAME": "اسماء ياسر نجيب أبوعجيلة شعبان",
    "Old_Total": 1579.95,
    "4th year": 1084.5041666667,
    "Cumulative": 2664.4541666667,
    "Percent": 86.50825216450325,
    "Rank": 421
  },
  {
    "ID": 85,
    "NAME": "احمد عبد السلام السعيد الصياد",
    "Old_Total": 1616.85,
    "4th year": 1046.9791666667,
    "Cumulative": 2663.8291666667,
    "Percent": 86.48795995671105,
    "Rank": 422
  },
  {
    "ID": 665,
    "NAME": "دينا خميس حسنين محمد حسنين",
    "Old_Total": 1565.05,
    "4th year": 1098.7416666667,
    "Cumulative": 2663.7916666667,
    "Percent": 86.4867424242435,
    "Rank": 423
  },
  {
    "ID": 1908,
    "NAME": "مريم عصام السيد بسيوني",
    "Old_Total": 1559.65,
    "4th year": 1102.9958333333,
    "Cumulative": 2662.6458333333,
    "Percent": 86.44954004328898,
    "Rank": 424
  },
  {
    "ID": 1740,
    "NAME": "محمد علي المعداوى على غازى",
    "Old_Total": 1563.1,
    "4th year": 1098.275,
    "Cumulative": 2661.375,
    "Percent": 86.40827922077922,
    "Rank": 425
  },
  {
    "ID": 415,
    "NAME": "براء طارق يحيى شاكر",
    "Old_Total": 1522.85,
    "4th year": 1138.0458333333,
    "Cumulative": 2660.8958333333,
    "Percent": 86.39272186147078,
    "Rank": 426
  },
  {
    "ID": 1523,
    "NAME": "لجين محمد فؤاد محمد علي خضر",
    "Old_Total": 1540.5,
    "4th year": 1120.1041666667,
    "Cumulative": 2660.6041666667,
    "Percent": 86.38325216450323,
    "Rank": 427
  },
  {
    "ID": 83,
    "NAME": "احمد عبد الباسط سعد عبد اللطيف",
    "Old_Total": 1555.75,
    "4th year": 1104.675,
    "Cumulative": 2660.425,
    "Percent": 86.37743506493507,
    "Rank": 428
  },
  {
    "ID": 753,
    "NAME": "روان علي احمد علي بديوي",
    "Old_Total": 1579.05,
    "4th year": 1081.2625,
    "Cumulative": 2660.3125,
    "Percent": 86.37378246753246,
    "Rank": 429
  },
  {
    "ID": 1651,
    "NAME": "محمد ابراهيم محمد نجا",
    "Old_Total": 1605.38,
    "4th year": 1054.0208333333,
    "Cumulative": 2659.4008333333,
    "Percent": 86.34418290043183,
    "Rank": 430
  },
  {
    "ID": 1998,
    "NAME": "منة الله حسن محمد السيد",
    "Old_Total": 1555.4,
    "4th year": 1102.3291666667,
    "Cumulative": 2657.7291666667,
    "Percent": 86.2899080086591,
    "Rank": 431
  },
  {
    "ID": 327,
    "NAME": "امين محسن عبد الحميد عوض",
    "Old_Total": 1550.1,
    "4th year": 1107.5833333333,
    "Cumulative": 2657.6833333333,
    "Percent": 86.28841991341882,
    "Rank": 432
  },
  {
    "ID": 238,
    "NAME": "اسماء رضا عبدالفتاح ابراهيم ابو طه",
    "Old_Total": 1591.7,
    "4th year": 1065.9291666667,
    "Cumulative": 2657.6291666667,
    "Percent": 86.28666125541234,
    "Rank": 433
  },
  {
    "ID": 1385,
    "NAME": "عمر مصطفى السيد ابراهيم المدخوم",
    "Old_Total": 1526.8,
    "4th year": 1129.5,
    "Cumulative": 2656.3,
    "Percent": 86.24350649350649,
    "Rank": 434
  },
  {
    "ID": 237,
    "NAME": "اسماء رضا سيد احمد",
    "Old_Total": 1601.45,
    "4th year": 1054.1541666667,
    "Cumulative": 2655.6041666667,
    "Percent": 86.22091450216558,
    "Rank": 435
  },
  {
    "ID": 1013,
    "NAME": "شهد مرسى عبدالرحمن مرسى الغرباوى",
    "Old_Total": 1595.7,
    "4th year": 1058.9875,
    "Cumulative": 2654.6875,
    "Percent": 86.19115259740259,
    "Rank": 436
  },
  {
    "ID": 1426,
    "NAME": "فادي محمد محمد حسونه",
    "Old_Total": 1574.35,
    "4th year": 1079.4041666667,
    "Cumulative": 2653.7541666667,
    "Percent": 86.16084956710064,
    "Rank": 437
  },
  {
    "ID": 15,
    "NAME": "ابراهيم محمد حسن عويضه",
    "Old_Total": 1568.1,
    "4th year": 1085.6083333333,
    "Cumulative": 2653.7083333333,
    "Percent": 86.15936147186038,
    "Rank": 438
  },
  {
    "ID": 1272,
    "NAME": "علاء احمد ابراهيم عبده الشنشوري",
    "Old_Total": 1558.55,
    "4th year": 1094.4375,
    "Cumulative": 2652.9875,
    "Percent": 86.13595779220779,
    "Rank": 439
  },
  {
    "ID": 2227,
    "NAME": "هنا محمد عبد الفتاح محمد حسن",
    "Old_Total": 1568.45,
    "4th year": 1084.3166666667,
    "Cumulative": 2652.7666666667,
    "Percent": 86.12878787878896,
    "Rank": 440
  },
  {
    "ID": 2115,
    "NAME": "ندى نادر حمدى محمد علبه",
    "Old_Total": 1593.35,
    "4th year": 1059.0166666667,
    "Cumulative": 2652.3666666667,
    "Percent": 86.11580086580194,
    "Rank": 441
  },
  {
    "ID": 1976,
    "NAME": "ملك محمد صلاح الدين السيد اباظة",
    "Old_Total": 1564,
    "4th year": 1087.8625,
    "Cumulative": 2651.8625,
    "Percent": 86.09943181818183,
    "Rank": 442
  },
  {
    "ID": 1936,
    "NAME": "مصطفى محمد عبداللطيف محمود عشرة",
    "Old_Total": 1631.1,
    "4th year": 1017.6583333333,
    "Cumulative": 2648.7583333333,
    "Percent": 85.9986471861461,
    "Rank": 443
  },
  {
    "ID": 726,
    "NAME": "رنا وسيم عبد الصمد محمود الخرادلى",
    "Old_Total": 1566.45,
    "4th year": 1082.2333333333,
    "Cumulative": 2648.6833333333,
    "Percent": 85.99621212121103,
    "Rank": 444
  },
  {
    "ID": 183,
    "NAME": "ادهم أحمد محمد محمد ماضى",
    "Old_Total": 1583.35,
    "4th year": 1063.6333333333,
    "Cumulative": 2646.9833333333,
    "Percent": 85.94101731601623,
    "Rank": 445
  },
  {
    "ID": 2341,
    "NAME": "يوسف سيد عبد المحسن عمار",
    "Old_Total": 1653.85,
    "4th year": 991.375,
    "Cumulative": 2645.225,
    "Percent": 85.88392857142857,
    "Rank": 446
  },
  {
    "ID": 1853,
    "NAME": "محمود محمد منجد احمد",
    "Old_Total": 1557.8,
    "4th year": 1086.7958333333,
    "Cumulative": 2644.5958333333,
    "Percent": 85.86350108225001,
    "Rank": 447
  },
  {
    "ID": 494,
    "NAME": "جرجس عاطف فليب اسحاق",
    "Old_Total": 1600.55,
    "4th year": 1043.7416666667,
    "Cumulative": 2644.2916666667,
    "Percent": 85.8536255411266,
    "Rank": 448
  },
  {
    "ID": 2271,
    "NAME": "يارا سعيد محمد عطاالله ناجي",
    "Old_Total": 1608.6,
    "4th year": 1034.7083333333,
    "Cumulative": 2643.3083333333,
    "Percent": 85.82169913419804,
    "Rank": 449
  },
  {
    "ID": 2150,
    "NAME": "نور خالد عبدالمعبود ونس",
    "Old_Total": 1519.15,
    "4th year": 1124.0958333333,
    "Cumulative": 2643.2458333333,
    "Percent": 85.81966991341883,
    "Rank": 450
  },
  {
    "ID": 1433,
    "NAME": "فاطمه احمد عبدالحليم عبدالحليم فايد",
    "Old_Total": 1592.35,
    "4th year": 1050.7791666667,
    "Cumulative": 2643.1291666667,
    "Percent": 85.8158820346331,
    "Rank": 451
  },
  {
    "ID": 1889,
    "NAME": "مريم احمد فاروق سليمان",
    "Old_Total": 1585.3,
    "4th year": 1057.6583333333,
    "Cumulative": 2642.9583333333,
    "Percent": 85.81033549783442,
    "Rank": 452
  },
  {
    "ID": 2190,
    "NAME": "هاجر ايهاب محمد الرمادي",
    "Old_Total": 1578.1,
    "4th year": 1063.425,
    "Cumulative": 2641.525,
    "Percent": 85.76379870129868,
    "Rank": 453
  },
  {
    "ID": 1340,
    "NAME": "عمر ايهاب عبد اللطيف شلبي",
    "Old_Total": 1530,
    "4th year": 1111.2208333333,
    "Cumulative": 2641.2208333333,
    "Percent": 85.75392316017208,
    "Rank": 454
  },
  {
    "ID": 1883,
    "NAME": "مروه معاذ شلبي سعد",
    "Old_Total": 1641.85,
    "4th year": 999.17083333333,
    "Cumulative": 2641.02083333333,
    "Percent": 85.74742965367955,
    "Rank": 455
  },
  {
    "ID": 2330,
    "NAME": "يوسف امير محمد حسن",
    "Old_Total": 1586.2,
    "4th year": 1054.6583333333,
    "Cumulative": 2640.8583333333,
    "Percent": 85.7421536796526,
    "Rank": 456
  },
  {
    "ID": 369,
    "NAME": "ايمان اشرف محمد محمد",
    "Old_Total": 1639.9,
    "4th year": 998.20833333333,
    "Cumulative": 2638.10833333333,
    "Percent": 85.65286796536785,
    "Rank": 457
  },
  {
    "ID": 1833,
    "NAME": "محمود تامر محمود محمد",
    "Old_Total": 1587.25,
    "4th year": 1050.6708333333,
    "Cumulative": 2637.9208333333,
    "Percent": 85.64678030302922,
    "Rank": 458
  },
  {
    "ID": 2138,
    "NAME": "نور الدين هشام محمد حموده",
    "Old_Total": 1513.05,
    "4th year": 1124.7125,
    "Cumulative": 2637.7625,
    "Percent": 85.6416396103896,
    "Rank": 459
  },
  {
    "ID": 78,
    "NAME": "احمد صبحي محمد ابراهيم",
    "Old_Total": 1518.75,
    "4th year": 1118.1041666667,
    "Cumulative": 2636.8541666667,
    "Percent": 85.61214826839935,
    "Rank": 460
  },
  {
    "ID": 993,
    "NAME": "شهد حسن عبد الجيد برهام",
    "Old_Total": 1541.2,
    "4th year": 1095.3375,
    "Cumulative": 2636.5375,
    "Percent": 85.6018668831169,
    "Rank": 461
  },
  {
    "ID": 431,
    "NAME": "بسمله على على عبدالحميد محمد فوده",
    "Old_Total": 1540.1,
    "4th year": 1095.0583333333,
    "Cumulative": 2635.1583333333,
    "Percent": 85.55708874458766,
    "Rank": 462
  },
  {
    "ID": 1553,
    "NAME": "لينه حازم اسماعيل على",
    "Old_Total": 1530.05,
    "4th year": 1105.025,
    "Cumulative": 2635.075,
    "Percent": 85.55438311688312,
    "Rank": 463
  },
  {
    "ID": 2205,
    "NAME": "هانيا مجدى اسماعيل احمد محمد",
    "Old_Total": 1546.15,
    "4th year": 1088.2041666667,
    "Cumulative": 2634.3541666667,
    "Percent": 85.53097943723053,
    "Rank": 464
  },
  {
    "ID": 729,
    "NAME": "رنادا عبدالحميد محمد عبدالحميد الخولى",
    "Old_Total": 1498.4,
    "4th year": 1135.8916666667,
    "Cumulative": 2634.2916666667,
    "Percent": 85.5289502164513,
    "Rank": 465
  },
  {
    "ID": 1903,
    "NAME": "مريم طارق محمود المرادني",
    "Old_Total": 1541.25,
    "4th year": 1091.9916666667,
    "Cumulative": 2633.2416666667,
    "Percent": 85.4948593073604,
    "Rank": 466
  },
  {
    "ID": 1116,
    "NAME": "عبد الرحمن طارق امين يونس عبيد",
    "Old_Total": 1582.55,
    "4th year": 1050.3375,
    "Cumulative": 2632.8875,
    "Percent": 85.48336038961038,
    "Rank": 467
  },
  {
    "ID": 1361,
    "NAME": "عمر عبد الحميد سعيد ابراهيم",
    "Old_Total": 1590.05,
    "4th year": 1042.6,
    "Cumulative": 2632.65,
    "Percent": 85.47564935064933,
    "Rank": 468
  },
  {
    "ID": 1396,
    "NAME": "عمرو سليمان طاهر البهنسى",
    "Old_Total": 1502.8,
    "4th year": 1129.7791666667,
    "Cumulative": 2632.5791666667,
    "Percent": 85.47334956710066,
    "Rank": 469
  },
  {
    "ID": 1044,
    "NAME": "صلاح عاطف محمد محمد عاشور",
    "Old_Total": 1628.8,
    "4th year": 1001.0541666667,
    "Cumulative": 2629.8541666667,
    "Percent": 85.38487554112662,
    "Rank": 470
  },
  {
    "ID": 1907,
    "NAME": "مريم عبد المجيد ابراهيم عبد المجيد",
    "Old_Total": 1555.2,
    "4th year": 1074.4583333333,
    "Cumulative": 2629.6583333333,
    "Percent": 85.37851731601623,
    "Rank": 471
  },
  {
    "ID": 277,
    "NAME": "الاء محمد مفضل نصر بشير",
    "Old_Total": 1522.75,
    "4th year": 1105.4625,
    "Cumulative": 2628.2125,
    "Percent": 85.33157467532467,
    "Rank": 472
  },
  {
    "ID": 1006,
    "NAME": "شهد عمرو احمد فتحي محمود يوسف",
    "Old_Total": 1529.5,
    "4th year": 1097.4875,
    "Cumulative": 2626.9875,
    "Percent": 85.29180194805195,
    "Rank": 473
  },
  {
    "ID": 1504,
    "NAME": "كمال عبد الحميد كمال عبد الحميد",
    "Old_Total": 1573.8,
    "4th year": 1051.8541666667,
    "Cumulative": 2625.6541666667,
    "Percent": 85.24851190476298,
    "Rank": 474
  },
  {
    "ID": 1395,
    "NAME": "عمرو خالد محمد محمد غنيم",
    "Old_Total": 1529.3,
    "4th year": 1095.0375,
    "Cumulative": 2624.3375,
    "Percent": 85.20576298701297,
    "Rank": 475
  },
  {
    "ID": 4,
    "NAME": "ابرار عدلى ابراهيم على بيبرس",
    "Old_Total": 1584.4,
    "4th year": 1038.1958333333,
    "Cumulative": 2622.5958333333,
    "Percent": 85.14921536796429,
    "Rank": 476
  },
  {
    "ID": 863,
    "NAME": "ساره ياسر حسن داود خليل",
    "Old_Total": 1533.2,
    "4th year": 1088.1375,
    "Cumulative": 2621.3375,
    "Percent": 85.1083603896104,
    "Rank": 477
  },
  {
    "ID": 235,
    "NAME": "اسماء ايهاب سعد علي عروس",
    "Old_Total": 1540.4,
    "4th year": 1080.5666666667,
    "Cumulative": 2620.9666666667,
    "Percent": 85.09632034632143,
    "Rank": 478
  },
  {
    "ID": 1511,
    "NAME": "كوثر حسين يوسف خليل",
    "Old_Total": 1503.7,
    "4th year": 1117.175,
    "Cumulative": 2620.875,
    "Percent": 85.09334415584415,
    "Rank": 479
  },
  {
    "ID": 1776,
    "NAME": "محمد محمود نصر محمود الديب",
    "Old_Total": 1528.3,
    "4th year": 1092.4,
    "Cumulative": 2620.7,
    "Percent": 85.08766233766232,
    "Rank": 480
  },
  {
    "ID": 807,
    "NAME": "زياد سامح عبد المنعم الضوى",
    "Old_Total": 1524.95,
    "4th year": 1095.5916666667,
    "Cumulative": 2620.5416666667,
    "Percent": 85.08252164502271,
    "Rank": 481
  },
  {
    "ID": 1234,
    "NAME": "عبد الله نصر عباس حمدالله",
    "Old_Total": 1593.15,
    "4th year": 1027.0708333333,
    "Cumulative": 2620.2208333333,
    "Percent": 85.0721049783539,
    "Rank": 482
  },
  {
    "ID": 767,
    "NAME": "رؤى علي حلمي علي شعت",
    "Old_Total": 1544.75,
    "4th year": 1074.7125,
    "Cumulative": 2619.4625,
    "Percent": 85.04748376623377,
    "Rank": 483
  },
  {
    "ID": 1327,
    "NAME": "عمر احمد محمد غنيم سالم",
    "Old_Total": 1507.15,
    "4th year": 1110.8041666667,
    "Cumulative": 2617.9541666667,
    "Percent": 84.99851190476299,
    "Rank": 484
  },
  {
    "ID": 1213,
    "NAME": "عبد الله علاء عبدالله بطور",
    "Old_Total": 1540.7,
    "4th year": 1076.5791666667,
    "Cumulative": 2617.2791666667,
    "Percent": 84.9765963203474,
    "Rank": 485
  },
  {
    "ID": 1891,
    "NAME": "مريم اقلاديوس ملك غبريال",
    "Old_Total": 1587.45,
    "4th year": 1028.0583333333,
    "Cumulative": 2615.5083333333,
    "Percent": 84.91910173160065,
    "Rank": 486
  },
  {
    "ID": 1871,
    "NAME": "مروان اسامة محمد عبداللطيف طلبه",
    "Old_Total": 1573.85,
    "4th year": 1041.6458333333,
    "Cumulative": 2615.4958333333,
    "Percent": 84.9186958874448,
    "Rank": 487
  },
  {
    "ID": 1566,
    "NAME": "مارك نبيل رمسيس نصر عوض",
    "Old_Total": 1548.85,
    "4th year": 1066.6166666667,
    "Cumulative": 2615.4666666667,
    "Percent": 84.91774891774999,
    "Rank": 488
  },
  {
    "ID": 533,
    "NAME": "حاتم احمد على محمد سويدان",
    "Old_Total": 1565.9,
    "4th year": 1048.9833333333,
    "Cumulative": 2614.8833333333,
    "Percent": 84.89880952380844,
    "Rank": 489
  },
  {
    "ID": 1888,
    "NAME": "مريم احمد جلال عكاشه",
    "Old_Total": 1546.2,
    "4th year": 1068.6416666667,
    "Cumulative": 2614.8416666667,
    "Percent": 84.89745670995778,
    "Rank": 490
  },
  {
    "ID": 1804,
    "NAME": "محمد نبيل محمد حسين",
    "Old_Total": 1466.25,
    "4th year": 1148.3791666667,
    "Cumulative": 2614.6291666667,
    "Percent": 84.89055735930845,
    "Rank": 491
  },
  {
    "ID": 1364,
    "NAME": "عمر عبد العظيم عبد العال أحمد",
    "Old_Total": 1543.7,
    "4th year": 1069.3291666667,
    "Cumulative": 2613.0291666667,
    "Percent": 84.83860930736039,
    "Rank": 492
  },
  {
    "ID": 1920,
    "NAME": "مريم ميثم عطيه محمد عطيه العوضى",
    "Old_Total": 1530.75,
    "4th year": 1081.6916666667,
    "Cumulative": 2612.4416666667,
    "Percent": 84.81953463203573,
    "Rank": 493
  },
  {
    "ID": 1008,
    "NAME": "شهد محمد ابراهيم عبد الفتاح بسيوني",
    "Old_Total": 1552.2,
    "4th year": 1060.1541666667,
    "Cumulative": 2612.3541666667,
    "Percent": 84.81669372294479,
    "Rank": 494
  },
  {
    "ID": 309,
    "NAME": "امنيه ياسر احمد عبداللطيف القزاز",
    "Old_Total": 1572.95,
    "4th year": 1038.6875,
    "Cumulative": 2611.6375,
    "Percent": 84.79342532467533,
    "Rank": 495
  },
  {
    "ID": 1785,
    "NAME": "محمد مصطفى محمد عبدالفتاح",
    "Old_Total": 1553.35,
    "4th year": 1057.9791666667,
    "Cumulative": 2611.3291666667,
    "Percent": 84.78341450216558,
    "Rank": 496
  },
  {
    "ID": 2332,
    "NAME": "يوسف انور محمد عبدالهادي",
    "Old_Total": 1534.1,
    "4th year": 1077.1041666667,
    "Cumulative": 2611.2041666667,
    "Percent": 84.77935606060714,
    "Rank": 497
  },
  {
    "ID": 548,
    "NAME": "حبيبه جمال عبدالستار عبد الرحمن عبد الغفار",
    "Old_Total": 1501.7,
    "4th year": 1109.4916666667,
    "Cumulative": 2611.1916666667,
    "Percent": 84.7789502164513,
    "Rank": 498
  },
  {
    "ID": 77,
    "NAME": "احمد صبحى درويش محمد موسى عشيبة",
    "Old_Total": 1511.8,
    "4th year": 1097.6875,
    "Cumulative": 2609.4875,
    "Percent": 84.72362012987014,
    "Rank": 499
  },
  {
    "ID": 2116,
    "NAME": "ندى هشام محمود خيرى عبدالبديع",
    "Old_Total": 1528.9,
    "4th year": 1080.475,
    "Cumulative": 2609.375,
    "Percent": 84.71996753246754,
    "Rank": 500
  },
  {
    "ID": 1676,
    "NAME": "محمد رجب محمد شحاته عبدالخالق",
    "Old_Total": 1537.95,
    "4th year": 1071.3166666667,
    "Cumulative": 2609.2666666667,
    "Percent": 84.7164502164513,
    "Rank": 501
  },
  {
    "ID": 1705,
    "NAME": "محمد عادل عبد الحميد الحصاوي",
    "Old_Total": 1496.08,
    "4th year": 1112.7375,
    "Cumulative": 2608.8175,
    "Percent": 84.70186688311688,
    "Rank": 502
  },
  {
    "ID": 2119,
    "NAME": "نرفانا براء محمد عبدالحافظ",
    "Old_Total": 1535.9,
    "4th year": 1072.5166666667,
    "Cumulative": 2608.4166666667,
    "Percent": 84.6888528138539,
    "Rank": 503
  },
  {
    "ID": 1215,
    "NAME": "عبد الله عمرو فوزي علي",
    "Old_Total": 1535.35,
    "4th year": 1072.8708333333,
    "Cumulative": 2608.2208333333,
    "Percent": 84.68249458874351,
    "Rank": 504
  },
  {
    "ID": 333,
    "NAME": "انجى ناصر احمد محمد حسن حسين",
    "Old_Total": 1522.45,
    "4th year": 1084.6625,
    "Cumulative": 2607.1125,
    "Percent": 84.64650974025975,
    "Rank": 505
  },
  {
    "ID": 2077,
    "NAME": "ميسم رضا يسرى عبدالحميد",
    "Old_Total": 1529.9,
    "4th year": 1076.9625,
    "Cumulative": 2606.8625,
    "Percent": 84.63839285714286,
    "Rank": 506
  },
  {
    "ID": 810,
    "NAME": "زياد علاء الدين رزق حسنين",
    "Old_Total": 1560.1,
    "4th year": 1046.5375,
    "Cumulative": 2606.6375,
    "Percent": 84.63108766233766,
    "Rank": 507
  },
  {
    "ID": 1870,
    "NAME": "مرفت حنفي محمود عبد العظيم",
    "Old_Total": 1556.1,
    "4th year": 1050.1416666667,
    "Cumulative": 2606.2416666667,
    "Percent": 84.61823593073701,
    "Rank": 508
  },
  {
    "ID": 279,
    "NAME": "الاء نبيل محفوظ سلطان",
    "Old_Total": 1531.85,
    "4th year": 1073.7833333333,
    "Cumulative": 2605.6333333333,
    "Percent": 84.59848484848376,
    "Rank": 509
  },
  {
    "ID": 151,
    "NAME": "احمد محمود سعد عبد المجيد شاهين",
    "Old_Total": 1498.7,
    "4th year": 1106.525,
    "Cumulative": 2605.225,
    "Percent": 84.58522727272728,
    "Rank": 510
  },
  {
    "ID": 686,
    "NAME": "رحمه احمد ابو الدهب توفيق",
    "Old_Total": 1535.875,
    "4th year": 1068.4458333333,
    "Cumulative": 2604.3208333333,
    "Percent": 84.55587121212012,
    "Rank": 511
  },
  {
    "ID": 1710,
    "NAME": "محمد عبد الجيد على احمد الوراقى",
    "Old_Total": 1556.45,
    "4th year": 1047.7833333333,
    "Cumulative": 2604.2333333333,
    "Percent": 84.55303030302922,
    "Rank": 512
  },
  {
    "ID": 1000,
    "NAME": "شهد صلاح الدين منير يوسف",
    "Old_Total": 1571.35,
    "4th year": 1032.4541666667,
    "Cumulative": 2603.8041666667,
    "Percent": 84.53909632034741,
    "Rank": 513
  },
  {
    "ID": 952,
    "NAME": "سهيلة سعد عبد العاطى جاب الله",
    "Old_Total": 1517.6,
    "4th year": 1085.9083333333,
    "Cumulative": 2603.5083333333,
    "Percent": 84.52949134199027,
    "Rank": 514
  },
  {
    "ID": 1872,
    "NAME": "مروان بسيونى فوزى بسيونى مرعى",
    "Old_Total": 1543.35,
    "4th year": 1059.0208333333,
    "Cumulative": 2602.3708333333,
    "Percent": 84.49255952380842,
    "Rank": 515
  },
  {
    "ID": 438,
    "NAME": "بسنت عبدالعزيز محمد شاكر الزكي",
    "Old_Total": 1571.5,
    "4th year": 1030.4208333333,
    "Cumulative": 2601.9208333333,
    "Percent": 84.47794913419806,
    "Rank": 516
  },
  {
    "ID": 2122,
    "NAME": "نسرين ناجى ابراهيم محمود عثمان",
    "Old_Total": 1461.35,
    "4th year": 1137.175,
    "Cumulative": 2598.525,
    "Percent": 84.36769480519479,
    "Rank": 517
  },
  {
    "ID": 2152,
    "NAME": "نور ضياء الدين محمد حافظ",
    "Old_Total": 1549.1,
    "4th year": 1048.7208333333,
    "Cumulative": 2597.8208333333,
    "Percent": 84.34483225108117,
    "Rank": 518
  },
  {
    "ID": 2193,
    "NAME": "هاجر عبد الهادى عبد العاطى عبد السلام",
    "Old_Total": 1513.4,
    "4th year": 1082.225,
    "Cumulative": 2595.625,
    "Percent": 84.27353896103897,
    "Rank": 519
  },
  {
    "ID": 2123,
    "NAME": "نسمة وليد علي محمد علي",
    "Old_Total": 1510.8,
    "4th year": 1084.175,
    "Cumulative": 2594.975,
    "Percent": 84.25243506493506,
    "Rank": 520
  },
  {
    "ID": 660,
    "NAME": "دنيا عبد الفتاح ابراهيم عبدالفتاح ناجي",
    "Old_Total": 1537.85,
    "4th year": 1056.3625,
    "Cumulative": 2594.2125,
    "Percent": 84.22767857142856,
    "Rank": 521
  },
  {
    "ID": 448,
    "NAME": "بلال احمد ثروت محمد نصوح كريمه",
    "Old_Total": 1564.8,
    "4th year": 1029.3833333333,
    "Cumulative": 2594.1833333333,
    "Percent": 84.2267316017305,
    "Rank": 522
  },
  {
    "ID": 1914,
    "NAME": "مريم كريم احمد نعيم احمد السيد",
    "Old_Total": 1520.55,
    "4th year": 1073.2833333333,
    "Cumulative": 2593.8333333333,
    "Percent": 84.2153679653669,
    "Rank": 523
  },
  {
    "ID": 875,
    "NAME": "ساندرا عماد منصور فرح",
    "Old_Total": 1498.25,
    "4th year": 1094.9916666667,
    "Cumulative": 2593.2416666667,
    "Percent": 84.1961580086591,
    "Rank": 524
  },
  {
    "ID": 426,
    "NAME": "بسمله اشرف محمد مصطفى",
    "Old_Total": 1602.7,
    "4th year": 990.40833333333,
    "Cumulative": 2593.10833333333,
    "Percent": 84.1918290043289,
    "Rank": 525
  },
  {
    "ID": 2006,
    "NAME": "منة الله على حسنين على السيد",
    "Old_Total": 1480.2,
    "4th year": 1112.3291666667,
    "Cumulative": 2592.5291666667,
    "Percent": 84.17302489177597,
    "Rank": 526
  },
  {
    "ID": 965,
    "NAME": "سيف الدين محمود فهمي عمر",
    "Old_Total": 1540.7,
    "4th year": 1050.2916666667,
    "Cumulative": 2590.9916666667,
    "Percent": 84.12310606060714,
    "Rank": 527
  },
  {
    "ID": 2168,
    "NAME": "نوران ابراهيم عبد الشافى كامل عبد الله",
    "Old_Total": 1574.5,
    "4th year": 1016.2666666667,
    "Cumulative": 2590.7666666667,
    "Percent": 84.11580086580194,
    "Rank": 528
  },
  {
    "ID": 1901,
    "NAME": "مريم صالح عوض احمد الهواري",
    "Old_Total": 1511.35,
    "4th year": 1079.3458333333,
    "Cumulative": 2590.6958333333,
    "Percent": 84.11350108225,
    "Rank": 529
  },
  {
    "ID": 1738,
    "NAME": "محمد علاء يحيى احمد جابر",
    "Old_Total": 1578.8,
    "4th year": 1011.7166666667,
    "Cumulative": 2590.5166666667,
    "Percent": 84.10768398268506,
    "Rank": 530
  },
  {
    "ID": 324,
    "NAME": "اميمة كارم كامل جامع",
    "Old_Total": 1562.05,
    "4th year": 1027.975,
    "Cumulative": 2590.025,
    "Percent": 84.09172077922076,
    "Rank": 531
  },
  {
    "ID": 1007,
    "NAME": "شهد محسن عبدالفتاح فسيخ",
    "Old_Total": 1616.25,
    "4th year": 971.53333333333,
    "Cumulative": 2587.78333333333,
    "Percent": 84.01893939393929,
    "Rank": 532
  },
  {
    "ID": 1143,
    "NAME": "عبد الرحمن محمد رفعت على السيد نصار",
    "Old_Total": 1650.2,
    "4th year": 937.1125,
    "Cumulative": 2587.3125,
    "Percent": 84.0036525974026,
    "Rank": 533
  },
  {
    "ID": 2354,
    "NAME": "يوسف محمد خميس أحمد",
    "Old_Total": 1514.9,
    "4th year": 1072.225,
    "Cumulative": 2587.125,
    "Percent": 83.99756493506494,
    "Rank": 534
  },
  {
    "ID": 802,
    "NAME": "زياد احمد ابراهيم طلحه",
    "Old_Total": 1510,
    "4th year": 1076.4833333333,
    "Cumulative": 2586.4833333333,
    "Percent": 83.97673160173052,
    "Rank": 535
  },
  {
    "ID": 1573,
    "NAME": "مازن عصام عبدالفتاح المليحي",
    "Old_Total": 1520.95,
    "4th year": 1064.225,
    "Cumulative": 2585.175,
    "Percent": 83.93425324675326,
    "Rank": 536
  },
  {
    "ID": 1671,
    "NAME": "محمد حمدى محمد محمد عجوة",
    "Old_Total": 1608.1,
    "4th year": 973.98333333333,
    "Cumulative": 2582.08333333333,
    "Percent": 83.83387445887435,
    "Rank": 537
  },
  {
    "ID": 2157,
    "NAME": "نور محمد السيد مرشد سالم",
    "Old_Total": 1541.7,
    "4th year": 1039.1458333333,
    "Cumulative": 2580.8458333333,
    "Percent": 83.79369588744481,
    "Rank": 538
  },
  {
    "ID": 814,
    "NAME": "زياد محمود عبدالسلام الشناوى",
    "Old_Total": 1489.2,
    "4th year": 1088.6458333333,
    "Cumulative": 2577.8458333333,
    "Percent": 83.6962932900422,
    "Rank": 539
  },
  {
    "ID": 2145,
    "NAME": "نور الله السيد عبد التواب عبد الخالق",
    "Old_Total": 1523.4,
    "4th year": 1052.7166666667,
    "Cumulative": 2576.1166666667,
    "Percent": 83.6401515151526,
    "Rank": 540
  },
  {
    "ID": 58,
    "NAME": "احمد خالد عبدالغنى عبدالجليل",
    "Old_Total": 1470.6,
    "4th year": 1105.4416666667,
    "Cumulative": 2576.0416666667,
    "Percent": 83.63771645021752,
    "Rank": 541
  },
  {
    "ID": 977,
    "NAME": "شروق احمد عبدالعزيز احمد امين",
    "Old_Total": 1523.1,
    "4th year": 1052.8458333333,
    "Cumulative": 2575.9458333333,
    "Percent": 83.6346049783539,
    "Rank": 542
  },
  {
    "ID": 805,
    "NAME": "زياد حسين محمود ابراهيم",
    "Old_Total": 1516.45,
    "4th year": 1058.8291666667,
    "Cumulative": 2575.2791666667,
    "Percent": 83.61295995671102,
    "Rank": 543
  },
  {
    "ID": 793,
    "NAME": "ريهام عبده على سعد درويش",
    "Old_Total": 1541.7,
    "4th year": 1030.7583333333,
    "Cumulative": 2572.4583333333,
    "Percent": 83.52137445887338,
    "Rank": 544
  },
  {
    "ID": 265,
    "NAME": "الاء خالد محمد محجوب",
    "Old_Total": 1551.6,
    "4th year": 1020.8083333333,
    "Cumulative": 2572.4083333333,
    "Percent": 83.51975108225001,
    "Rank": 545
  },
  {
    "ID": 1112,
    "NAME": "عبد الرحمن سعيد سعدالدين محمد",
    "Old_Total": 1576.55,
    "4th year": 993.825,
    "Cumulative": 2570.375,
    "Percent": 83.45373376623377,
    "Rank": 546
  },
  {
    "ID": 2034,
    "NAME": "مهاب أشرف محمد عبدالله بحر",
    "Old_Total": 1469.95,
    "4th year": 1100.0208333333,
    "Cumulative": 2569.9708333333,
    "Percent": 83.4406114718604,
    "Rank": 547
  },
  {
    "ID": 2107,
    "NAME": "ندى شكرى مصطفى محمد ابو المكارم",
    "Old_Total": 1551.9,
    "4th year": 1017.6166666667,
    "Cumulative": 2569.5166666667,
    "Percent": 83.42586580086689,
    "Rank": 548
  },
  {
    "ID": 1091,
    "NAME": "عبد الرحمن احمد حامد عبد الواحد",
    "Old_Total": 1545.95,
    "4th year": 1021.875,
    "Cumulative": 2567.825,
    "Percent": 83.37094155844156,
    "Rank": 549
  },
  {
    "ID": 2253,
    "NAME": "وعد شريف احمد عبداللطيف",
    "Old_Total": 1477.1,
    "4th year": 1090.5166666667,
    "Cumulative": 2567.6166666667,
    "Percent": 83.36417748917857,
    "Rank": 550
  },
  {
    "ID": 2177,
    "NAME": "نورهان دقنوش فؤاد احمد اسماعيل",
    "Old_Total": 1519.75,
    "4th year": 1046.0708333333,
    "Cumulative": 2565.8208333333,
    "Percent": 83.30587121212012,
    "Rank": 551
  },
  {
    "ID": 1019,
    "NAME": "شيماء احمد عبد العاطي أحمد حسين",
    "Old_Total": 1520.75,
    "4th year": 1044.8208333333,
    "Cumulative": 2565.5708333333,
    "Percent": 83.29775432900325,
    "Rank": 552
  },
  {
    "ID": 1919,
    "NAME": "مريم منصور عبد الله شحاته",
    "Old_Total": 1549.65,
    "4th year": 1015.4833333333,
    "Cumulative": 2565.1333333333,
    "Percent": 83.28354978354871,
    "Rank": 553
  },
  {
    "ID": 40,
    "NAME": "احمد اشرف محمد شريف",
    "Old_Total": 1533.1,
    "4th year": 1030.9833333333,
    "Cumulative": 2564.0833333333,
    "Percent": 83.24945887445779,
    "Rank": 554
  },
  {
    "ID": 1647,
    "NAME": "محمد ايمن محمد معوض ذكرى",
    "Old_Total": 1508,
    "4th year": 1055.9541666667,
    "Cumulative": 2563.9541666667,
    "Percent": 83.24526515151624,
    "Rank": 555
  },
  {
    "ID": 35,
    "NAME": "احمد احمد ابراهيم احمد عويضه",
    "Old_Total": 1487.7,
    "4th year": 1076.2375,
    "Cumulative": 2563.9375,
    "Percent": 83.24472402597402,
    "Rank": 556
  },
  {
    "ID": 918,
    "NAME": "سلمى محمد السيد احمد",
    "Old_Total": 1566.55,
    "4th year": 996.20416666667,
    "Cumulative": 2562.75416666667,
    "Percent": 83.20630411255422,
    "Rank": 557
  },
  {
    "ID": 988,
    "NAME": "شهد احمد ابراهيم عفيفي",
    "Old_Total": 1530.55,
    "4th year": 1031.8,
    "Cumulative": 2562.35,
    "Percent": 83.19318181818181,
    "Rank": 558
  },
  {
    "ID": 6,
    "NAME": "ابراهيم احمد جابر سلام",
    "Old_Total": 1511,
    "4th year": 1050.3125,
    "Cumulative": 2561.3125,
    "Percent": 83.15949675324676,
    "Rank": 559
  },
  {
    "ID": 2172,
    "NAME": "نوران علاء الدين على عطيه",
    "Old_Total": 1456.7,
    "4th year": 1102.5916666667,
    "Cumulative": 2559.2916666667,
    "Percent": 83.09388528138636,
    "Rank": 560
  },
  {
    "ID": 1909,
    "NAME": "مريم عصام حامد زغلول",
    "Old_Total": 1549.95,
    "4th year": 1008.8583333333,
    "Cumulative": 2558.8083333333,
    "Percent": 83.07819264069155,
    "Rank": 561
  },
  {
    "ID": 2011,
    "NAME": "منة الله محمد بكر حنفى",
    "Old_Total": 1490.15,
    "4th year": 1068.1125,
    "Cumulative": 2558.2625,
    "Percent": 83.06047077922078,
    "Rank": 562
  },
  {
    "ID": 1296,
    "NAME": "على عمرو محمد صلاح محمد محلاب",
    "Old_Total": 1483.5,
    "4th year": 1072.3041666667,
    "Cumulative": 2555.8041666667,
    "Percent": 82.98065476190585,
    "Rank": 563
  },
  {
    "ID": 1720,
    "NAME": "محمد عبد الفضيل عبدربه جادالمولى",
    "Old_Total": 1595.55,
    "4th year": 959.97083333333,
    "Cumulative": 2555.52083333333,
    "Percent": 82.97145562770551,
    "Rank": 564
  },
  {
    "ID": 148,
    "NAME": "احمد محمود احمد محمود عناني",
    "Old_Total": 1491.45,
    "4th year": 1062.1375,
    "Cumulative": 2553.5875,
    "Percent": 82.90868506493507,
    "Rank": 565
  },
  {
    "ID": 1187,
    "NAME": "عبد الله اشرف مسعود خليفة",
    "Old_Total": 1517,
    "4th year": 1036.1708333333,
    "Cumulative": 2553.1708333333,
    "Percent": 82.89515692640585,
    "Rank": 566
  },
  {
    "ID": 1040,
    "NAME": "صفيه سعفان أحمد نعمة الله",
    "Old_Total": 1528.3,
    "4th year": 1022.7791666667,
    "Cumulative": 2551.0791666667,
    "Percent": 82.82724567099675,
    "Rank": 567
  },
  {
    "ID": 496,
    "NAME": "جمال محمد جمال احمد ابراهيم",
    "Old_Total": 1471.95,
    "4th year": 1078.6208333333,
    "Cumulative": 2550.5708333333,
    "Percent": 82.81074134199025,
    "Rank": 568
  },
  {
    "ID": 2007,
    "NAME": "منة الله على رضوان قاسم مصطفى",
    "Old_Total": 1473.05,
    "4th year": 1076.8708333333,
    "Cumulative": 2549.9208333333,
    "Percent": 82.78963744588637,
    "Rank": 569
  },
  {
    "ID": 1442,
    "NAME": "فاطمه محمد احمد احمد نوح",
    "Old_Total": 1483.83,
    "4th year": 1065.0125,
    "Cumulative": 2548.8425,
    "Percent": 82.75462662337661,
    "Rank": 570
  },
  {
    "ID": 1063,
    "NAME": "طه ايهاب عصمت شحاتة",
    "Old_Total": 1459.85,
    "4th year": 1088.4333333333,
    "Cumulative": 2548.2833333333,
    "Percent": 82.73647186147079,
    "Rank": 571
  },
  {
    "ID": 1498,
    "NAME": "كريم رمضان جمعة علي صقر",
    "Old_Total": 1511.75,
    "4th year": 1035.4833333333,
    "Cumulative": 2547.2333333333,
    "Percent": 82.70238095237987,
    "Rank": 572
  },
  {
    "ID": 1947,
    "NAME": "معاذ منير محمد مصطفى مصطفى ضبش",
    "Old_Total": 1499.15,
    "4th year": 1047.1416666667,
    "Cumulative": 2546.2916666667,
    "Percent": 82.67180735930845,
    "Rank": 573
  },
  {
    "ID": 1422,
    "NAME": "فاتن كمال سعد السيد",
    "Old_Total": 1488.3,
    "4th year": 1057.5458333333,
    "Cumulative": 2545.8458333333,
    "Percent": 82.65733225108117,
    "Rank": 574
  },
  {
    "ID": 757,
    "NAME": "روان محمود علي ابراهيم",
    "Old_Total": 1526.05,
    "4th year": 1019.4833333333,
    "Cumulative": 2545.5333333333,
    "Percent": 82.64718614718507,
    "Rank": 575
  },
  {
    "ID": 459,
    "NAME": "بيشوى عبدالله ونيس عطيه عبد الله",
    "Old_Total": 1504.3,
    "4th year": 1041.0791666667,
    "Cumulative": 2545.3791666667,
    "Percent": 82.64218073593183,
    "Rank": 576
  },
  {
    "ID": 804,
    "NAME": "زياد جمال محمد شلبي",
    "Old_Total": 1439.6,
    "4th year": 1105.7375,
    "Cumulative": 2545.3375,
    "Percent": 82.6408279220779,
    "Rank": 577
  },
  {
    "ID": 756,
    "NAME": "روان محمد عبد السلام المرشدى",
    "Old_Total": 1492.6,
    "4th year": 1052.2958333333,
    "Cumulative": 2544.8958333333,
    "Percent": 82.62648809523701,
    "Rank": 578
  },
  {
    "ID": 1220,
    "NAME": "عبد الله لطفي نايف عبد الجيد عبد المولي",
    "Old_Total": 1489.55,
    "4th year": 1055.3,
    "Cumulative": 2544.85,
    "Percent": 82.625,
    "Rank": 579
  },
  {
    "ID": 1878,
    "NAME": "مروان محمد محمد علام ريان",
    "Old_Total": 1459.75,
    "4th year": 1084.9166666667,
    "Cumulative": 2544.6666666667,
    "Percent": 82.61904761904869,
    "Rank": 580
  },
  {
    "ID": 493,
    "NAME": "جاك سمير مارس دميان",
    "Old_Total": 1474.45,
    "4th year": 1067.375,
    "Cumulative": 2541.825,
    "Percent": 82.52678571428571,
    "Rank": 581
  },
  {
    "ID": 990,
    "NAME": "شهد احمد عبدالقادر السيد ركيبة",
    "Old_Total": 1457.55,
    "4th year": 1083.7833333333,
    "Cumulative": 2541.3333333333,
    "Percent": 82.51082251082144,
    "Rank": 582
  },
  {
    "ID": 906,
    "NAME": "سلسبيل متولي عبد الحميد احمد",
    "Old_Total": 1502.25,
    "4th year": 1038.95,
    "Cumulative": 2541.2,
    "Percent": 82.50649350649351,
    "Rank": 583
  },
  {
    "ID": 2603,
    "NAME": "الاء احمد عبد اللطيف احمد العكريش",
    "Old_Total": 1455.2,
    "4th year": 1084.7166666667,
    "Cumulative": 2539.9166666667,
    "Percent": 82.46482683982791,
    "Rank": 584
  },
  {
    "ID": 1911,
    "NAME": "مريم فهمى السيد السيد بلال",
    "Old_Total": 1499.15,
    "4th year": 1040.2875,
    "Cumulative": 2539.4375,
    "Percent": 82.44926948051948,
    "Rank": 585
  },
  {
    "ID": 146,
    "NAME": "احمد محمد مهدى عبدالحميد عشيبة",
    "Old_Total": 1508.5,
    "4th year": 1029.975,
    "Cumulative": 2538.475,
    "Percent": 82.41801948051948,
    "Rank": 586
  },
  {
    "ID": 387,
    "NAME": "ايمن نصرالدين شوقي محمد ابراهيم",
    "Old_Total": 1656.6,
    "4th year": 881.40416666667,
    "Cumulative": 2538.00416666667,
    "Percent": 82.40273268398278,
    "Rank": 587
  },
  {
    "ID": 1486,
    "NAME": "كارولين فريج غطاس فرج",
    "Old_Total": 1547.1,
    "4th year": 990.2375,
    "Cumulative": 2537.3375,
    "Percent": 82.38108766233765,
    "Rank": 588
  },
  {
    "ID": 2009,
    "NAME": "منة الله محمد احمد فؤاد عبدالحي",
    "Old_Total": 1575.45,
    "4th year": 961.0875,
    "Cumulative": 2536.5375,
    "Percent": 82.35511363636363,
    "Rank": 589
  },
  {
    "ID": 476,
    "NAME": "تسنيم محمود حسن علي أبو شاهين",
    "Old_Total": 1536.3,
    "4th year": 999.875,
    "Cumulative": 2536.175,
    "Percent": 82.34334415584416,
    "Rank": 590
  },
  {
    "ID": 1399,
    "NAME": "عمرو عبدالهادى سعيد السقيلى",
    "Old_Total": 1491.45,
    "4th year": 1043.4708333333,
    "Cumulative": 2534.9208333333,
    "Percent": 82.30262445887337,
    "Rank": 591
  },
  {
    "ID": 2060,
    "NAME": "مى محمد كمال توفيق النجار",
    "Old_Total": 1467.9,
    "4th year": 1066.4791666667,
    "Cumulative": 2534.3791666667,
    "Percent": 82.28503787878897,
    "Rank": 592
  },
  {
    "ID": 2180,
    "NAME": "نورهان هاشم السيد درويش",
    "Old_Total": 1450.65,
    "4th year": 1083.4416666667,
    "Cumulative": 2534.0916666667,
    "Percent": 82.27570346320454,
    "Rank": 593
  },
  {
    "ID": 95,
    "NAME": "احمد علاء كامل محمد علي جنيدي",
    "Old_Total": 1447.8,
    "4th year": 1085.55,
    "Cumulative": 2533.35,
    "Percent": 82.25162337662337,
    "Rank": 594
  },
  {
    "ID": 50,
    "NAME": "احمد جميل عبد الحليم فرج محمد",
    "Old_Total": 1556.2,
    "4th year": 976.52083333333,
    "Cumulative": 2532.72083333333,
    "Percent": 82.23119588744578,
    "Rank": 595
  },
  {
    "ID": 384,
    "NAME": "ايمن عصام فهمى علي الصابر",
    "Old_Total": 1499.05,
    "4th year": 1032.225,
    "Cumulative": 2531.275,
    "Percent": 82.18425324675323,
    "Rank": 596
  },
  {
    "ID": 763,
    "NAME": "روفانا ثروت عبد الحميد الشاذلي",
    "Old_Total": 1518.95,
    "4th year": 1010.4291666667,
    "Cumulative": 2529.3791666667,
    "Percent": 82.1227002164513,
    "Rank": 597
  },
  {
    "ID": 1899,
    "NAME": "مريم سعد ابراهيم ابو السعيد",
    "Old_Total": 1522.9,
    "4th year": 1005.2166666667,
    "Cumulative": 2528.1166666667,
    "Percent": 82.08170995671104,
    "Rank": 598
  },
  {
    "ID": 1969,
    "NAME": "ملك احمد منصور عزيز",
    "Old_Total": 1470.8,
    "4th year": 1056.7,
    "Cumulative": 2527.5,
    "Percent": 82.06168831168831,
    "Rank": 599
  },
  {
    "ID": 1387,
    "NAME": "عمر مصطفى دسوقي نوفل",
    "Old_Total": 1434.7,
    "4th year": 1091.9416666667,
    "Cumulative": 2526.6416666667,
    "Percent": 82.03382034632143,
    "Rank": 600
  },
  {
    "ID": 677,
    "NAME": "رانيا محمود محمد احمد الجيزاوي",
    "Old_Total": 1551.65,
    "4th year": 973.3875,
    "Cumulative": 2525.0375,
    "Percent": 81.98173701298703,
    "Rank": 601
  },
  {
    "ID": 2320,
    "NAME": "يوسف ابراهيم عبده ابراهيم عوده",
    "Old_Total": 1492.4,
    "4th year": 1032.4708333333,
    "Cumulative": 2524.8708333333,
    "Percent": 81.97632575757468,
    "Rank": 602
  },
  {
    "ID": 42,
    "NAME": "احمد السعيد عطيه المليجى",
    "Old_Total": 1507.6,
    "4th year": 1016.5958333333,
    "Cumulative": 2524.1958333333,
    "Percent": 81.95441017315909,
    "Rank": 603
  },
  {
    "ID": 437,
    "NAME": "بسنت سامى عبداللطيف عبدالله مخلوف",
    "Old_Total": 1496.4,
    "4th year": 1026.6958333333,
    "Cumulative": 2523.0958333333,
    "Percent": 81.9186958874448,
    "Rank": 604
  },
  {
    "ID": 1592,
    "NAME": "محمد ابراهيم مصطفى الفرارجى",
    "Old_Total": 1444.15,
    "4th year": 1077.6625,
    "Cumulative": 2521.8125,
    "Percent": 81.87702922077922,
    "Rank": 605
  },
  {
    "ID": 1684,
    "NAME": "محمد سعد ابراهيم الشناوى",
    "Old_Total": 1567.7,
    "4th year": 953.60833333333,
    "Cumulative": 2521.30833333333,
    "Percent": 81.86066017316007,
    "Rank": 606
  },
  {
    "ID": 1510,
    "NAME": "كنزي محمد حسين فرحات حسان",
    "Old_Total": 1520.85,
    "4th year": 999.7875,
    "Cumulative": 2520.6375,
    "Percent": 81.83887987012987,
    "Rank": 607
  },
  {
    "ID": 380,
    "NAME": "ايمان وليد محمد بكر محمود",
    "Old_Total": 1457.7,
    "4th year": 1062.5083333333,
    "Cumulative": 2520.2083333333,
    "Percent": 81.82494588744481,
    "Rank": 608
  },
  {
    "ID": 662,
    "NAME": "دنيا عصام حسين الوردانى",
    "Old_Total": 1509.65,
    "4th year": 1009.3166666667,
    "Cumulative": 2518.9666666667,
    "Percent": 81.7846320346331,
    "Rank": 609
  },
  {
    "ID": 1906,
    "NAME": "مريم عبد القادر محمد خليل عبد القادر",
    "Old_Total": 1403.4,
    "4th year": 1112.8083333333,
    "Cumulative": 2516.2083333333,
    "Percent": 81.69507575757468,
    "Rank": 610
  },
  {
    "ID": 1591,
    "NAME": "محمد ابراهيم عبده عبدالعاطي",
    "Old_Total": 1453.15,
    "4th year": 1062.0708333333,
    "Cumulative": 2515.2208333333,
    "Percent": 81.663014069263,
    "Rank": 611
  },
  {
    "ID": 255,
    "NAME": "اسيل حامد عطيه عبد ربه",
    "Old_Total": 1506.75,
    "4th year": 1008.375,
    "Cumulative": 2515.125,
    "Percent": 81.6599025974026,
    "Rank": 612
  },
  {
    "ID": 2284,
    "NAME": "ياسمينا السيد أحمد عياد",
    "Old_Total": 1481.65,
    "4th year": 1031.9041666667,
    "Cumulative": 2513.5541666667,
    "Percent": 81.6089015151526,
    "Rank": 613
  },
  {
    "ID": 1918,
    "NAME": "مريم مصطفي محمد عطيان",
    "Old_Total": 1466.1,
    "4th year": 1046.325,
    "Cumulative": 2512.425,
    "Percent": 81.57224025974027,
    "Rank": 614
  },
  {
    "ID": 1439,
    "NAME": "فاطمه عبده احمد حسن على",
    "Old_Total": 1584.98,
    "4th year": 925.97083333333,
    "Cumulative": 2510.95083333333,
    "Percent": 81.5243777056276,
    "Rank": 615
  },
  {
    "ID": 133,
    "NAME": "احمد محمد عبدالحميد احمد",
    "Old_Total": 1398.7,
    "4th year": 1111.7583333333,
    "Cumulative": 2510.4583333333,
    "Percent": 81.50838744588637,
    "Rank": 616
  },
  {
    "ID": 1836,
    "NAME": "محمود رمضان ترحى سيف النصر",
    "Old_Total": 1536.3,
    "4th year": 973.6,
    "Cumulative": 2509.9,
    "Percent": 81.49025974025975,
    "Rank": 617
  },
  {
    "ID": 2342,
    "NAME": "يوسف شعبان عبدالمعطى حسن",
    "Old_Total": 1492.9,
    "4th year": 1016.35,
    "Cumulative": 2509.25,
    "Percent": 81.46915584415585,
    "Rank": 618
  },
  {
    "ID": 221,
    "NAME": "اسراء ناجى عبد الكريم سكران",
    "Old_Total": 1509.55,
    "4th year": 999.64583333333,
    "Cumulative": 2509.19583333333,
    "Percent": 81.46739718614708,
    "Rank": 619
  },
  {
    "ID": 1488,
    "NAME": "كامل عبد الفتاح عبد الله كامل عقدة",
    "Old_Total": 1492.7,
    "4th year": 1016,
    "Cumulative": 2508.7,
    "Percent": 81.4512987012987,
    "Rank": 620
  },
  {
    "ID": 2207,
    "NAME": "هبه ابراهيم سعد عبدالحليم عبدالغني",
    "Old_Total": 1500.9,
    "4th year": 1006.4541666667,
    "Cumulative": 2507.3541666667,
    "Percent": 81.4076028138539,
    "Rank": 621
  },
  {
    "ID": 1900,
    "NAME": "مريم سمير علي البرلسي",
    "Old_Total": 1567.7,
    "4th year": 939.27916666667,
    "Cumulative": 2506.97916666667,
    "Percent": 81.3954274891776,
    "Rank": 622
  },
  {
    "ID": 1100,
    "NAME": "عبد الرحمن اشرف رمزى سعد محمد",
    "Old_Total": 1436.9,
    "4th year": 1069.1583333333,
    "Cumulative": 2506.0583333333,
    "Percent": 81.36553030302923,
    "Rank": 623
  },
  {
    "ID": 649,
    "NAME": "دارين خالد سعد عبد المجيد عطية",
    "Old_Total": 1478.15,
    "4th year": 1027.3708333333,
    "Cumulative": 2505.5208333333,
    "Percent": 81.34807900432793,
    "Rank": 624
  },
  {
    "ID": 1973,
    "NAME": "ملك عمرو محمد اسماعيل",
    "Old_Total": 1464.25,
    "4th year": 1041.1416666667,
    "Cumulative": 2505.3916666667,
    "Percent": 81.34388528138636,
    "Rank": 625
  },
  {
    "ID": 2335,
    "NAME": "يوسف خالد فاروق ابوالنجا",
    "Old_Total": 1449.6,
    "4th year": 1054.4833333333,
    "Cumulative": 2504.0833333333,
    "Percent": 81.30140692640583,
    "Rank": 626
  },
  {
    "ID": 1628,
    "NAME": "محمد اشرف سعد محمد ابو سالم",
    "Old_Total": 1468.3,
    "4th year": 1034.3,
    "Cumulative": 2502.6,
    "Percent": 81.25324675324676,
    "Rank": 627
  },
  {
    "ID": 168,
    "NAME": "احمد هانى رافت محمود عيسى",
    "Old_Total": 1582.55,
    "4th year": 919.90416666667,
    "Cumulative": 2502.45416666667,
    "Percent": 81.24851190476201,
    "Rank": 628
  },
  {
    "ID": 519,
    "NAME": "جودي احمد مصطفى عفان",
    "Old_Total": 1494.75,
    "4th year": 1007.5083333333,
    "Cumulative": 2502.2583333333,
    "Percent": 81.2421536796526,
    "Rank": 629
  },
  {
    "ID": 182,
    "NAME": "ادم احمد زكريا محمد عبدالحميد محفوظ",
    "Old_Total": 1475.75,
    "4th year": 1026.0541666667,
    "Cumulative": 2501.8041666667,
    "Percent": 81.22740800865908,
    "Rank": 630
  },
  {
    "ID": 1794,
    "NAME": "محمد مهنا عياد عبد الله طلب",
    "Old_Total": 1462.65,
    "4th year": 1038.85,
    "Cumulative": 2501.5,
    "Percent": 81.21753246753246,
    "Rank": 631
  },
  {
    "ID": 528,
    "NAME": "جون نبيل شكر الله توماس",
    "Old_Total": 1507.8,
    "4th year": 993.0125,
    "Cumulative": 2500.8125,
    "Percent": 81.19521103896103,
    "Rank": 632
  },
  {
    "ID": 1614,
    "NAME": "محمد احمد محمد عبدالمنعم",
    "Old_Total": 1495.35,
    "4th year": 1005.0375,
    "Cumulative": 2500.3875,
    "Percent": 81.18141233766232,
    "Rank": 633
  },
  {
    "ID": 389,
    "NAME": "اينور اسامه عطيه عبده",
    "Old_Total": 1477.75,
    "4th year": 1022.5166666667,
    "Cumulative": 2500.2666666667,
    "Percent": 81.17748917749026,
    "Rank": 634
  },
  {
    "ID": 803,
    "NAME": "زياد ايهاب محمود ابراهيم",
    "Old_Total": 1430.45,
    "4th year": 1069.6416666667,
    "Cumulative": 2500.0916666667,
    "Percent": 81.17180735930843,
    "Rank": 635
  },
  {
    "ID": 330,
    "NAME": "انجى جمال رمضان عبد الحليم عبد الرحمن",
    "Old_Total": 1445.8,
    "4th year": 1048.9958333333,
    "Cumulative": 2494.7958333333,
    "Percent": 80.99986471861364,
    "Rank": 636
  },
  {
    "ID": 1445,
    "NAME": "فايزه محمد عبدالحفيظ سيد أحمد طبليه",
    "Old_Total": 1556.05,
    "4th year": 938.1875,
    "Cumulative": 2494.2375,
    "Percent": 80.98173701298703,
    "Rank": 637
  },
  {
    "ID": 893,
    "NAME": "سراج الدين إسلام حسن السيد سليمان حجازي",
    "Old_Total": 1490.4,
    "4th year": 1002.5916666667,
    "Cumulative": 2492.9916666667,
    "Percent": 80.94128787878896,
    "Rank": 638
  },
  {
    "ID": 1813,
    "NAME": "محمد هانى على عبدالوهاب بدر",
    "Old_Total": 1506.9,
    "4th year": 985.63333333333,
    "Cumulative": 2492.53333333333,
    "Percent": 80.92640692640683,
    "Rank": 639
  },
  {
    "ID": 1864,
    "NAME": "مرام محمد علام ابراهيم",
    "Old_Total": 1416.75,
    "4th year": 1075.475,
    "Cumulative": 2492.225,
    "Percent": 80.9163961038961,
    "Rank": 640
  },
  {
    "ID": 982,
    "NAME": "شمس سالم محمد زوره",
    "Old_Total": 1454.4,
    "4th year": 1035.825,
    "Cumulative": 2490.225,
    "Percent": 80.85146103896105,
    "Rank": 641
  },
  {
    "ID": 1131,
    "NAME": "عبد الرحمن عماد عبدالاله خضر",
    "Old_Total": 1484.6,
    "4th year": 1004.4875,
    "Cumulative": 2489.0875,
    "Percent": 80.8145292207792,
    "Rank": 642
  },
  {
    "ID": 176,
    "NAME": "احمد وليد محمد بكر محمود",
    "Old_Total": 1417.35,
    "4th year": 1070.7291666667,
    "Cumulative": 2488.0791666667,
    "Percent": 80.78179112554221,
    "Rank": 643
  },
  {
    "ID": 377,
    "NAME": "ايمان محمد ابراهيم صبري أمين",
    "Old_Total": 1449.7,
    "4th year": 1037.3083333333,
    "Cumulative": 2487.0083333333,
    "Percent": 80.74702380952273,
    "Rank": 644
  },
  {
    "ID": 1937,
    "NAME": "مصطفى محمد فتحي زرد",
    "Old_Total": 1461.15,
    "4th year": 1021.9625,
    "Cumulative": 2483.1125,
    "Percent": 80.62053571428572,
    "Rank": 645
  },
  {
    "ID": 1154,
    "NAME": "عبد الرحيم مهدى محمد أبوعيشة",
    "Old_Total": 1497.15,
    "4th year": 983.60416666667,
    "Cumulative": 2480.75416666667,
    "Percent": 80.54396645021656,
    "Rank": 646
  },
  {
    "ID": 1927,
    "NAME": "مصطفى اشرف مصطفى علي العشري",
    "Old_Total": 1445.95,
    "4th year": 1033.7208333333,
    "Cumulative": 2479.6708333333,
    "Percent": 80.5087932900422,
    "Rank": 647
  },
  {
    "ID": 1393,
    "NAME": "عمرو خالد عبد الجواد عبدالرحيم السيد",
    "Old_Total": 1430.55,
    "4th year": 1048.9208333333,
    "Cumulative": 2479.4708333333,
    "Percent": 80.50229978354871,
    "Rank": 648
  },
  {
    "ID": 240,
    "NAME": "اسماء سلامه عبدالرحمن على مناع",
    "Old_Total": 1531.6,
    "4th year": 947.39166666667,
    "Cumulative": 2478.99166666667,
    "Percent": 80.48674242424254,
    "Rank": 649
  },
  {
    "ID": 1184,
    "NAME": "عبد الله احمد يس ابوكريشة",
    "Old_Total": 1413.85,
    "4th year": 1062.7666666667,
    "Cumulative": 2476.6166666667,
    "Percent": 80.40963203463312,
    "Rank": 650
  },
  {
    "ID": 1528,
    "NAME": "لوجينا حسين السيد السيد ادريس",
    "Old_Total": 1440.6,
    "4th year": 1034.9125,
    "Cumulative": 2475.5125,
    "Percent": 80.37378246753246,
    "Rank": 651
  },
  {
    "ID": 2154,
    "NAME": "نور عباس عبد الفتاح محمد شحاته",
    "Old_Total": 1460.2,
    "4th year": 1014.8166666667,
    "Cumulative": 2475.0166666667,
    "Percent": 80.35768398268507,
    "Rank": 652
  },
  {
    "ID": 508,
    "NAME": "جنى سامي عبدالحميد محمد",
    "Old_Total": 1463.1,
    "4th year": 1009.1833333333,
    "Cumulative": 2472.2833333333,
    "Percent": 80.26893939393831,
    "Rank": 653
  },
  {
    "ID": 2328,
    "NAME": "يوسف احمد محمد عبدالفتاح خيرالله",
    "Old_Total": 1473.4,
    "4th year": 997.44166666667,
    "Cumulative": 2470.84166666667,
    "Percent": 80.22213203463214,
    "Rank": 654
  },
  {
    "ID": 1929,
    "NAME": "مصطفى حسن محمد سليمان يوسف",
    "Old_Total": 1296.4,
    "4th year": 1174.425,
    "Cumulative": 2470.825,
    "Percent": 80.2215909090909,
    "Rank": 655
  },
  {
    "ID": 896,
    "NAME": "سعاد احمد متولي عثمان علي",
    "Old_Total": 1424.3,
    "4th year": 1046.2666666667,
    "Cumulative": 2470.5666666667,
    "Percent": 80.21320346320455,
    "Rank": 656
  },
  {
    "ID": 1630,
    "NAME": "محمد اشرف محمد عبدالمطلب",
    "Old_Total": 1485.53,
    "4th year": 984.13333333333,
    "Cumulative": 2469.66333333333,
    "Percent": 80.18387445887436,
    "Rank": 657
  },
  {
    "ID": 1372,
    "NAME": "عمر قطب السيد السيد",
    "Old_Total": 1400.45,
    "4th year": 1066.4208333333,
    "Cumulative": 2466.8708333333,
    "Percent": 80.09320887445779,
    "Rank": 658
  },
  {
    "ID": 1571,
    "NAME": "مازن سامح عبد القادر منطاوي",
    "Old_Total": 1444.85,
    "4th year": 1021.4958333333,
    "Cumulative": 2466.3458333333,
    "Percent": 80.07616341991233,
    "Rank": 659
  },
  {
    "ID": 1999,
    "NAME": "منة الله خالد عبد الحكيم حميدان",
    "Old_Total": 1419.15,
    "4th year": 1045.8791666667,
    "Cumulative": 2465.0291666667,
    "Percent": 80.03341450216558,
    "Rank": 660
  },
  {
    "ID": 1232,
    "NAME": "عبد الله مصطفى السيد محمد السيد البنا",
    "Old_Total": 1488.75,
    "4th year": 976.2125,
    "Cumulative": 2464.9625,
    "Percent": 80.03125,
    "Rank": 661
  },
  {
    "ID": 2216,
    "NAME": "هدى عبدالعزيز عبدالعزيز رمضان باشا",
    "Old_Total": 1494.2,
    "4th year": 970.1,
    "Cumulative": 2464.3,
    "Percent": 80.00974025974027,
    "Rank": 662
  },
  {
    "ID": 921,
    "NAME": "سلمى محمد مصطفى عريبي",
    "Old_Total": 1416,
    "4th year": 1047.6333333333,
    "Cumulative": 2463.6333333333,
    "Percent": 79.98809523809416,
    "Rank": 663
  },
  {
    "ID": 1843,
    "NAME": "محمود علاءالدين محمد سعد قنديل",
    "Old_Total": 1424.95,
    "4th year": 1038.275,
    "Cumulative": 2463.225,
    "Percent": 79.97483766233768,
    "Rank": 664
  },
  {
    "ID": 1668,
    "NAME": "محمد حسن محمد حسان محمد",
    "Old_Total": 1391.55,
    "4th year": 1069.9958333333,
    "Cumulative": 2461.5458333333,
    "Percent": 79.92031926406818,
    "Rank": 665
  },
  {
    "ID": 1126,
    "NAME": "عبد الرحمن علاء عبدالعزيز رمضان باشا",
    "Old_Total": 1420.55,
    "4th year": 1039.375,
    "Cumulative": 2459.925,
    "Percent": 79.86769480519482,
    "Rank": 666
  },
  {
    "ID": 2347,
    "NAME": "يوسف عمرو حمدى الجوهرى",
    "Old_Total": 1495,
    "4th year": 964.10416666667,
    "Cumulative": 2459.10416666667,
    "Percent": 79.84104437229449,
    "Rank": 667
  },
  {
    "ID": 205,
    "NAME": "اسامه مبروك محمد سويف",
    "Old_Total": 1448.9,
    "4th year": 1009.9583333333,
    "Cumulative": 2458.8583333333,
    "Percent": 79.8330627705617,
    "Rank": 668
  },
  {
    "ID": 1982,
    "NAME": "ملك ياسر السيد ادريس",
    "Old_Total": 1469.35,
    "4th year": 988.83333333333,
    "Cumulative": 2458.18333333333,
    "Percent": 79.81114718614707,
    "Rank": 669
  },
  {
    "ID": 2109,
    "NAME": "ندى عبد المنعم محمد الخولي",
    "Old_Total": 1421.4,
    "4th year": 1036.725,
    "Cumulative": 2458.125,
    "Percent": 79.80925324675324,
    "Rank": 670
  },
  {
    "ID": 1922,
    "NAME": "مريم وائل محمد احمد البنا",
    "Old_Total": 1526.3,
    "4th year": 931.22083333333,
    "Cumulative": 2457.52083333333,
    "Percent": 79.78963744588732,
    "Rank": 671
  },
  {
    "ID": 1390,
    "NAME": "عمرو اسماعيل فتح الله اسماعيل بسيونى",
    "Old_Total": 1411.7,
    "4th year": 1041.3416666667,
    "Cumulative": 2453.0416666667,
    "Percent": 79.64420995671104,
    "Rank": 672
  },
  {
    "ID": 736,
    "NAME": "رنيم سعيد عبده محمد عبده",
    "Old_Total": 1473.9,
    "4th year": 976.85833333333,
    "Cumulative": 2450.75833333333,
    "Percent": 79.57007575757565,
    "Rank": 673
  },
  {
    "ID": 2285,
    "NAME": "ياسين احمد عبدالعزيز القادوم",
    "Old_Total": 1440.65,
    "4th year": 1009.8416666667,
    "Cumulative": 2450.4916666667,
    "Percent": 79.56141774891883,
    "Rank": 674
  },
  {
    "ID": 1822,
    "NAME": "محمد ياسر محمد عبد العزيز سيد",
    "Old_Total": 1391.65,
    "4th year": 1058.1041666667,
    "Cumulative": 2449.7541666667,
    "Percent": 79.53747294372403,
    "Rank": 675
  },
  {
    "ID": 2286,
    "NAME": "ياسين صبرى شحاته محمد عطالله",
    "Old_Total": 1402.35,
    "4th year": 1047.1791666667,
    "Cumulative": 2449.5291666667,
    "Percent": 79.53016774891883,
    "Rank": 676
  },
  {
    "ID": 876,
    "NAME": "ساندى حسن ابراهيم ماضى",
    "Old_Total": 1397.05,
    "4th year": 1052.275,
    "Cumulative": 2449.325,
    "Percent": 79.52353896103895,
    "Rank": 677
  },
  {
    "ID": 2352,
    "NAME": "يوسف محمد جابر علي الشافعي",
    "Old_Total": 1385.7,
    "4th year": 1062.5666666667,
    "Cumulative": 2448.2666666667,
    "Percent": 79.48917748917857,
    "Rank": 678
  },
  {
    "ID": 780,
    "NAME": "ريم محمود محمد مرضي",
    "Old_Total": 1387.05,
    "4th year": 1061.0666666667,
    "Cumulative": 2448.1166666667,
    "Percent": 79.48430735930843,
    "Rank": 679
  },
  {
    "ID": 68,
    "NAME": "احمد سامح عرفه حسن القحافى",
    "Old_Total": 1487.35,
    "4th year": 960.71666666667,
    "Cumulative": 2448.06666666667,
    "Percent": 79.4826839826841,
    "Rank": 680
  },
  {
    "ID": 1458,
    "NAME": "فريدة اسامة عبدالحليم مناع",
    "Old_Total": 1380.75,
    "4th year": 1066.1041666667,
    "Cumulative": 2446.8541666667,
    "Percent": 79.44331709956816,
    "Rank": 681
  },
  {
    "ID": 2545,
    "NAME": "احمد محمد رفعت ابراهيم بسيوني",
    "Old_Total": 1444.3,
    "4th year": 998.8125,
    "Cumulative": 2443.1125,
    "Percent": 79.32183441558442,
    "Rank": 682
  },
  {
    "ID": 2146,
    "NAME": "نور الهدى اسلام بسيونى زيدان عيد",
    "Old_Total": 1466.95,
    "4th year": 975.64583333333,
    "Cumulative": 2442.59583333333,
    "Percent": 79.30505952380942,
    "Rank": 683
  },
  {
    "ID": 2261,
    "NAME": "ولاء اسامه محمد احمد القلفاط",
    "Old_Total": 1357.6,
    "4th year": 1083.2791666667,
    "Cumulative": 2440.8791666667,
    "Percent": 79.24932359307468,
    "Rank": 684
  },
  {
    "ID": 2132,
    "NAME": "نهى ابراهيم محمد نوبى احمد",
    "Old_Total": 1479.45,
    "4th year": 961.41666666667,
    "Cumulative": 2440.86666666667,
    "Percent": 79.24891774891786,
    "Rank": 685
  },
  {
    "ID": 563,
    "NAME": "حسام نصر الدين صبحي يوسف بسيوني جبر",
    "Old_Total": 1434.3,
    "4th year": 1004.9166666667,
    "Cumulative": 2439.2166666667,
    "Percent": 79.1953463203474,
    "Rank": 686
  },
  {
    "ID": 1829,
    "NAME": "محمود احمد محمد محمود عفش",
    "Old_Total": 1418.4,
    "4th year": 1019.55,
    "Cumulative": 2437.95,
    "Percent": 79.15422077922078,
    "Rank": 687
  },
  {
    "ID": 808,
    "NAME": "زياد سامي خطاب زغلوله",
    "Old_Total": 1416.2,
    "4th year": 1019.8333333333,
    "Cumulative": 2436.0333333333,
    "Percent": 79.09199134199027,
    "Rank": 688
  },
  {
    "ID": 2098,
    "NAME": "نانسي محمد حسين محمد محمد على",
    "Old_Total": 1545.2,
    "4th year": 890.26666666667,
    "Cumulative": 2435.46666666667,
    "Percent": 79.07359307359317,
    "Rank": 689
  },
  {
    "ID": 605,
    "NAME": "حنان اشرف السيد شعبان العوضى",
    "Old_Total": 1394.05,
    "4th year": 1041.3333333333,
    "Cumulative": 2435.3833333333,
    "Percent": 79.07088744588636,
    "Rank": 690
  },
  {
    "ID": 1602,
    "NAME": "محمد احمد حامد المسدي",
    "Old_Total": 1386.3,
    "4th year": 1048.7833333333,
    "Cumulative": 2435.0833333333,
    "Percent": 79.0611471861461,
    "Rank": 691
  },
  {
    "ID": 764,
    "NAME": "روفيده محمد البكرى احمد",
    "Old_Total": 1420.2,
    "4th year": 1014.5791666667,
    "Cumulative": 2434.7791666667,
    "Percent": 79.05127164502272,
    "Rank": 692
  },
  {
    "ID": 2321,
    "NAME": "يوسف ابراهيم فتحى عبد الفتاح",
    "Old_Total": 1416.5,
    "4th year": 1015.9625,
    "Cumulative": 2432.4625,
    "Percent": 78.9760551948052,
    "Rank": 693
  },
  {
    "ID": 940,
    "NAME": "سمر نزيه فرج عطيه الصابر عرعاص",
    "Old_Total": 1410,
    "4th year": 1022.4375,
    "Cumulative": 2432.4375,
    "Percent": 78.97524350649351,
    "Rank": 694
  },
  {
    "ID": 260,
    "NAME": "اشرقت محمد عشري محمد عبد الفتاح",
    "Old_Total": 1411.15,
    "4th year": 1021.0916666667,
    "Cumulative": 2432.2416666667,
    "Percent": 78.96888528138636,
    "Rank": 695
  },
  {
    "ID": 1305,
    "NAME": "على محمد علي احمد صبحي",
    "Old_Total": 1476.1,
    "4th year": 955.89583333333,
    "Cumulative": 2431.99583333333,
    "Percent": 78.96090367965355,
    "Rank": 696
  },
  {
    "ID": 2333,
    "NAME": "يوسف ايهاب محروس يوسف",
    "Old_Total": 1499.06,
    "4th year": 932.88333333333,
    "Cumulative": 2431.94333333333,
    "Percent": 78.95919913419903,
    "Rank": 697
  },
  {
    "ID": 1916,
    "NAME": "مريم محمد صلاح احمد جاد",
    "Old_Total": 1505.4,
    "4th year": 925.34583333333,
    "Cumulative": 2430.74583333333,
    "Percent": 78.92031926406916,
    "Rank": 698
  },
  {
    "ID": 1140,
    "NAME": "عبد الرحمن محمد جابر محمود علام",
    "Old_Total": 1431.9,
    "4th year": 998.19166666667,
    "Cumulative": 2430.09166666667,
    "Percent": 78.89908008658018,
    "Rank": 699
  },
  {
    "ID": 46,
    "NAME": "احمد ايهاب حسن جابر",
    "Old_Total": 1394.3,
    "4th year": 1035.5416666667,
    "Cumulative": 2429.8416666667,
    "Percent": 78.89096320346428,
    "Rank": 700
  },
  {
    "ID": 689,
    "NAME": "رحمه عماد ابو المجد صديق احمد",
    "Old_Total": 1519.6,
    "4th year": 910.05416666667,
    "Cumulative": 2429.65416666667,
    "Percent": 78.88487554112564,
    "Rank": 701
  },
  {
    "ID": 1896,
    "NAME": "مريم جمال خليل احمد عبد النبي",
    "Old_Total": 1473.2,
    "4th year": 954.39583333333,
    "Cumulative": 2427.59583333333,
    "Percent": 78.81804653679644,
    "Rank": 702
  },
  {
    "ID": 1515,
    "NAME": "لجين ابراهيم علام ابراهيم",
    "Old_Total": 1415.2,
    "4th year": 1011.2083333333,
    "Cumulative": 2426.4083333333,
    "Percent": 78.77949134199027,
    "Rank": 703
  },
  {
    "ID": 268,
    "NAME": "الاء صلاح الدين عبد المقصود عوض",
    "Old_Total": 1408.05,
    "4th year": 1016.7666666667,
    "Cumulative": 2424.8166666667,
    "Percent": 78.72781385281493,
    "Rank": 704
  },
  {
    "ID": 1513,
    "NAME": "لارا عماد منيرميخائيل جرجس",
    "Old_Total": 1360.7,
    "4th year": 1063.8958333333,
    "Cumulative": 2424.5958333333,
    "Percent": 78.72064393939286,
    "Rank": 705
  },
  {
    "ID": 2195,
    "NAME": "هاجر محمد ابراهيم عبدالله",
    "Old_Total": 1424,
    "4th year": 1000.2416666667,
    "Cumulative": 2424.2416666667,
    "Percent": 78.7091450216461,
    "Rank": 706
  },
  {
    "ID": 1089,
    "NAME": "عبد الرحمن ثروت ابراهيم المزين",
    "Old_Total": 1427,
    "4th year": 997.15416666667,
    "Cumulative": 2424.15416666667,
    "Percent": 78.70630411255422,
    "Rank": 707
  },
  {
    "ID": 1615,
    "NAME": "محمد احمد محمد عبده مصطفى",
    "Old_Total": 1513.8,
    "4th year": 908.4875,
    "Cumulative": 2422.2875,
    "Percent": 78.64569805194806,
    "Rank": 708
  },
  {
    "ID": 1867,
    "NAME": "مرثا مجدى يونان غطاس حنا",
    "Old_Total": 1385.9,
    "4th year": 1034.8875,
    "Cumulative": 2420.7875,
    "Percent": 78.59699675324676,
    "Rank": 709
  },
  {
    "ID": 215,
    "NAME": "اسراء سامح سيف النصر محمود",
    "Old_Total": 1481.4,
    "4th year": 936.67916666667,
    "Cumulative": 2418.07916666667,
    "Percent": 78.50906385281397,
    "Rank": 710
  },
  {
    "ID": 2295,
    "NAME": "يحيي وليد صلاح الدين احمد",
    "Old_Total": 1400.9,
    "4th year": 1016.0416666667,
    "Cumulative": 2416.9416666667,
    "Percent": 78.47213203463312,
    "Rank": 711
  },
  {
    "ID": 1631,
    "NAME": "محمد اشرف محمد محمود",
    "Old_Total": 1375.45,
    "4th year": 1035.4916666667,
    "Cumulative": 2410.9416666667,
    "Percent": 78.27732683982794,
    "Rank": 712
  },
  {
    "ID": 596,
    "NAME": "حمزه احمد جابر تهامى",
    "Old_Total": 1368.9,
    "4th year": 1041.7125,
    "Cumulative": 2410.6125,
    "Percent": 78.26663961038962,
    "Rank": 713
  },
  {
    "ID": 2312,
    "NAME": "يمنى امين حسن عبد الغنى زيتون",
    "Old_Total": 1468.7,
    "4th year": 939.50833333333,
    "Cumulative": 2408.20833333333,
    "Percent": 78.18858225108215,
    "Rank": 714
  },
  {
    "ID": 1971,
    "NAME": "ملك ايمن محمد أبو الفتح شعت",
    "Old_Total": 1368.35,
    "4th year": 1039.3958333333,
    "Cumulative": 2407.7458333333,
    "Percent": 78.17356601731493,
    "Rank": 715
  },
  {
    "ID": 191,
    "NAME": "اروى عبد المنعم بسيونى أحمد بسيونى",
    "Old_Total": 1390.1,
    "4th year": 1016.2208333333,
    "Cumulative": 2406.3208333333,
    "Percent": 78.1272997835487,
    "Rank": 716
  },
  {
    "ID": 2273,
    "NAME": "يارا محمد السيد سعيد طبيخه",
    "Old_Total": 1427.3,
    "4th year": 978.39166666667,
    "Cumulative": 2405.69166666667,
    "Percent": 78.1068722943724,
    "Rank": 717
  },
  {
    "ID": 166,
    "NAME": "احمد نورالدين محمد اسماعيل",
    "Old_Total": 1385.2,
    "4th year": 1018.7833333333,
    "Cumulative": 2403.9833333333,
    "Percent": 78.05140692640585,
    "Rank": 718
  },
  {
    "ID": 2176,
    "NAME": "نورهان علي مصباح علي المدبولي",
    "Old_Total": 1422.7,
    "4th year": 980.67916666667,
    "Cumulative": 2403.37916666667,
    "Percent": 78.03179112554123,
    "Rank": 719
  },
  {
    "ID": 1832,
    "NAME": "محمود ايمن عبد الجليل عبد الجيد فايد",
    "Old_Total": 1376.45,
    "4th year": 1025.8,
    "Cumulative": 2402.25,
    "Percent": 77.99512987012987,
    "Rank": 720
  },
  {
    "ID": 1109,
    "NAME": "عبد الرحمن خالد سعيد رجب طلبه",
    "Old_Total": 1382.6,
    "4th year": 1015.5666666667,
    "Cumulative": 2398.1666666667,
    "Percent": 77.86255411255519,
    "Rank": 721
  },
  {
    "ID": 523,
    "NAME": "جورج اشرف قطيط كامل تكلا",
    "Old_Total": 1405.3,
    "4th year": 992.71666666667,
    "Cumulative": 2398.01666666667,
    "Percent": 77.8576839826841,
    "Rank": 722
  },
  {
    "ID": 219,
    "NAME": "اسراء محمد عبدالعال بسيونى",
    "Old_Total": 1414.95,
    "4th year": 981.86666666667,
    "Cumulative": 2396.81666666667,
    "Percent": 77.81872294372306,
    "Rank": 723
  },
  {
    "ID": 2081,
    "NAME": "مينا جاد السيد جورج جاد السيد",
    "Old_Total": 1268.15,
    "4th year": 1127.475,
    "Cumulative": 2395.625,
    "Percent": 77.78003246753246,
    "Rank": 724
  },
  {
    "ID": 845,
    "NAME": "ساره احمد محمد السيد اسماعيل",
    "Old_Total": 1443.75,
    "4th year": 951.54166666667,
    "Cumulative": 2395.29166666667,
    "Percent": 77.76920995671007,
    "Rank": 725
  },
  {
    "ID": 1103,
    "NAME": "عبد الرحمن الشربيني أحمد الشربيني",
    "Old_Total": 1469.05,
    "4th year": 926.14583333333,
    "Cumulative": 2395.19583333333,
    "Percent": 77.76609848484838,
    "Rank": 726
  },
  {
    "ID": 1336,
    "NAME": "عمر السعيد محمود احمد اسكندر",
    "Old_Total": 1399.15,
    "4th year": 995.47083333333,
    "Cumulative": 2394.62083333333,
    "Percent": 77.74742965367956,
    "Rank": 727
  },
  {
    "ID": 529,
    "NAME": "جوى حاتم محمد غزاله",
    "Old_Total": 1361,
    "4th year": 1032.0708333333,
    "Cumulative": 2393.0708333333,
    "Percent": 77.69710497835389,
    "Rank": 728
  },
  {
    "ID": 847,
    "NAME": "ساره العربى عبد الرازق عبد العزيز عبد الرازق",
    "Old_Total": 1408.75,
    "4th year": 981.85416666667,
    "Cumulative": 2390.60416666667,
    "Percent": 77.61701839826851,
    "Rank": 729
  },
  {
    "ID": 755,
    "NAME": "روان محمد السيد شحاتة",
    "Old_Total": 1398.45,
    "4th year": 991.4625,
    "Cumulative": 2389.9125,
    "Percent": 77.59456168831169,
    "Rank": 730
  },
  {
    "ID": 762,
    "NAME": "روفان امجد المحب مشالي",
    "Old_Total": 1396.6,
    "4th year": 991.5375,
    "Cumulative": 2388.1375,
    "Percent": 77.53693181818181,
    "Rank": 731
  },
  {
    "ID": 648,
    "NAME": "دارين حاتم ابوالهدى محمد",
    "Old_Total": 1311.45,
    "4th year": 1076.3625,
    "Cumulative": 2387.8125,
    "Percent": 77.52637987012987,
    "Rank": 732
  },
  {
    "ID": 1727,
    "NAME": "محمد عبد الناصر محمد عبد المجيد",
    "Old_Total": 1377.9,
    "4th year": 1009.225,
    "Cumulative": 2387.125,
    "Percent": 77.50405844155844,
    "Rank": 733
  },
  {
    "ID": 1764,
    "NAME": "محمد محمد حسين على قناوى",
    "Old_Total": 1519.05,
    "4th year": 867.67083333333,
    "Cumulative": 2386.72083333333,
    "Percent": 77.49093614718603,
    "Rank": 734
  },
  {
    "ID": 1400,
    "NAME": "عمرو على مهران محمد على",
    "Old_Total": 1483.75,
    "4th year": 901.7125,
    "Cumulative": 2385.4625,
    "Percent": 77.45008116883118,
    "Rank": 735
  },
  {
    "ID": 79,
    "NAME": "احمد صفوت عبد القادر عبد الله عوض",
    "Old_Total": 1419.7,
    "4th year": 963.88333333333,
    "Cumulative": 2383.58333333333,
    "Percent": 77.38906926406916,
    "Rank": 736
  },
  {
    "ID": 362,
    "NAME": "اية هشام أحمد الشناوى ابو غرارة",
    "Old_Total": 1323.85,
    "4th year": 1058.1833333333,
    "Cumulative": 2382.0333333333,
    "Percent": 77.33874458874351,
    "Rank": 737
  },
  {
    "ID": 143,
    "NAME": "احمد محمد محمود عامر",
    "Old_Total": 1411.7,
    "4th year": 970.30833333333,
    "Cumulative": 2382.00833333333,
    "Percent": 77.33793290043279,
    "Rank": 738
  },
  {
    "ID": 1046,
    "NAME": "صليب عادل فكري حسب الله",
    "Old_Total": 1386.75,
    "4th year": 991.4,
    "Cumulative": 2378.15,
    "Percent": 77.21266233766234,
    "Rank": 739
  },
  {
    "ID": 1435,
    "NAME": "فاطمه شريف سعيد رجب",
    "Old_Total": 1444.3,
    "4th year": 933.72916666667,
    "Cumulative": 2378.02916666667,
    "Percent": 77.20873917748928,
    "Rank": 740
  },
  {
    "ID": 1972,
    "NAME": "ملك حازم فوزي دويدار",
    "Old_Total": 1410.35,
    "4th year": 967.50833333333,
    "Cumulative": 2377.85833333333,
    "Percent": 77.20319264069254,
    "Rank": 741
  },
  {
    "ID": 1644,
    "NAME": "محمد ايمن احمد الرفاعي عبدالمجيد عثمان",
    "Old_Total": 1477.7,
    "4th year": 899.08333333333,
    "Cumulative": 2376.78333333333,
    "Percent": 77.16829004328994,
    "Rank": 742
  },
  {
    "ID": 1320,
    "NAME": "عماد عياد محمد سعد ابراهيم",
    "Old_Total": 1459.2,
    "4th year": 916.45416666667,
    "Cumulative": 2375.65416666667,
    "Percent": 77.1316287878789,
    "Rank": 743
  },
  {
    "ID": 1994,
    "NAME": "منة الله خالد مختار عبدالباقى شعيب",
    "Old_Total": 1393.45,
    "4th year": 981.57916666667,
    "Cumulative": 2375.02916666667,
    "Percent": 77.11133658008669,
    "Rank": 744
  },
  {
    "ID": 231,
    "NAME": "اسماء اشرف حسن محمد خضير",
    "Old_Total": 1394.45,
    "4th year": 978.975,
    "Cumulative": 2373.425,
    "Percent": 77.05925324675326,
    "Rank": 745
  },
  {
    "ID": 1043,
    "NAME": "صلاح الدين تامر حسن ابراهيم",
    "Old_Total": 1313.65,
    "4th year": 1059.6125,
    "Cumulative": 2373.2625,
    "Percent": 77.05397727272727,
    "Rank": 746
  },
  {
    "ID": 1150,
    "NAME": "عبد الرحمن مصطفى محمد ابراهيم درويش",
    "Old_Total": 1544.8,
    "4th year": 822.94166666667,
    "Cumulative": 2367.74166666667,
    "Percent": 76.87472943722955,
    "Rank": 747
  },
  {
    "ID": 2334,
    "NAME": "يوسف حمدى فتح الله ابو عمر",
    "Old_Total": 1546.2,
    "4th year": 819.725,
    "Cumulative": 2365.925,
    "Percent": 76.81574675324676,
    "Rank": 748
  },
  {
    "ID": 1556,
    "NAME": "لينه مصطفى محمد الشحات",
    "Old_Total": 1377.7,
    "4th year": 986.89583333333,
    "Cumulative": 2364.59583333333,
    "Percent": 76.77259199134188,
    "Rank": 749
  },
  {
    "ID": 1830,
    "NAME": "محمود احمد محمود شحاته",
    "Old_Total": 1434.15,
    "4th year": 928.31666666667,
    "Cumulative": 2362.46666666667,
    "Percent": 76.7034632034633,
    "Rank": 750
  },
  {
    "ID": 2111,
    "NAME": "ندى عماد خيرت السيد محمد",
    "Old_Total": 1369.1,
    "4th year": 992.95833333333,
    "Cumulative": 2362.05833333333,
    "Percent": 76.69020562770551,
    "Rank": 751
  },
  {
    "ID": 1664,
    "NAME": "محمد حامد حسين احمد حسين",
    "Old_Total": 1431.3,
    "4th year": 930.69166666667,
    "Cumulative": 2361.99166666667,
    "Percent": 76.68804112554123,
    "Rank": 752
  },
  {
    "ID": 870,
    "NAME": "سامر عميتة ناجي سليمان بخاطرة",
    "Old_Total": 1300.7,
    "4th year": 1061.0166666667,
    "Cumulative": 2361.7166666667,
    "Percent": 76.67911255411364,
    "Rank": 753
  },
  {
    "ID": 1887,
    "NAME": "مريم احمد السيد احمد",
    "Old_Total": 1365.95,
    "4th year": 994.70833333333,
    "Cumulative": 2360.65833333333,
    "Percent": 76.64475108225098,
    "Rank": 754
  },
  {
    "ID": 307,
    "NAME": "امنيه سامى عبدالمقصود على الشيخ",
    "Old_Total": 1372.95,
    "4th year": 983.92916666667,
    "Cumulative": 2356.87916666667,
    "Percent": 76.52205086580098,
    "Rank": 755
  },
  {
    "ID": 2087,
    "NAME": "نادر وجيه احمد محمود",
    "Old_Total": 1360.4,
    "4th year": 995.93333333333,
    "Cumulative": 2356.33333333333,
    "Percent": 76.50432900432891,
    "Rank": 756
  },
  {
    "ID": 1844,
    "NAME": "محمود علام محمود عبد الحليم علام",
    "Old_Total": 1354.75,
    "4th year": 1000.4208333333,
    "Cumulative": 2355.1708333333,
    "Percent": 76.46658549783442,
    "Rank": 757
  },
  {
    "ID": 450,
    "NAME": "بلال راغب سيف النصر محمود",
    "Old_Total": 1487.5,
    "4th year": 867.44583333333,
    "Cumulative": 2354.94583333333,
    "Percent": 76.4592803030302,
    "Rank": 758
  },
  {
    "ID": 781,
    "NAME": "ريم ياسر مصطفى صديق",
    "Old_Total": 1339.4,
    "4th year": 1014.2541666667,
    "Cumulative": 2353.6541666667,
    "Percent": 76.41734307359415,
    "Rank": 759
  },
  {
    "ID": 688,
    "NAME": "رحمه عطيه فضل ابو شليته",
    "Old_Total": 1369.275,
    "4th year": 981.82916666667,
    "Cumulative": 2351.10416666667,
    "Percent": 76.33455086580098,
    "Rank": 760
  },
  {
    "ID": 1430,
    "NAME": "فارس محمد كمال محمد",
    "Old_Total": 1263.55,
    "4th year": 1086.5,
    "Cumulative": 2350.05,
    "Percent": 76.30032467532469,
    "Rank": 761
  },
  {
    "ID": 942,
    "NAME": "سميه سامح عبد القادر رمضان",
    "Old_Total": 1392.4,
    "4th year": 956.425,
    "Cumulative": 2348.825,
    "Percent": 76.26055194805194,
    "Rank": 762
  },
  {
    "ID": 1778,
    "NAME": "محمد مخلص زين العابدين عبد الرحمن المصرى",
    "Old_Total": 1378.7,
    "4th year": 966.95,
    "Cumulative": 2345.65,
    "Percent": 76.15746753246754,
    "Rank": 763
  },
  {
    "ID": 1264,
    "NAME": "علا ابراهيم عبدالواحد سيداحمد حسنين",
    "Old_Total": 1432.7,
    "4th year": 912.2,
    "Cumulative": 2344.9,
    "Percent": 76.1331168831169,
    "Rank": 764
  },
  {
    "ID": 1548,
    "NAME": "لينا احمد فاروق عبد العزيز خضر",
    "Old_Total": 1360.3,
    "4th year": 984.07916666667,
    "Cumulative": 2344.37916666667,
    "Percent": 76.11620670995681,
    "Rank": 765
  },
  {
    "ID": 2236,
    "NAME": "هند ياسر على حسن عبادى",
    "Old_Total": 1314.05,
    "4th year": 1028.2041666667,
    "Cumulative": 2342.2541666667,
    "Percent": 76.0472132034643,
    "Rank": 766
  },
  {
    "ID": 217,
    "NAME": "اسراء عادل خميس عبد المحسن محمود",
    "Old_Total": 1318.6,
    "4th year": 1020.9583333333,
    "Cumulative": 2339.5583333333,
    "Percent": 75.95968614718505,
    "Rank": 767
  },
  {
    "ID": 372,
    "NAME": "ايمان شعبان مسعود عبداللطيف",
    "Old_Total": 1337.4,
    "4th year": 1000.7541666667,
    "Cumulative": 2338.1541666667,
    "Percent": 75.9140963203474,
    "Rank": 768
  },
  {
    "ID": 479,
    "NAME": "تسنيم ياسر عبد الحميد محمد الشيخ",
    "Old_Total": 1383.2,
    "4th year": 954.55833333333,
    "Cumulative": 2337.75833333333,
    "Percent": 75.90124458874448,
    "Rank": 769
  },
  {
    "ID": 727,
    "NAME": "رنا وليد السيد علي عمر مناع",
    "Old_Total": 1364.85,
    "4th year": 971.80416666667,
    "Cumulative": 2336.65416666667,
    "Percent": 75.86539502164513,
    "Rank": 770
  },
  {
    "ID": 704,
    "NAME": "رضوى محمد علي محمد",
    "Old_Total": 1379.15,
    "4th year": 957.48333333333,
    "Cumulative": 2336.63333333333,
    "Percent": 75.86471861471851,
    "Rank": 771
  },
  {
    "ID": 629,
    "NAME": "خالد فيصل إسماعيل بهنسي",
    "Old_Total": 1358.5,
    "4th year": 977.625,
    "Cumulative": 2336.125,
    "Percent": 75.84821428571429,
    "Rank": 772
  },
  {
    "ID": 212,
    "NAME": "اسراء ابراهيم محمد احمد",
    "Old_Total": 1425.6,
    "4th year": 910.49166666667,
    "Cumulative": 2336.09166666667,
    "Percent": 75.84713203463214,
    "Rank": 773
  },
  {
    "ID": 223,
    "NAME": "اسلام احمد سعيد عبدالرازق عبدالحق",
    "Old_Total": 1487.05,
    "4th year": 846.42083333333,
    "Cumulative": 2333.47083333333,
    "Percent": 75.76204004328993,
    "Rank": 774
  },
  {
    "ID": 162,
    "NAME": "احمد نبيل فرج السعداوى محمود",
    "Old_Total": 1345.3,
    "4th year": 987.1875,
    "Cumulative": 2332.4875,
    "Percent": 75.73011363636364,
    "Rank": 775
  },
  {
    "ID": 220,
    "NAME": "اسراء محمد فتحي حامد القفاص",
    "Old_Total": 1361.5,
    "4th year": 968.7,
    "Cumulative": 2330.2,
    "Percent": 75.65584415584415,
    "Rank": 776
  },
  {
    "ID": 1847,
    "NAME": "محمود محمد حنفي محمود خضر",
    "Old_Total": 1314.1,
    "4th year": 1015.1458333333,
    "Cumulative": 2329.2458333333,
    "Percent": 75.62486471861362,
    "Rank": 777
  },
  {
    "ID": 136,
    "NAME": "احمد محمد عبده خزيمى",
    "Old_Total": 1443.6,
    "4th year": 884.85416666667,
    "Cumulative": 2328.45416666667,
    "Percent": 75.59916125541136,
    "Rank": 778
  },
  {
    "ID": 1499,
    "NAME": "كريم ضياء شعبان محمد شيخ روحه",
    "Old_Total": 1380.1,
    "4th year": 946.18333333333,
    "Cumulative": 2326.28333333333,
    "Percent": 75.52867965367955,
    "Rank": 779
  },
  {
    "ID": 2182,
    "NAME": "نورين عاصم مجدي الكاشف",
    "Old_Total": 1407,
    "4th year": 917.52083333333,
    "Cumulative": 2324.52083333333,
    "Percent": 75.47145562770552,
    "Rank": 780
  },
  {
    "ID": 552,
    "NAME": "حبيبه محمد عبدالقادر عبدالحميد",
    "Old_Total": 1366.3,
    "4th year": 954.6625,
    "Cumulative": 2320.9625,
    "Percent": 75.35592532467533,
    "Rank": 781
  },
  {
    "ID": 2162,
    "NAME": "نور ياسر مصطفي جمال الدين خليل",
    "Old_Total": 1339.7,
    "4th year": 978.19166666667,
    "Cumulative": 2317.89166666667,
    "Percent": 75.25622294372305,
    "Rank": 782
  },
  {
    "ID": 2336,
    "NAME": "يوسف خليل حسن ابراهيم خليل",
    "Old_Total": 1387.7,
    "4th year": 930.10833333333,
    "Cumulative": 2317.80833333333,
    "Percent": 75.25351731601721,
    "Rank": 783
  },
  {
    "ID": 186,
    "NAME": "اروا عشرى فريج جويده",
    "Old_Total": 1448.65,
    "4th year": 867.8375,
    "Cumulative": 2316.4875,
    "Percent": 75.21063311688312,
    "Rank": 784
  },
  {
    "ID": 515,
    "NAME": "جنى وليد محمد حسن الشنشوري",
    "Old_Total": 1336.75,
    "4th year": 976.7125,
    "Cumulative": 2313.4625,
    "Percent": 75.11241883116884,
    "Rank": 785
  },
  {
    "ID": 34,
    "NAME": "احمد ابراهيم فاروق سعد الششتاوى",
    "Old_Total": 1412.8,
    "4th year": 900.54583333333,
    "Cumulative": 2313.34583333333,
    "Percent": 75.10863095238085,
    "Rank": 786
  },
  {
    "ID": 2027,
    "NAME": "منى حمدى عبد اللطيف محمد",
    "Old_Total": 1303.35,
    "4th year": 1009.2791666667,
    "Cumulative": 2312.6291666667,
    "Percent": 75.08536255411363,
    "Rank": 787
  },
  {
    "ID": 38,
    "NAME": "احمد اشرف عبد الفتاح عبد ربه",
    "Old_Total": 1322.3,
    "4th year": 988.61666666667,
    "Cumulative": 2310.91666666667,
    "Percent": 75.02976190476201,
    "Rank": 788
  },
  {
    "ID": 2282,
    "NAME": "ياسمين ياسر محمد الشويخ",
    "Old_Total": 1394.45,
    "4th year": 915.93333333333,
    "Cumulative": 2310.38333333333,
    "Percent": 75.01244588744578,
    "Rank": 789
  },
  {
    "ID": 2275,
    "NAME": "يارا منتصر عبد الفتاح محمد",
    "Old_Total": 1358.6,
    "4th year": 951.18333333333,
    "Cumulative": 2309.78333333333,
    "Percent": 74.99296536796525,
    "Rank": 790
  },
  {
    "ID": 1290,
    "NAME": "على سليمان عبد العزيز سليمان",
    "Old_Total": 1388,
    "4th year": 921.50833333333,
    "Cumulative": 2309.50833333333,
    "Percent": 74.98403679653669,
    "Rank": 791
  },
  {
    "ID": 1544,
    "NAME": "ليلى محمد محمود اسماعيل خليف",
    "Old_Total": 1293.1,
    "4th year": 1015.3583333333,
    "Cumulative": 2308.4583333333,
    "Percent": 74.9499458874448,
    "Rank": 792
  },
  {
    "ID": 51,
    "NAME": "احمد حسام الدين فتحى ابوالخير",
    "Old_Total": 1304.9,
    "4th year": 1002.6708333333,
    "Cumulative": 2307.5708333333,
    "Percent": 74.92113095237987,
    "Rank": 793
  },
  {
    "ID": 703,
    "NAME": "رضوة احمد شحات يوسف خليفة",
    "Old_Total": 1311.35,
    "4th year": 992.9375,
    "Cumulative": 2304.2875,
    "Percent": 74.8145292207792,
    "Rank": 794
  },
  {
    "ID": 867,
    "NAME": "سامح وحيد محمد شحاته عبدالرحمن",
    "Old_Total": 1281.75,
    "4th year": 1015.1125,
    "Cumulative": 2296.8625,
    "Percent": 74.5734577922078,
    "Rank": 795
  },
  {
    "ID": 1928,
    "NAME": "مصطفى ايهاب حيدر احمد",
    "Old_Total": 1338.75,
    "4th year": 957.78333333333,
    "Cumulative": 2296.53333333333,
    "Percent": 74.56277056277045,
    "Rank": 796
  },
  {
    "ID": 1890,
    "NAME": "مريم اسامه كامل نور الدين",
    "Old_Total": 1274,
    "4th year": 1022.15,
    "Cumulative": 2296.15,
    "Percent": 74.55032467532467,
    "Rank": 797
  },
  {
    "ID": 1754,
    "NAME": "محمد فيالة محمد محروس احمد",
    "Old_Total": 1385,
    "4th year": 910.9,
    "Cumulative": 2295.9,
    "Percent": 74.54220779220779,
    "Rank": 798
  },
  {
    "ID": 2353,
    "NAME": "يوسف محمد حسن عبدالقوي",
    "Old_Total": 1337.4,
    "4th year": 958.31666666667,
    "Cumulative": 2295.71666666667,
    "Percent": 74.53625541125551,
    "Rank": 799
  },
  {
    "ID": 211,
    "NAME": "اسر محمد اسامه موسي",
    "Old_Total": 1344.25,
    "4th year": 950.50416666667,
    "Cumulative": 2294.75416666667,
    "Percent": 74.50500541125552,
    "Rank": 800
  },
  {
    "ID": 329,
    "NAME": "انجى احمد سعد خليل ابراهيم",
    "Old_Total": 1349.1,
    "4th year": 945.47083333333,
    "Cumulative": 2294.57083333333,
    "Percent": 74.49905303030292,
    "Rank": 801
  },
  {
    "ID": 271,
    "NAME": "الاء عبد البديع عبد العليم الجمال",
    "Old_Total": 1356.3,
    "4th year": 937.00833333333,
    "Cumulative": 2293.30833333333,
    "Percent": 74.45806277056265,
    "Rank": 802
  },
  {
    "ID": 1910,
    "NAME": "مريم علاء محمد السطوحى",
    "Old_Total": 1277.45,
    "4th year": 1014.0375,
    "Cumulative": 2291.4875,
    "Percent": 74.39894480519482,
    "Rank": 803
  },
  {
    "ID": 912,
    "NAME": "سلمى سليمان عبدالعزيز سليمان",
    "Old_Total": 1345.2,
    "4th year": 945.4625,
    "Cumulative": 2290.6625,
    "Percent": 74.37215909090908,
    "Rank": 804
  },
  {
    "ID": 225,
    "NAME": "اسلام حمدي محمد محمد قريطم",
    "Old_Total": 1414.5,
    "4th year": 876.04166666667,
    "Cumulative": 2290.54166666667,
    "Percent": 74.36823593073605,
    "Rank": 805
  },
  {
    "ID": 773,
    "NAME": "ريتاج ابراهيم حسن محمد",
    "Old_Total": 1295.85,
    "4th year": 992.92083333333,
    "Cumulative": 2288.77083333333,
    "Percent": 74.31074134199123,
    "Rank": 806
  },
  {
    "ID": 535,
    "NAME": "حازم احمد عبد الوهاب احمد قوطة",
    "Old_Total": 1322,
    "4th year": 965.60416666667,
    "Cumulative": 2287.60416666667,
    "Percent": 74.27286255411266,
    "Rank": 807
  },
  {
    "ID": 853,
    "NAME": "ساره عبدالسلام مصطفى عبدالحميد",
    "Old_Total": 1287.95,
    "4th year": 999.1625,
    "Cumulative": 2287.1125,
    "Percent": 74.25689935064935,
    "Rank": 808
  },
  {
    "ID": 2338,
    "NAME": "يوسف زكريا عاشور ابوسنه",
    "Old_Total": 1396.8,
    "4th year": 890.01666666667,
    "Cumulative": 2286.81666666667,
    "Percent": 74.24729437229448,
    "Rank": 809
  },
  {
    "ID": 374,
    "NAME": "ايمان عبدالله عبدالله ابراهيم ناصر",
    "Old_Total": 1362.1,
    "4th year": 923.84583333333,
    "Cumulative": 2285.94583333333,
    "Percent": 74.21902056277045,
    "Rank": 810
  },
  {
    "ID": 966,
    "NAME": "سيف الله السيد محمد خيري محمد",
    "Old_Total": 1448.4,
    "4th year": 837.29583333333,
    "Cumulative": 2285.69583333333,
    "Percent": 74.21090367965357,
    "Rank": 811
  },
  {
    "ID": 1485,
    "NAME": "كارول شريف ويصا لبيب",
    "Old_Total": 1314.8,
    "4th year": 968.49583333333,
    "Cumulative": 2283.29583333333,
    "Percent": 74.1329816017315,
    "Rank": 812
  },
  {
    "ID": 551,
    "NAME": "حبيبه محمد السيد فضل الله عبدالحليم",
    "Old_Total": 1385.1,
    "4th year": 896.89166666667,
    "Cumulative": 2281.99166666667,
    "Percent": 74.09063852813863,
    "Rank": 813
  },
  {
    "ID": 236,
    "NAME": "اسماء بهاء الدين فؤاد احمد",
    "Old_Total": 1430.35,
    "4th year": 851.09166666667,
    "Cumulative": 2281.44166666667,
    "Percent": 74.07278138528149,
    "Rank": 814
  },
  {
    "ID": 504,
    "NAME": "جنا وائل محمود سالم",
    "Old_Total": 1367.5,
    "4th year": 913.70416666667,
    "Cumulative": 2281.20416666667,
    "Percent": 74.06507034632045,
    "Rank": 815
  },
  {
    "ID": 809,
    "NAME": "زياد شريف عبدالسلام ابوالخير",
    "Old_Total": 1409,
    "4th year": 869.375,
    "Cumulative": 2278.375,
    "Percent": 73.97321428571428,
    "Rank": 816
  },
  {
    "ID": 777,
    "NAME": "ريم علي مصباح علي المدبولي",
    "Old_Total": 1360.1,
    "4th year": 916.9875,
    "Cumulative": 2277.0875,
    "Percent": 73.93141233766232,
    "Rank": 817
  },
  {
    "ID": 316,
    "NAME": "اميره احمد رشاد احمد",
    "Old_Total": 1318.15,
    "4th year": 955.87916666667,
    "Cumulative": 2274.02916666667,
    "Percent": 73.8321158008659,
    "Rank": 818
  },
  {
    "ID": 115,
    "NAME": "احمد متولي محمد متولي",
    "Old_Total": 1395.5,
    "4th year": 877.72083333333,
    "Cumulative": 2273.22083333333,
    "Percent": 73.8058712121211,
    "Rank": 819
  },
  {
    "ID": 52,
    "NAME": "احمد حسام عبد المجيد علي",
    "Old_Total": 1374.5,
    "4th year": 896.66666666667,
    "Cumulative": 2271.16666666667,
    "Percent": 73.73917748917759,
    "Rank": 820
  },
  {
    "ID": 2080,
    "NAME": "ميلانه فؤاد لمعي زامك",
    "Old_Total": 1233,
    "4th year": 1036.475,
    "Cumulative": 2269.475,
    "Percent": 73.68425324675324,
    "Rank": 821
  },
  {
    "ID": 2235,
    "NAME": "هند محمد صلاح طماره",
    "Old_Total": 1283.15,
    "4th year": 984.6625,
    "Cumulative": 2267.8125,
    "Percent": 73.63027597402598,
    "Rank": 822
  },
  {
    "ID": 60,
    "NAME": "احمد خميس الحسيني حماد",
    "Old_Total": 1342.7,
    "4th year": 923.50416666667,
    "Cumulative": 2266.20416666667,
    "Percent": 73.57805735930746,
    "Rank": 823
  },
  {
    "ID": 2197,
    "NAME": "هاجر مصطفى ابوالثنا ابوالعينين",
    "Old_Total": 1297.65,
    "4th year": 967.91666666667,
    "Cumulative": 2265.56666666667,
    "Percent": 73.55735930735943,
    "Rank": 824
  },
  {
    "ID": 746,
    "NAME": "رواء محمد عبدالله ابراهيم",
    "Old_Total": 1376.7,
    "4th year": 887.0125,
    "Cumulative": 2263.7125,
    "Percent": 73.4971590909091,
    "Rank": 825
  },
  {
    "ID": 1877,
    "NAME": "مروان محمد السيد عيد",
    "Old_Total": 1323.3,
    "4th year": 940.15416666667,
    "Cumulative": 2263.45416666667,
    "Percent": 73.48877164502176,
    "Rank": 826
  },
  {
    "ID": 1840,
    "NAME": "محمود عبدالمعطى محمود عبد المعطى مشالى",
    "Old_Total": 1346,
    "4th year": 908.64583333333,
    "Cumulative": 2254.64583333333,
    "Percent": 73.20278679653669,
    "Rank": 827
  },
  {
    "ID": 978,
    "NAME": "شروق جابر محمد شعبان",
    "Old_Total": 1276.4,
    "4th year": 978.12083333333,
    "Cumulative": 2254.52083333333,
    "Percent": 73.19872835497826,
    "Rank": 828
  },
  {
    "ID": 748,
    "NAME": "روان احمد محمد جابر علي المناديلى",
    "Old_Total": 1263.3,
    "4th year": 991.04166666667,
    "Cumulative": 2254.34166666667,
    "Percent": 73.19291125541136,
    "Rank": 829
  },
  {
    "ID": 2064,
    "NAME": "ميادة ماهر ابراهيم محمد قطوش",
    "Old_Total": 1369.8,
    "4th year": 881.96666666667,
    "Cumulative": 2251.76666666667,
    "Percent": 73.10930735930748,
    "Rank": 830
  },
  {
    "ID": 1570,
    "NAME": "مازن خالد حسن احمد السيد",
    "Old_Total": 1249.3,
    "4th year": 1002.3958333333,
    "Cumulative": 2251.6958333333,
    "Percent": 73.10700757575648,
    "Rank": 831
  },
  {
    "ID": 1834,
    "NAME": "محمود خميس محمد بدر",
    "Old_Total": 1322.5,
    "4th year": 928.675,
    "Cumulative": 2251.175,
    "Percent": 73.09009740259741,
    "Rank": 832
  },
  {
    "ID": 864,
    "NAME": "ساره يحيى عبدالحميد عواد السيد",
    "Old_Total": 1394.8,
    "4th year": 855.19166666667,
    "Cumulative": 2249.99166666667,
    "Percent": 73.05167748917759,
    "Rank": 833
  },
  {
    "ID": 334,
    "NAME": "اندرو زكى اسحاق بدروس",
    "Old_Total": 1430.1,
    "4th year": 817.38333333333,
    "Cumulative": 2247.48333333333,
    "Percent": 72.97023809523799,
    "Rank": 834
  },
  {
    "ID": 274,
    "NAME": "الاء غانم فايز غانم",
    "Old_Total": 1328.3,
    "4th year": 917.175,
    "Cumulative": 2245.475,
    "Percent": 72.90503246753246,
    "Rank": 835
  },
  {
    "ID": 772,
    "NAME": "ريتا مجدي عزيز صبحي اسكندر",
    "Old_Total": 1378.55,
    "4th year": 866.70833333333,
    "Cumulative": 2245.25833333333,
    "Percent": 72.89799783549773,
    "Rank": 836
  },
  {
    "ID": 1246,
    "NAME": "عبد الوهاب احمد محمود السهيلي",
    "Old_Total": 1314.95,
    "4th year": 922.61666666667,
    "Cumulative": 2237.56666666667,
    "Percent": 72.64826839826851,
    "Rank": 837
  },
  {
    "ID": 2520,
    "NAME": "نور الدين محمد عبد الفتاح عبد الحليم",
    "Old_Total": 1263.3,
    "4th year": 973.53333333333,
    "Cumulative": 2236.83333333333,
    "Percent": 72.62445887445877,
    "Rank": 838
  },
  {
    "ID": 877,
    "NAME": "ساندى محمد ناصر علي محمد حسن",
    "Old_Total": 1326.25,
    "4th year": 907.1125,
    "Cumulative": 2233.3625,
    "Percent": 72.51176948051949,
    "Rank": 839
  },
  {
    "ID": 2089,
    "NAME": "نادين هاني ابراهيم جبر",
    "Old_Total": 1308.5,
    "4th year": 922.37916666667,
    "Cumulative": 2230.87916666667,
    "Percent": 72.4311417748919,
    "Rank": 840
  },
  {
    "ID": 2147,
    "NAME": "نور ايهاب ابراهيم اسماعيل محمد",
    "Old_Total": 1325.8,
    "4th year": 905.025,
    "Cumulative": 2230.825,
    "Percent": 72.4293831168831,
    "Rank": 841
  },
  {
    "ID": 986,
    "NAME": "شهد ابراهيم احمد الشربيني حطب",
    "Old_Total": 1320.6,
    "4th year": 902.85833333333,
    "Cumulative": 2223.45833333333,
    "Percent": 72.19020562770552,
    "Rank": 842
  },
  {
    "ID": 2279,
    "NAME": "ياسمين محمد عبد الفتاح محمد",
    "Old_Total": 1307.15,
    "4th year": 915.6625,
    "Cumulative": 2222.8125,
    "Percent": 72.16923701298701,
    "Rank": 843
  },
  {
    "ID": 2015,
    "NAME": "منة الله مصطفي محمد عبد الوهاب",
    "Old_Total": 1262.6,
    "4th year": 957.5125,
    "Cumulative": 2220.1125,
    "Percent": 72.08157467532467,
    "Rank": 844
  },
  {
    "ID": 481,
    "NAME": "تقى احمد عبد العزيز ابو عياشة",
    "Old_Total": 1310.3,
    "4th year": 900.00416666667,
    "Cumulative": 2210.30416666667,
    "Percent": 71.76312229437241,
    "Rank": 845
  },
  {
    "ID": 501,
    "NAME": "جنا اشرف إبراهيم عبد المنعم",
    "Old_Total": 1289.8,
    "4th year": 919.8375,
    "Cumulative": 2209.6375,
    "Percent": 71.74147727272727,
    "Rank": 846
  },
  {
    "ID": 1427,
    "NAME": "فارس ادهم منصور الباز محمد التابعي",
    "Old_Total": 1262.1,
    "4th year": 947.31666666667,
    "Cumulative": 2209.41666666667,
    "Percent": 71.73430735930746,
    "Rank": 847
  },
  {
    "ID": 167,
    "NAME": "احمد هاشم عوض محمود",
    "Old_Total": 1297.9,
    "4th year": 908.74166666667,
    "Cumulative": 2206.64166666667,
    "Percent": 71.64420995671007,
    "Rank": 848
  },
  {
    "ID": 175,
    "NAME": "احمد وليد محمد اللقاني",
    "Old_Total": 1377.25,
    "4th year": 828.02083333333,
    "Cumulative": 2205.27083333333,
    "Percent": 71.59970238095227,
    "Rank": 849
  },
  {
    "ID": 938,
    "NAME": "سمر محمد محمد عبد الرحيم",
    "Old_Total": 1301.8,
    "4th year": 902.17083333333,
    "Cumulative": 2203.97083333333,
    "Percent": 71.55749458874449,
    "Rank": 850
  },
  {
    "ID": 1477,
    "NAME": "قدرية بشير كامل محمد هجرس",
    "Old_Total": 1385.75,
    "4th year": 814.6,
    "Cumulative": 2200.35,
    "Percent": 71.43993506493507,
    "Rank": 851
  },
  {
    "ID": 1997,
    "NAME": "منة الله احمد عبدالمنعم عبدالفتاح",
    "Old_Total": 1257.55,
    "4th year": 938.97916666667,
    "Cumulative": 2196.52916666667,
    "Percent": 71.31588203463214,
    "Rank": 852
  },
  {
    "ID": 1821,
    "NAME": "محمد ياسر السيد محمد مشالي",
    "Old_Total": 1289.1,
    "4th year": 906.21666666667,
    "Cumulative": 2195.31666666667,
    "Percent": 71.27651515151526,
    "Rank": 853
  },
  {
    "ID": 1146,
    "NAME": "عبد الرحمن محمد سعيد المرسى",
    "Old_Total": 1347.7,
    "4th year": 846.07083333333,
    "Cumulative": 2193.77083333333,
    "Percent": 71.22632575757567,
    "Rank": 854
  },
  {
    "ID": 1464,
    "NAME": "فيروز عادل حمدي علي",
    "Old_Total": 1257.7,
    "4th year": 932.87083333333,
    "Cumulative": 2190.57083333333,
    "Percent": 71.12242965367955,
    "Rank": 855
  },
  {
    "ID": 1225,
    "NAME": "عبد الله محمد حسين رفاعي",
    "Old_Total": 1338.95,
    "4th year": 849.03333333333,
    "Cumulative": 2187.98333333333,
    "Percent": 71.0384199134198,
    "Rank": 856
  },
  {
    "ID": 155,
    "NAME": "احمد مصطفى عبد الرحمن السعداوى",
    "Old_Total": 1278.35,
    "4th year": 904.17916666667,
    "Cumulative": 2182.52916666667,
    "Percent": 70.86133658008669,
    "Rank": 857
  },
  {
    "ID": 2003,
    "NAME": "منة الله سعيد مبروك على عبد العاطى",
    "Old_Total": 1290.7,
    "4th year": 890.37083333333,
    "Cumulative": 2181.07083333333,
    "Percent": 70.81398809523799,
    "Rank": 858
  },
  {
    "ID": 549,
    "NAME": "حبيبه حسن محمد حسن رزق",
    "Old_Total": 1321.25,
    "4th year": 854.8125,
    "Cumulative": 2176.0625,
    "Percent": 70.65137987012987,
    "Rank": 859
  },
  {
    "ID": 503,
    "NAME": "جنا عمرو مصطفى النحاس حسن على",
    "Old_Total": 1401,
    "4th year": 774.55,
    "Cumulative": 2175.55,
    "Percent": 70.63474025974027,
    "Rank": 860
  },
  {
    "ID": 2210,
    "NAME": "هبه اشرف محمد صلاح قطري",
    "Old_Total": 1201.42,
    "4th year": 973.425,
    "Cumulative": 2174.845,
    "Percent": 70.61185064935066,
    "Rank": 861
  },
  {
    "ID": 187,
    "NAME": "اروى السيد أحمد محمد ابو الوفا محمود",
    "Old_Total": 1267.6,
    "4th year": 907.11666666667,
    "Cumulative": 2174.71666666667,
    "Percent": 70.6076839826841,
    "Rank": 862
  },
  {
    "ID": 666,
    "NAME": "دينا عبدالحميد حلمى عبدالحميد الشماع",
    "Old_Total": 1300.95,
    "4th year": 873.75416666667,
    "Cumulative": 2174.70416666667,
    "Percent": 70.60727813852824,
    "Rank": 863
  },
  {
    "ID": 929,
    "NAME": "سما ابو المكارم رمضان الجندى",
    "Old_Total": 1273.05,
    "4th year": 900.53333333333,
    "Cumulative": 2173.58333333333,
    "Percent": 70.57088744588734,
    "Rank": 864
  },
  {
    "ID": 1235,
    "NAME": "عبد الله هشام قدري سالم",
    "Old_Total": 1235.6,
    "4th year": 927.3875,
    "Cumulative": 2162.9875,
    "Percent": 70.22686688311688,
    "Rank": 865
  },
  {
    "ID": 301,
    "NAME": "امل عدلى محمد على",
    "Old_Total": 1306,
    "4th year": 856.27916666667,
    "Cumulative": 2162.27916666667,
    "Percent": 70.20386904761915,
    "Rank": 866
  },
  {
    "ID": 1692,
    "NAME": "محمد اشرف إبراهيم عبد المنعم",
    "Old_Total": 1263.7,
    "4th year": 895.44166666667,
    "Cumulative": 2159.14166666667,
    "Percent": 70.10200216450228,
    "Rank": 867
  },
  {
    "ID": 2293,
    "NAME": "يحيي محمد ابراهيم يوسف",
    "Old_Total": 1355.7,
    "4th year": 801.6125,
    "Cumulative": 2157.3125,
    "Percent": 70.04261363636364,
    "Rank": 868
  },
  {
    "ID": 1392,
    "NAME": "عمرو حسن سعد عبد العزيز عوض",
    "Old_Total": 1216.05,
    "4th year": 940.375,
    "Cumulative": 2156.425,
    "Percent": 70.0137987012987,
    "Rank": 869
  },
  {
    "ID": 526,
    "NAME": "جولي أكرم نصر طناس",
    "Old_Total": 1252,
    "4th year": 889.90833333333,
    "Cumulative": 2141.90833333333,
    "Percent": 69.54247835497826,
    "Rank": 870
  },
  {
    "ID": 2315,
    "NAME": "يمنى محمد أحمد محمد فتح الله ناصر",
    "Old_Total": 1259.83,
    "4th year": 875.11666666667,
    "Cumulative": 2134.94666666667,
    "Percent": 69.31645021645032,
    "Rank": 871
  },
  {
    "ID": 964,
    "NAME": "سيف الدين عاطف على العبد",
    "Old_Total": 1262,
    "4th year": 872.74166666667,
    "Cumulative": 2134.74166666667,
    "Percent": 69.30979437229448,
    "Rank": 872
  },
  {
    "ID": 370,
    "NAME": "ايمان بشير السيد خضر",
    "Old_Total": 1160.6,
    "4th year": 971.99166666667,
    "Cumulative": 2132.59166666667,
    "Percent": 69.23998917748928,
    "Rank": 873
  },
  {
    "ID": 314,
    "NAME": "امير هشام جابر عبد الهادي رمضان",
    "Old_Total": 1241.45,
    "4th year": 889.49166666667,
    "Cumulative": 2130.94166666667,
    "Percent": 69.18641774891786,
    "Rank": 874
  },
  {
    "ID": 531,
    "NAME": "جويرية محمود محمد البدراوي",
    "Old_Total": 1181.95,
    "4th year": 945.5625,
    "Cumulative": 2127.5125,
    "Percent": 69.07508116883116,
    "Rank": 875
  },
  {
    "ID": 266,
    "NAME": "الاء خالد محمود محمد سليم",
    "Old_Total": 1253,
    "4th year": 873.7875,
    "Cumulative": 2126.7875,
    "Percent": 69.05154220779221,
    "Rank": 876
  },
  {
    "ID": 323,
    "NAME": "اميمة زكريا عبد الحميد السيد عبدالرازق",
    "Old_Total": 1282.9,
    "4th year": 842.93333333333,
    "Cumulative": 2125.83333333333,
    "Percent": 69.02056277056268,
    "Rank": 877
  },
  {
    "ID": 1149,
    "NAME": "عبد الرحمن مسعد ابراهيم المقطف",
    "Old_Total": 1239,
    "4th year": 881.11666666667,
    "Cumulative": 2120.11666666667,
    "Percent": 68.83495670995681,
    "Rank": 878
  },
  {
    "ID": 1706,
    "NAME": "محمد عادل محمد محمد خليفة",
    "Old_Total": 1174.1,
    "4th year": 943.74583333333,
    "Cumulative": 2117.84583333333,
    "Percent": 68.76122835497826,
    "Rank": 879
  },
  {
    "ID": 1304,
    "NAME": "على محمد على ابراهيم النجار",
    "Old_Total": 1196.85,
    "4th year": 919.7625,
    "Cumulative": 2116.6125,
    "Percent": 68.72118506493507,
    "Rank": 880
  },
  {
    "ID": 1763,
    "NAME": "محمد مجدي خميس ابوعامد",
    "Old_Total": 1200.25,
    "4th year": 911.925,
    "Cumulative": 2112.175,
    "Percent": 68.5771103896104,
    "Rank": 881
  },
  {
    "ID": 1229,
    "NAME": "عبد الله محمد عبد الله عبد اللطيف",
    "Old_Total": 1200.78,
    "4th year": 910.2,
    "Cumulative": 2110.98,
    "Percent": 68.5383116883117,
    "Rank": 882
  },
  {
    "ID": 2106,
    "NAME": "ندى حسام الدين جلال مرسي محمد",
    "Old_Total": 1218.9,
    "4th year": 885.48333333333,
    "Cumulative": 2104.38333333333,
    "Percent": 68.3241341991341,
    "Rank": 883
  },
  {
    "ID": 2234,
    "NAME": "هند طارق عبد العاطي محمود الشرقاوى",
    "Old_Total": 1250.4,
    "4th year": 845.0625,
    "Cumulative": 2095.4625,
    "Percent": 68.03449675324676,
    "Rank": 884
  },
  {
    "ID": 2142,
    "NAME": "نور الدين مصطفى عبدالواحد سيد",
    "Old_Total": 1262,
    "4th year": 831.9125,
    "Cumulative": 2093.9125,
    "Percent": 67.98417207792208,
    "Rank": 885
  },
  {
    "ID": 2187,
    "NAME": "نيروز ياسر حجاج العوادلي",
    "Old_Total": 1245.9,
    "4th year": 843.14166666667,
    "Cumulative": 2089.04166666667,
    "Percent": 67.82602813852824,
    "Rank": 886
  },
  {
    "ID": 110,
    "NAME": "احمد كريم ابراهيم خليل شرشر",
    "Old_Total": 1227.2,
    "4th year": 856.35416666667,
    "Cumulative": 2083.55416666667,
    "Percent": 67.64786255411266,
    "Rank": 887
  },
  {
    "ID": 1434,
    "NAME": "فاطمه الزهراء محمد حسين عبد الحميد يوسف",
    "Old_Total": 1258.68,
    "4th year": 822.94583333333,
    "Cumulative": 2081.62583333333,
    "Percent": 67.58525432900421,
    "Rank": 888
  },
  {
    "ID": 1934,
    "NAME": "مصطفى محمد احمد محمد احمد",
    "Old_Total": 1173.5,
    "4th year": 887.2875,
    "Cumulative": 2060.7875,
    "Percent": 66.90868506493506,
    "Rank": 889
  },
  {
    "ID": 540,
    "NAME": "حازم علاء السيد السيد",
    "Old_Total": 1149.5,
    "4th year": 906.51666666667,
    "Cumulative": 2056.01666666667,
    "Percent": 66.75378787878799,
    "Rank": 890
  },
  {
    "ID": 2247,
    "NAME": "وصال محمد السيد محمد السيد عوض",
    "Old_Total": 1205.8,
    "4th year": 846.21666666667,
    "Cumulative": 2052.01666666667,
    "Percent": 66.62391774891786,
    "Rank": 891
  },
  {
    "ID": 1572,
    "NAME": "مازن عبد السلام محمد عزالدين فرج ابوزيد",
    "Old_Total": 1206,
    "4th year": 844.77916666667,
    "Cumulative": 2050.77916666667,
    "Percent": 66.58373917748929,
    "Rank": 892
  },
  {
    "ID": 2121,
    "NAME": "نرمين ربيع على محمد",
    "Old_Total": 1210.75,
    "4th year": 836.3,
    "Cumulative": 2047.05,
    "Percent": 66.46266233766234,
    "Rank": 893
  },
  {
    "ID": 2324,
    "NAME": "يوسف ابراهيم محمود عبيد الله",
    "Old_Total": 1228.8,
    "4th year": 813.58333333333,
    "Cumulative": 2042.38333333333,
    "Percent": 66.31114718614708,
    "Rank": 894
  },
  {
    "ID": 2239,
    "NAME": "هيبه رحيم هيبه نصير",
    "Old_Total": 1189,
    "4th year": 845.70833333333,
    "Cumulative": 2034.70833333333,
    "Percent": 66.06195887445875,
    "Rank": 895
  },
  {
    "ID": 371,
    "NAME": "ايمان جابر صالح خليل حماده",
    "Old_Total": 1100,
    "4th year": 922.8625,
    "Cumulative": 2022.8625,
    "Percent": 65.6773538961039,
    "Rank": 896
  },
  {
    "ID": 1489,
    "NAME": "كاميليا حسين ممدوح حسين عبد الدايم",
    "Old_Total": 1199.7,
    "4th year": 820.575,
    "Cumulative": 2020.275,
    "Percent": 65.59334415584416,
    "Rank": 897
  },
  {
    "ID": 1356,
    "NAME": "عمر سعيد سعد حافظ",
    "Old_Total": 1155.05,
    "4th year": 861.00833333333,
    "Cumulative": 2016.05833333333,
    "Percent": 65.45643939393928,
    "Rank": 898
  },
  {
    "ID": 1284,
    "NAME": "على حاتم محمد محمد",
    "Old_Total": 1171.1,
    "4th year": 828.93333333333,
    "Cumulative": 2000.03333333333,
    "Percent": 64.93614718614708,
    "Rank": 899
  },
  {
    "ID": 178,
    "NAME": "احمد يوسف طايل عبدالعاطى",
    "Old_Total": 1084.45,
    "4th year": 914.42083333333,
    "Cumulative": 1998.87083333333,
    "Percent": 64.89840367965358,
    "Rank": 900
  },
  {
    "ID": 1095,
    "NAME": "عبد الرحمن احمد عزت محمد",
    "Old_Total": 1167,
    "4th year": 831.34,
    "Cumulative": 1998.34,
    "Percent": 64.88116883116884,
    "Rank": 901
  },
  {
    "ID": 1302,
    "NAME": "على محمد البسطويس السيد شلبي",
    "Old_Total": 1166.25,
    "4th year": 829.77083333333,
    "Cumulative": 1996.02083333333,
    "Percent": 64.8058712121211,
    "Rank": 902
  },
  {
    "ID": 507,
    "NAME": "جنى احمد محمود زكريا",
    "Old_Total": 1211.5,
    "4th year": 783,
    "Cumulative": 1994.5,
    "Percent": 64.75649350649351,
    "Rank": 903
  },
  {
    "ID": 13,
    "NAME": "ابراهيم علاء مرزوق على اغا",
    "Old_Total": 1094.25,
    "4th year": 896.30416666667,
    "Cumulative": 1990.55416666667,
    "Percent": 64.62838203463214,
    "Rank": 904
  },
  {
    "ID": 2327,
    "NAME": "يوسف احمد فاروق خطاب",
    "Old_Total": 1138,
    "4th year": 832.53333333333,
    "Cumulative": 1970.53333333333,
    "Percent": 63.97835497835488,
    "Rank": 905
  },
  {
    "ID": 1950,
    "NAME": "معتز عادل عبد الفتاح زغلول",
    "Old_Total": 1121.75,
    "4th year": 834.55833333333,
    "Cumulative": 1956.30833333333,
    "Percent": 63.51650432900422,
    "Rank": 906
  },
  {
    "ID": 788,
    "NAME": "ريناد محمد محمود نصر",
    "Old_Total": 1134.25,
    "4th year": 821.39166666667,
    "Cumulative": 1955.64166666667,
    "Percent": 63.49485930735942,
    "Rank": 907
  },
  {
    "ID": 1153,
    "NAME": "عبد الرحمن يس عبده محمد",
    "Old_Total": 1125.5,
    "4th year": 817.46666666667,
    "Cumulative": 1942.96666666667,
    "Percent": 63.08333333333344,
    "Rank": 908
  },
  {
    "ID": 1075,
    "NAME": "عائشة محمد عبدالقادر عبدالحميد",
    "Old_Total": 1121.05,
    "4th year": 810.0125,
    "Cumulative": 1931.0625,
    "Percent": 62.69683441558441,
    "Rank": 909
  },
  {
    "ID": 524,
    "NAME": "جورج وحيد زاهر درياس",
    "Old_Total": 1735.5,
    "4th year": 0,
    "Cumulative": 1735.5,
    "Percent": 56.3474025974026,
    "Rank": 910
  },
  {
    "ID": 972,
    "NAME": "شاهيناز محمد صديق محمد ابو حطب",
    "Old_Total": 1666,
    "4th year": 0,
    "Cumulative": 1666,
    "Percent": 54.09090909090909,
    "Rank": 911
  },
  {
    "ID": 1516,
    "NAME": "لجين ايهاب كمال حمامة",
    "Old_Total": 1619.6,
    "4th year": 0,
    "Cumulative": 1619.6,
    "Percent": 52.58441558441558,
    "Rank": 912
  },
  {
    "ID": 358,
    "NAME": "اية اشرف احمد محمد محمد",
    "Old_Total": 1588.55,
    "4th year": 0,
    "Cumulative": 1588.55,
    "Percent": 51.5762987012987,
    "Rank": 913
  },
  {
    "ID": 2141,
    "NAME": "نور الدين محمد انور نورالدين امين",
    "Old_Total": 1566.65,
    "4th year": 0,
    "Cumulative": 1566.65,
    "Percent": 50.86525974025974,
    "Rank": 914
  },
  {
    "ID": 229,
    "NAME": "اسلام محمد صلاح الدين عبد القوي",
    "Old_Total": 1557.6,
    "4th year": 0,
    "Cumulative": 1557.6,
    "Percent": 50.57142857142857,
    "Rank": 915
  },
  {
    "ID": 2005,
    "NAME": "منة عبد الله عبدالعليم مندى",
    "Old_Total": 1546.05,
    "4th year": 0,
    "Cumulative": 1546.05,
    "Percent": 50.19642857142858,
    "Rank": 916
  },
  {
    "ID": 2278,
    "NAME": "ياسمين عماد محمد بهنسي",
    "Old_Total": 1538.9,
    "4th year": 0,
    "Cumulative": 1538.9,
    "Percent": 49.96428571428572,
    "Rank": 917
  },
  {
    "ID": 232,
    "NAME": "اسماء اشرف محمد حسين سالم",
    "Old_Total": 1448.55,
    "4th year": 0,
    "Cumulative": 1448.55,
    "Percent": 47.03084415584415,
    "Rank": 918
  },
  {
    "ID": 806,
    "NAME": "زياد خالد عبدالرحمن سويلم الدخميسي",
    "Old_Total": 1440.4,
    "4th year": 0,
    "Cumulative": 1440.4,
    "Percent": 46.76623376623377,
    "Rank": 919
  },
  {
    "ID": 1689,
    "NAME": "محمد سلامة رمضان ابو حطب",
    "Old_Total": 1390.65,
    "4th year": 0,
    "Cumulative": 1390.65,
    "Percent": 45.15097402597403,
    "Rank": 920
  },
  {
    "ID": 681,
    "NAME": "رأفت احمد عبد الباسط عبد الحميد",
    "Old_Total": 1376.45,
    "4th year": 0,
    "Cumulative": 1376.45,
    "Percent": 44.68993506493506,
    "Rank": 921
  },
  {
    "ID": 391,
    "NAME": "ايه احمد عبده عبد الله خليفة",
    "Old_Total": 1299.85,
    "4th year": 0,
    "Cumulative": 1299.85,
    "Percent": 42.20292207792208,
    "Rank": 922
  },
  {
    "ID": 1274,
    "NAME": "علاء علاء الدين سليم امين خميس",
    "Old_Total": 1266.9,
    "4th year": 0,
    "Cumulative": 1266.9,
    "Percent": 41.13311688311689,
    "Rank": 923
  },
  {
    "ID": 1105,
    "NAME": "عبد الرحمن جمعة جابر عبد الغني احمد المخزنجى",
    "Old_Total": 1264.5,
    "4th year": 0,
    "Cumulative": 1264.5,
    "Percent": 41.05519480519481,
    "Rank": 924
  },
  {
    "ID": 142,
    "NAME": "احمد محمد محمد احمد العطار",
    "Old_Total": 1245.15,
    "4th year": 0,
    "Cumulative": 1245.15,
    "Percent": 40.42694805194805,
    "Rank": 925
  },
  {
    "ID": 2075,
    "NAME": "ميرهان عطيه علي عطيه سالم",
    "Old_Total": 1227.85,
    "4th year": 0,
    "Cumulative": 1227.85,
    "Percent": 39.86525974025974,
    "Rank": 926
  },
  {
    "ID": 564,
    "NAME": "حسن احمد حسن احمد برغوت",
    "Old_Total": 1225.15,
    "4th year": 0,
    "Cumulative": 1225.15,
    "Percent": 39.7775974025974,
    "Rank": 927
  },
  {
    "ID": 987,
    "NAME": "شهد ابراهيم حسن عامر",
    "Old_Total": 1222.8,
    "4th year": 0,
    "Cumulative": 1222.8,
    "Percent": 39.7012987012987,
    "Rank": 928
  },
  {
    "ID": 1329,
    "NAME": "عمر احمد حلمى كامل ابوزهرة",
    "Old_Total": 1217.55,
    "4th year": 0,
    "Cumulative": 1217.55,
    "Percent": 39.53084415584415,
    "Rank": 929
  },
  {
    "ID": 1774,
    "NAME": "محمد محمود محمد ابراهيم",
    "Old_Total": 1211.7,
    "4th year": 0,
    "Cumulative": 1211.7,
    "Percent": 39.34090909090909,
    "Rank": 930
  },
  {
    "ID": 811,
    "NAME": "زياد محمد تاج الدين عبد الجليل",
    "Old_Total": 1204.35,
    "4th year": 0,
    "Cumulative": 1204.35,
    "Percent": 39.10227272727273,
    "Rank": 931
  },
  {
    "ID": 1686,
    "NAME": "محمد سعد محمد خيرالله",
    "Old_Total": 1203.3,
    "4th year": 0,
    "Cumulative": 1203.3,
    "Percent": 39.06818181818182,
    "Rank": 932
  },
  {
    "ID": 1181,
    "NAME": "عبد الله ابراهيم حسين محمد حسن بر",
    "Old_Total": 1201.4,
    "4th year": 0,
    "Cumulative": 1201.4,
    "Percent": 39.00649350649351,
    "Rank": 933
  },
  {
    "ID": 1115,
    "NAME": "عبد الرحمن صبحي احمد علي جباره",
    "Old_Total": 1195.1,
    "4th year": 0,
    "Cumulative": 1195.1,
    "Percent": 38.80194805194805,
    "Rank": 934
  },
  {
    "ID": 2169,
    "NAME": "نوران احمد عبدالصمد خليل",
    "Old_Total": 1189.4,
    "4th year": 0,
    "Cumulative": 1189.4,
    "Percent": 38.61688311688312,
    "Rank": 935
  },
  {
    "ID": 1056,
    "NAME": "ضياء ايمن قطب ابوشريف",
    "Old_Total": 1176.95,
    "4th year": 0,
    "Cumulative": 1176.95,
    "Percent": 38.21266233766234,
    "Rank": 936
  },
  {
    "ID": 1144,
    "NAME": "عبد الرحمن محمد رمضان مهدى متولى",
    "Old_Total": 1173,
    "4th year": 0,
    "Cumulative": 1173,
    "Percent": 38.08441558441558,
    "Rank": 937
  },
  {
    "ID": 1699,
    "NAME": "محمد صلاح الدين سعد عبد العزيز",
    "Old_Total": 1167.75,
    "4th year": 0,
    "Cumulative": 1167.75,
    "Percent": 37.91396103896104,
    "Rank": 938
  },
  {
    "ID": 2008,
    "NAME": "منة الله علي سعد المشتولي",
    "Old_Total": 1152.25,
    "4th year": 0,
    "Cumulative": 1152.25,
    "Percent": 37.41071428571428,
    "Rank": 939
  },
  {
    "ID": 1886,
    "NAME": "مريم ابراهيم سعيد السيد",
    "Old_Total": 1143.5,
    "4th year": 0,
    "Cumulative": 1143.5,
    "Percent": 37.12662337662337,
    "Rank": 940
  },
  {
    "ID": 715,
    "NAME": "رفيده جلال على درويش",
    "Old_Total": 1141.6,
    "4th year": 0,
    "Cumulative": 1141.6,
    "Percent": 37.06493506493506,
    "Rank": 941
  },
  {
    "ID": 393,
    "NAME": "ايه اشرف محمد ابراهيم",
    "Old_Total": 1139.5,
    "4th year": 0,
    "Cumulative": 1139.5,
    "Percent": 36.99675324675324,
    "Rank": 942
  },
  {
    "ID": 1142,
    "NAME": "عبد الرحمن محمد حامد النجار",
    "Old_Total": 1124,
    "4th year": 0,
    "Cumulative": 1124,
    "Percent": 36.49350649350649,
    "Rank": 943
  },
  {
    "ID": 1505,
    "NAME": "كمال محمد كمال علي",
    "Old_Total": 1120.75,
    "4th year": 0,
    "Cumulative": 1120.75,
    "Percent": 36.38798701298701,
    "Rank": 944
  },
  {
    "ID": 1391,
    "NAME": "عمرو بشير احمد محمد",
    "Old_Total": 1107.25,
    "4th year": 0,
    "Cumulative": 1107.25,
    "Percent": 35.94967532467533,
    "Rank": 945
  },
  {
    "ID": 1702,
    "NAME": "محمد طارق ذكى عبدربه",
    "Old_Total": 1104.75,
    "4th year": 0,
    "Cumulative": 1104.75,
    "Percent": 35.86850649350649,
    "Rank": 946
  },
  {
    "ID": 1730,
    "NAME": "محمد عبد الوهاب عبد المحسن عبد الوهاب",
    "Old_Total": 1102.95,
    "4th year": 0,
    "Cumulative": 1102.95,
    "Percent": 35.81006493506494,
    "Rank": 947
  },
  {
    "ID": 1236,
    "NAME": "عبد الله هشام نعمان قويطه",
    "Old_Total": 1098.45,
    "4th year": 0,
    "Cumulative": 1098.45,
    "Percent": 35.66396103896104,
    "Rank": 948
  },
  {
    "ID": 614,
    "NAME": "حنين عبد الحميد محمد ابو ضيف فرغلى",
    "Old_Total": 1096.5,
    "4th year": 0,
    "Cumulative": 1096.5,
    "Percent": 35.60064935064935,
    "Rank": 949
  },
  {
    "ID": 82,
    "NAME": "احمد طاهر شعبان خليل",
    "Old_Total": 1093.25,
    "4th year": 0,
    "Cumulative": 1093.25,
    "Percent": 35.49512987012987,
    "Rank": 950
  },
  {
    "ID": 399,
    "NAME": "ايه محمد على حسين خليفة",
    "Old_Total": 1092.85,
    "4th year": 0,
    "Cumulative": 1092.85,
    "Percent": 35.48214285714285,
    "Rank": 951
  },
  {
    "ID": 848,
    "NAME": "ساره حماده محمد رضوان",
    "Old_Total": 1087.5,
    "4th year": 0,
    "Cumulative": 1087.5,
    "Percent": 35.30844155844156,
    "Rank": 952
  },
  {
    "ID": 2325,
    "NAME": "يوسف ابراهيم محمود فرو",
    "Old_Total": 1084.5,
    "4th year": 0,
    "Cumulative": 1084.5,
    "Percent": 35.21103896103896,
    "Rank": 953
  },
  {
    "ID": 613,
    "NAME": "حنين طارق عبد الفتاح عبدالقوى عطا",
    "Old_Total": 1070.1,
    "4th year": 0,
    "Cumulative": 1070.1,
    "Percent": 34.74350649350649,
    "Rank": 954
  },
  {
    "ID": 2096,
    "NAME": "ناصر مصطفى مصطفى ابوالنور",
    "Old_Total": 1067.75,
    "4th year": 0,
    "Cumulative": 1067.75,
    "Percent": 34.66720779220779,
    "Rank": 955
  },
  {
    "ID": 321,
    "NAME": "اميره فكري عبده الوكيل",
    "Old_Total": 1055.8,
    "4th year": 0,
    "Cumulative": 1055.8,
    "Percent": 34.27922077922078,
    "Rank": 956
  },
  {
    "ID": 1981,
    "NAME": "ملك هشام عبدالرحمن خليل",
    "Old_Total": 1017.75,
    "4th year": 0,
    "Cumulative": 1017.75,
    "Percent": 33.04383116883117,
    "Rank": 957
  },
  {
    "ID": 2356,
    "NAME": "يوسف محمد فوزي فرحات",
    "Old_Total": 1015,
    "4th year": 0,
    "Cumulative": 1015,
    "Percent": 32.95454545454545,
    "Rank": 958
  },
  {
    "ID": 1350,
    "NAME": "عمر خالد محمد طايع",
    "Old_Total": 1011.5,
    "4th year": 0,
    "Cumulative": 1011.5,
    "Percent": 32.84090909090909,
    "Rank": 959
  },
  {
    "ID": 1953,
    "NAME": "معتز وليد عادل عبد الحميد",
    "Old_Total": 973.25,
    "4th year": 0,
    "Cumulative": 973.25,
    "Percent": 31.59902597402597,
    "Rank": 960
  },
  {
    "ID": 1263,
    "NAME": "عصمت سعيد سعد نصار",
    "Old_Total": 961,
    "4th year": 0,
    "Cumulative": 961,
    "Percent": 31.2012987012987,
    "Rank": 961
  }
];
